{
    "courses": [
        {
            "dept": "buec",
            "code": "1000",
            "credit": 3.0,
            "name": "Principles of Business Administration",
            "prereqs": "",
            "desc": "This course provides an overview of the context within which modern organizations operate. It will examine the development of organizational and managerial theories. A number of contemporary issues and the organizational responses will be discussed."
        },
        {
            "dept": "buec",
            "code": "1600",
            "credit": 3.0,
            "name": "Introduction à la gestion",
            "prereqs": "",
            "desc": "Ce cours porte sur les principes de gestion, les types de gestion, les rôles/fonctions et les compétences des gestionnaires, et les défis actuels en matière de gestion. La théorie, la structure, la culture et le comportement des organisations sont étudiés. Les concepts théoriques sont illustrés par des applications pratiques à des problèmes et des scénarios de gestion du monde réel. "
        },
        {
            "dept": "buec",
            "code": "2610",
            "credit": 3.0,
            "name": "Introduction à la gestion de ressources humaines",
            "prereqs": "",
            "desc": "Ce cours analyse le rôle de la gestion et de l\u0092administration des ressources humaines, notamment l\u0092analyse d\u0092emplois, la planification, la sélection, la formation, l\u0092évaluation du rendement, la rémunération, les relations professionnelles et la sécurité, et la santé des employés.\r\nCours incompatible : GL/ILST 2110 3.00."
        },
        {
            "dept": "buec",
            "code": "2612",
            "credit": 3.0,
            "name": "Introduction au marketing",
            "prereqs": "",
            "desc": "Ce cours initie les étudiants aux modes d\u0092enquête en marketing - à la façon dont les mercaticiens voient le monde. Les étudiants apprennent à comprendre les marchés, ressortir l\u0092information pertinente des données, élaborer un plan et gérer un programme de marketing."
        },
        {
            "dept": "buec",
            "code": "3645",
            "credit": 3.0,
            "name": "Applied Business Analytics",
            "prereqs": "buec1600",
            "desc": "This course covers the processes, methodologies and practices used to transform data into useful information to support\r\nbusiness decision-making. In this hands-on course, students develop basic knowledge of data mining, analytics and visualizations\r\nusing SAP, Tableau and IBM software.\r\nPrerequisite: GL/ILST/BUEC 1600 3.0 or with professor permission."
        },
        {
            "dept": "buec",
            "code": "3646",
            "credit": 3.0,
            "name": "Business Information Systems",
            "prereqs": "buec1600",
            "desc": "This course covers the role of information systems in organizations, their support of business operations and decision making, and their impact on organizations' competitive position. Case studies and hands-on computer simulations and exercises are utilized.\r\nPrerequisite: GL/ILST/BUEC 1600 3.0 or with professor permission."
        },
        {
            "dept": "buec",
            "code": "4500",
            "credit": 3.0,
            "name": "Professional work placement",
            "prereqs": "econ2100",
            "desc": "For the optional placement, students must spend a minimum of 100 hours working for a company: government agencies, non-profit \r\norganizations, or research institutions. The placement experience must provide organizational experience and contribute to the student's knowledge base in Business Economics or Administration.\r\nPrerequisites: GL/ECON 2100 6.00, a GPA of 5.0 or better in BUEC major and permission of the Department."
        }
    ]
}