{
    "courses": [
        {
            "dept": "drca",
            "code": "1001",
            "credit": 3.0,
            "name": "Live Theatre: An Introduction",
            "prereqs": "",
            "desc": "This course offers an introduction to theatre as an art form. As a foundation course for theatre studies, it teaches how to analyze live performance. Attending and reviewing theatre performances is an essential component of the course.\nCourse credit exclusions:  GL/DRST 1000 6.00."
        },
        {
            "dept": "drca",
            "code": "1002",
            "credit": 3.0,
            "name": "Visual Art: An Introduction",
            "prereqs": "",
            "desc": "This course offers an introduction to thinking and writing about visual art. It teaches how to understand art's purposes and functions, and how to analyze works of art. Attending and reviewing art exhibitions is an essential component of the course."
        },
        {
            "dept": "drca",
            "code": "1200",
            "credit": 6.0,
            "name": "Smoke and Mirrors: An Introduction to Technical Theatre",
            "prereqs": "",
            "desc": "This course aims to give students an introduction to the technical processes of theatrical production, including scenery, lighting, sound, multimedia, properties, and stage management. Students will apply their \nnew skills to support at least one Glendon theatre production.\nCourse credit exclusion: GL/DRST 2200 6.00."
        },
        {
            "dept": "drca",
            "code": "1210",
            "credit": 3.0,
            "name": "Performance I",
            "prereqs": "",
            "desc": "This course acquaints students with key elements of performance through the study of written texts and practical exercises. After introducing major concepts central to all the performing arts, it focuses on fundamentals specific to text-based performance. Course credit exclusion: GL/DRST 2210 3.00."
        },
        {
            "dept": "drca",
            "code": "1215",
            "credit": 3.0,
            "name": "Performance II/Arts de la scène II",
            "prereqs": "",
            "desc": "This course pursues at a more advanced level the study of major concepts central to the performing arts, and the practice of performance exercises. It prepares the students to deal with text and acquaints them \nwith various performance styles./ Ce cours poursuit à un niveau plus avancé l'étude des concepts fondamentaux des arts de la scène et la pratique d'exercices. Il initie les étudiants au travail sur le texte et à différents styles de jeu théâtral.\nPRIOR TO FALL 2014: course credit exclusion: GL/DRST 2215 3.00."
        },
        {
            "dept": "drca",
            "code": "1625",
            "credit": 6.0,
            "name": "Lignes et formes",
            "prereqs": "",
            "desc": "Introduction à la pratique d'éléments de base du domaine du dessin. La réalisation de projets en deux et trois dimensions, utilisant différents matériaux et techniques, aide les personnes inscrites à développer leurs talents créateurs et à les utiliser au mieux. \nCours incompatibles : GL/HUMA 2500 6.00."
        },
        {
            "dept": "drca",
            "code": "2200",
            "credit": 3.0,
            "name": "Computer tools and applications for communication ",
            "prereqs": "",
            "desc": "This course teaches computer applications used in communication for an understanding of computer and Internet architecture, use of databases for communication, advanced tools in office and collaborative work, with a critical eye to issues like security, accessibility and multi-platform communication. "
        },
        {
            "dept": "drca",
            "code": "2621",
            "credit": 6.0,
            "name": "Faire du théâtre en français",
            "prereqs": "",
            "desc": "Ce cours introduit des notions générales sur les théâtres francophones, mettant l'accent sur le vocabulaire spécialisé de ce champ d'études. Les personnes dans le cours auront l'occasion de se familiariser concrètement avec toutes les disciplines d'une production théâtrale lors d'un spectacle public. "
        },
        {
            "dept": "drca",
            "code": "2632",
            "credit": 6.0,
            "name": "Western Drama: Ancient to Modern",
            "prereqs": "",
            "desc": "This course provides a text-based study of major theatrical achievements from early Greece to the late nineteenth century. This study situates the plays within cultural and historical contexts while focusing on practices of theatrical staging. PRIOR TO FALL 2010: course credit exclusions: GL/EN 2610 3.00, GL/EN 2612 3.00."
        },
        {
            "dept": "drca",
            "code": "2665",
            "credit": 6.0,
            "name": "Beauty and Power: Creations and Contexts in Visual Art ",
            "prereqs": "",
            "desc": "This course is a survey of visual art in diverse contexts and histories. Combining theory with practical elements, it teaches students to analyze artworks and practices in depth, and to work with key ideas in the study of the visual arts.  "
        },
        {
            "dept": "drca",
            "code": "2675",
            "credit": 6.0,
            "name": "Photographie numérique",
            "prereqs": "",
            "desc": "Ce cours de photographie numérique présente les grands principes de ce médium. Par le biais de lectures, d'exemples et d'ateliers, les personnes inscrites développent un regard critique sur cet art. Elles mettent en pratique leurs connaissances par la présentation de projets. \nCours incompatibles : GL/HUMA 3200 6.00."
        },
        {
            "dept": "drca",
            "code": "3600",
            "credit": 3.0,
            "name": "La dramaturgie du XVIIe siècle",
            "prereqs": "",
            "desc": "Ce cours porte sur le théâtre du « Grand Siècle ». Seront étudiées certaines oeuvres de Corneille, Molière et Racine aussi bien que quelques pièces baroques et les théories de Boileau sur le théâtre. Condition préalable : GL/FRAN 2870 3.00 ou GL/FRLS 2700 3.00 ou permission du département d'études françaises.\nCours incompatible: GL/FRAN 3250 3.00."
        },
        {
            "dept": "drca",
            "code": "3620",
            "credit": 6.0,
            "name": "Reading Shakespeare",
            "prereqs": "",
            "desc": "A study of a representative selection of Shakespeare's playtexts, with particular attention to how we produce their meanings.\nCourse credit exclusions: AP/EN 3535 6.00."
        },
        {
            "dept": "drca",
            "code": "3622",
            "credit": 6.0,
            "name": "Postcolonial Drama in English",
            "prereqs": "",
            "desc": "This course examines contemporary English-speaking postcolonial drama issuing from one or a combination of the following regions: South and West Africa, Southeast Asia, India, Australia, New Zealand, the Caribbean and Canada."
        },
        {
            "dept": "drca",
            "code": "3625",
            "credit": 3.0,
            "name": "Medieval English Drama",
            "prereqs": "",
            "desc": "This course studies the early development of English drama from the Biblical cycles of the medieval carft guilds, and the moralities and interludes, through to the humanist drama of the first half of the 16th century."
        },
        {
            "dept": "drca",
            "code": "3633",
            "credit": 3.0,
            "name": "Indigenous Drama and Theatre",
            "prereqs": "",
            "desc": "A study of the development of Indigenous drama and theatre in Canada, this course examines key performances and dramatic texts, and situates them within their theoretical, historical, and theatrical contexts. It also considers the practical aspects of staging and performance."
        },
        {
            "dept": "drca",
            "code": "3955",
            "credit": 6.0,
            "name": "Approaches to Theatre",
            "prereqs": "",
            "desc": "This course will introduce students to theatre by the study of theoretical and practical approaches to production. First-term classes and workshops will culminate in a second-term production."
        },
        {
            "dept": "drca",
            "code": "4200",
            "credit": 3.0,
            "name": "The Stage Director's Process/Le processus du metteur en scène",
            "prereqs": "drst1200 drst1210 drst1215 drst2517 drst2615",
            "desc": "This course introduces approaches towards directing, with an eye towards the relationship between director and actor. Students acquire skills through hands-on directorial experiences./Ce cours présente diverses approches de la mise en scène et, se concentre sur la relation entre le metteur en scène et l'acteur. L'apprentissage inclut des expériences pratiques.\nPrerequisites: At least two of the following: GL/DRCA/DRST 1200 6.00, GL/DRCA/DRST 1210 3.00, GL/DRCA/DRST 1215 3.00, GL/DRCA/DRST 2517 6.00, GL/DRCA/DRST 2615 6.00 or permission of the Department. "
        },
        {
            "dept": "drca",
            "code": "4621",
            "credit": 6.0,
            "name": "Current Intercultural Performance Practices",
            "prereqs": "",
            "desc": "This course offers historical, theoretical and experiential approaches to intercultural, multicultural, Indigenous, and diasporic performance, with an emphasis on contemporary practices. It provides a framework for understanding theatre and performance in relation to cultural specificity, both internationally and in Canada."
        }
    ]
}