{
    "courses": [
        {
            "dept": "eecs",
            "code": "1001",
            "credit": 1.0,
            "name": "Research Directions in Computing",
            "prereqs": "",
            "desc": "An introduction to research directions within the department and more broadly within the field. Students will attend lectures and other events organised by the department. Note: This course is expected to be completed in the first-year of study."
        },
        {
            "dept": "eecs",
            "code": "1011",
            "credit": 3.0,
            "name": "Computational Thinking through Mechatronics",
            "prereqs": "",
            "desc": "The Objectives of 1011 are threefold: providing a first exposure to procedural programming, teaching students a set of soft computing skills (such as reasoning about algorithms, tracing programs, test-driven development), and demonstrating how computers are used in a variety of engineering disciplines. It uses problem-based pedagogy to expose the underlying concepts and an experiential laboratory to implement them. An integrated computing environment (such as MATLAB) is used so that students can pick up key programming concepts(such as variables and control flow) without being exposed to complex or abstract constructs. The problems are chosen with consultation with the various engineering disciplines in the Faculty with a view of exposing how computing is used in these disciplines. Course credit exclusions: LE/EECS1541 3.00.\n"
        },
        {
            "dept": "eecs",
            "code": "1012",
            "credit": 3.0,
            "name": "Introduction to Computing: A Net-centric Approach",
            "prereqs": "",
            "desc": "The objectives of 1012 are threefold: providing a first exposure to event-driven programming, teaching students a set of computing skills (including reasoning about algorithms, tracing programs, test-driven development, unit testing), and providing an introduction to computing within a mobile, net-centric context. It uses problem-based approach to expose the underlying concepts and an experiential laboratory to implement them. A mature mobile software infrastructure \n(such as HTML, CSS, and JavaScript) is used so that students can pick up key programming concepts (such as variables and control flow) within a client-server context without being bogged down in complex or abstract constructs. Laboratory exercises expose students to a range of real-world problems with a view of motivating computational thinking and grounding the material covered in lecture. Prerequisites: One of (1)-(3) below must be met: (1) (New high school curriculum): One 4U Math course with a grade of at least 75%. (2) Completion of six credits from York University MATH courses (not including courses with second digit 5) with a GPA of 5.00 or better over these credits; (3) Completion of six credits from York University mathematics courses whose second digit is 5, with an average grade not below 7.00 (B+). Course credit exclusions: AP/ITEC 3020 3.00, SC/CSE 2041 4.00 (prior to Summer 2013) Previously offered as: LE/CSE 2041 4.00, LE/EECS 2041 4.00."
        },
        {
            "dept": "eecs",
            "code": "1015",
            "credit": 3.0,
            "name": "Introduction to Computer Science and Programming",
            "prereqs": "",
            "desc": "This course is an introduction to the concepts and tools of computer science as students learn a procedural subset of the Python programming language. Python has a variety of libraries in different domains allowing for the solution of interesting problems which has made it a popular language in industry and the academy. Students do hands-on work to design, write, debug and test computer programs that solve problems computationally.\n\nStudents study variables, assignments, expressions (arithmetic, relational and logical) and sequencing of statements to implement solutions for computational problems, in Python. They document programs with comments and preconditions. They analyze the type correctness of programs via a type checker. They use an Integrated Development Environment (IDE) to develop, unit-test and debug programs given a problem specification. They apply conditionals (including nested conditionals) to implement algorithms to solve computational problems. They code functions to develop modular programming solutions for computational problems. They apply Python loops (including nested loops) to implement algorithms to solve computational problems. They apply data structures, including tuples, sets, lists and dictionaries, to implement algorithms to solve computational\nproblems. They code simple recursive functions to implement algorithms to solve computational problems. Prerequisites: One of (1)-(3) below must be met: (1) (New high school curriculum): One 4U Math course with a grade of at least 75%. (2) Completion of six credits from York University MATH courses (not including courses with second digit 5) with a GPA of 5.00 or better over these credits; (3) Completion of six credits from York University mathematics courses whose second digit is 5, with an average grade not below 7.00 (B+). \n\n\n\n"
        },
        {
            "dept": "eecs",
            "code": "1019",
            "credit": 3.0,
            "name": "Discrete Mathematics for Computer Science",
            "prereqs": "math1190",
            "desc": "Introduction to abstraction. Use and development of precise formulations of mathematical ideas. Informal introduction to logic; introduction to naïve set theory; induction; relations and functions; big O-notation; recursive definitions, recurrence relations and their solutions; graphs and trees. Prerequisites: SC/MATH 1190 3.00, or two 4U Math courses, including MHF4U (Advanced Function). Course credit exclusions: LE/EECS 1028 3.00, SC/MATH 1028 3.00, SC/MATH 2320 3.00."
        },
        {
            "dept": "eecs",
            "code": "1021",
            "credit": 3.0,
            "name": "Object Oriented Programming from Sensors to Actuators",
            "prereqs": "eecs1011",
            "desc": "&quot;Introduces student to computational thinking - a process-based approach to problem solving. It uses a problem-based pedagogy to expose the underlying concepts and an experiential laboratory to implement them. The programming language is chosen so that it is widely used in a variety of applications, is object-oriented, and is of industrial strength (Java is an example of such a language). The problems are chosen in order to expose abstract programming concepts by immersing them in relevant and engaging applications. The experiential laboratory is based on sensors and actuators that connect to a computer. The problems are chosen with consultation with the various engineering disciplines in the Faculty with a view of exposing how computing is used in these disciplines. Prerequisites: LE/EECS1011 3.00. Course credit exclusions: LE/EECS 1022 3.00. Previously offered as: LE/EECS1020 3.00, LE/CSE 1020 3.00."
        },
        {
            "dept": "eecs",
            "code": "1022",
            "credit": 3.0,
            "name": "Programming for Mobile Computing",
            "prereqs": "eecs1012 eecs1015",
            "desc": "Provides a first exposure to object-oriented programming and enhances student understanding of key computing skills such as reasoning about algorithms, designing user interfaces, and working with software tools. It uses problem-based approach to expose the underlying concepts and an experiential laboratory to implement them. A mature mobile software infrastructure (such as Java and the Android programming environment) is used to expose and provide context to the underlying ideas. Laboratory exercises expose students to a range of real-world problems with a view of motivating computational thinking and grounding the material covered in lectures. Prerequisite: LE/EECS 1012 3.00 or LE/EECS 1015 3.00. Course credit exclusions: LE/EECS 1021 3.00, LE/EECS 1020 3.00 (prior to Fall 2014), LE/CSE 1020 3.00 (prior to Fall 2014), SC/CSE 1020 3.00 (prior to Summer 2013), AP/ITEC 1620 3.00."
        },
        {
            "dept": "eecs",
            "code": "1028",
            "credit": 3.0,
            "name": "Discrete Mathematics for Engineers",
            "prereqs": "",
            "desc": "An introduction to propositional logic and application to switching circuits; sets, relations and functions; predicate logic and proof techniques; induction with applications to program correctness; basic counting techniques with applications; graphs and trees with applications in circuit analysis, information storage and retrieval, Huffman coding; automata and applications in software engineering. Prerequisites: MHF4U (Advanced Function) and MCV4U (Calculus and Vectors). Course Credit exclusions: LE/CSE 1019 3.00 (prior to Fall 2014), LE/EECS 1019 3.00, SC/CSE 1019 3.00 (prior to Summer 2013), SC/MATH 1019 3.00, SC/MATH 2320 3.00."
        },
        {
            "dept": "eecs",
            "code": "1520",
            "credit": 3.0,
            "name": "Computer Use: Fundamentals",
            "prereqs": "",
            "desc": "An An introduction to the use of computers focusing on concepts of computer technology and organization (hardware and software) and the use of applications such as spreadsheets and information retrieval tools for problem solving. This course is designed for students who are not engineering or computer science majors. Students who plan to major in engineering or computer science are advised to take LE/EECS 1011 3.00 or LE/EECS 1012 3.00, respectively. Course credit exclusions: LE/CSE 1520 3.00, AK/AS/SC/CSE 1520 3.00. NCR Note: This course is not open to any student who has passed or is taking LE/EECS 1020 3.00, LE/CSE 1020 3.00, AK/AS/SC/CSE 1020 3.00, LE/EECS 1021 3.00, LE/EECS 1022 3.00. "
        },
        {
            "dept": "eecs",
            "code": "1530",
            "credit": 3.0,
            "name": "Computer Use: Programming",
            "prereqs": "",
            "desc": "Concepts of computer systems and technology - e.g. software engineering, algorithms, programming languages, theory of computation. Practical work focuses on problem solving using a high-level programming language. The course requires extensive laboratory work. This course is designed for students who are not Computer Science majors, but may be used as preparation by those who wish to major in Computer Science but lack programming background. Course credit exclusions: LE/EECS 1540 3.00, LE/CSE 1540 3.00 (prior to Fall 2014), SC/CSE 1540 3.00 prior to Summer 2013). Previously offered as: LE/CSE 1530 3.00, SC/CSE 1530 3.00. NCR: any student who has passed or is taking LE/EECS 1020 3.00 or LE/CSE 1020 3.00 or SC/CSE 1020 3.00 or LE/EECS 1021 3.00 or LE/EECS 1022 3.00 or AP/ITEC 1620 3.00."
        },
        {
            "dept": "eecs",
            "code": "1540",
            "credit": 3.0,
            "name": "Computer Use for the Natural Sciences",
            "prereqs": "",
            "desc": "Introduction to problem solving using computers - top down and modular design; implementation in a procedural programming language - control structures, data structures, subprograms; application to simple numerical methods, modelling and simulation in the sciences; use of library subprograms. Course credit exclusions: LE/EECS 1530 3.00. NCR: any student who has passed or is taking LE/EECS 1020 3.00, LE/CSE 1020 3.00 or LE/EECS 1021 3.00 or LE/EECS 1022 3.00 or AP/ITEC 1620 3.00. Previously offered as: LE/CSE 1540 3.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 1530 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 1540 3.00."
        },
        {
            "dept": "eecs",
            "code": "1541",
            "credit": 3.0,
            "name": "Introduction to Computing for the Physical Sciences",
            "prereqs": "math1013",
            "desc": "An introduction to scientific computing using an integrated computing and visualization platform. Elements of procedural programming such as: control structures, data types, program modules. Visualization in two and three dimensions. Applications to numerical computation and simulations relevant to the physical sciences. Prerequisite: SC/MATH 1013 3.00 or equivalent; Corequisites: SC/PHYS 1010 6.00 or SC/PHYS 1410 6.00 or SC/PHYS 1420 6.00; and SC/MATH 1021 3.00 or SC/MATH 1025 3.00. Course credit exclusions: LE/EECS 1011 3.00, LE/ EECS 1560 3.00, LE/EECS 1570 3.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 1560 3.00, LE/SE1570 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 1560 3.00, SC/CSE1570 3.00."
        },
        {
            "dept": "eecs",
            "code": "1560",
            "credit": 3.0,
            "name": "Introduction to Computing for Mathematics and Statistics",
            "prereqs": "math1300",
            "desc": "An introduction to scientific computing using an integrated computing and visualization environment. The course presents computer-based problem-solving techniques through a series of applications rooted in Mathematics and Statistics. Prerequisite: SC/MATH 1300 3.00: Corequisites: SC/MATH 1310 3.00; SC/MATH 1131 3.00 or SC/MATH 2030 3.00. Course credit exclusions: LE/EECS 1541 3.00, LE/EECS 1570 3.00. This course is not open to any student who has passed or is taking SC/PHYS 2030 3.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 1541 3.00, LE/CSE 1570 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 1541 3.00, SC/CSE 1570 3.00."
        },
        {
            "dept": "eecs",
            "code": "1570",
            "credit": 3.0,
            "name": "Introduction to Computing for Psychology",
            "prereqs": "math1505",
            "desc": "An introduction to computing concepts with applications to problems drawn from psychology, including concepts of computer programming in an integrated computing and visualization environment. Prerequisite: SC/MATH 1505 6.00. Course credit exclusions: LE/EECS 1541 3.00, LE/EECS 1560 3.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 1541 3.00, LE/CSE 1560 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 1541 3.00, SC/CSE 1560 3.00."
        },
        {
            "dept": "eecs",
            "code": "1710",
            "credit": 3.0,
            "name": "Programming for Digital Media",
            "prereqs": "",
            "desc": "Introduction to program design and implementation focusing on digital media projects including sound, images, and animation; includes algorithms, simple data structures, control structures, and debugging techniques. Course credit exclusions: LE/EECS 1530 3.00, LE/CSE 1530 3.00, SC/CSE 1530 3.00, AP/ITEC 1620 3.00. NCR: Students who completed or are taking LE/EECS 1021 3.00 or LE/EECS 1022 3.00 or LE/EECS 1020 3.00 or LE/CSE 1020 3.00, SC/CSE 1020 3.00."
        },
        {
            "dept": "eecs",
            "code": "1720",
            "credit": 3.0,
            "name": "Building Interactive Systems",
            "prereqs": "eecs1710",
            "desc": "A second course teaching more advanced programming concepts within the context of image, sound and interaction using an object-oriented language; introduction to interactive systems, user interfaces, event-driven programming, object design and inheritance; implementation using debuggers, integrated development environments, user interface builders. Prerequisite: LE/EECS 1710 3.00. Course credit exclusions: LE/EECS 1020 3.00, LE/EECS 1022 3.00, AP/ITEC 1620 3.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 1020 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 1020 3.00."
        },
        {
            "dept": "eecs",
            "code": "1910",
            "credit": 3.0,
            "name": "Industry Practicum",
            "prereqs": "",
            "desc": "This course is only available to students in the Industry Partnership Stream of the Computer Science Honours BSc (enrollment by permission). Students in the stream may enroll in the course during a term for which they are employed by the industrial partner. The learning outcomes of the course will be approved by the instructor prior to enrollment. Prerequisites: No prerequisite\n"
        },
        {
            "dept": "eecs",
            "code": "1911",
            "credit": 3.0,
            "name": "Industry Practicum ",
            "prereqs": "",
            "desc": "This course is only available to students in the Industry Partnership Stream of the Computer Science Honours BSc (enrollment by permission). Students in the stream may enroll in the course during a term for which they are employed by the industrial partner. The learning outcomes of the course will be approved by the instructor prior to enrollment. Prerequisites: No prerequisite\n"
        },
        {
            "dept": "eecs",
            "code": "2001",
            "credit": 3.0,
            "name": "Introduction to the Theory of Computation",
            "prereqs": "eecs1021 eecs1022 eecs1720 eecs1030 eecs1028 math1028 eecs1019 math1019",
            "desc": "Introduction to the theory of computing, including automata theory, formal languages and Turing machines; theoretical models and their applications in various fields of computer science. The emphasis is on practical applications of the theory and concepts rather than formal rigour. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 1021 3.00 or LE/EECS 1022 3.00 or LE/EECS 1720 3.00 or LE/EECS 1030 3.00; LE/EECS 1028 3.00 or SC/MATH 1028 3.00 or LE/EECS 1019 3.00 or SC/MATH 1019 3.00. Previously offered as: LE/CSE 2001 3.00. PRIOR TO SUMMER 2013: SC/CSE 2001 3.00."
        },
        {
            "dept": "eecs",
            "code": "2011",
            "credit": 3.0,
            "name": "Fundamentals of Data Structures",
            "prereqs": "eecs1030 eecs2030 eecs1028 math1028 eecs1019 math1019",
            "desc": "A study of fundamental data structures and their use in the efficient implementation of algorithms. Topics include abstract data types, lists, stacks, queues, trees and graphs. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;), LE/EECS 1030 3.00 or LE/EECS 2030 3.00, LE/EECS 1028 3.00 OR SC/MATH 1028 3.00 or LE/EECS 1019 3.00 or SC/MATH 1019 3.00. Previously offered as: LE/CSE 2011 3.00.\n\nThe course discusses the fundamental data structures commonly used in the design of algorithms. Abstract operations on data structures are specified using pre and post conditions and/or system invariants. Trade-offs between a number of different implementations of each abstract data types (ADT) are analyzed. Each algorithm operating on data structures is proved correct using loop invariants or induction. Both formal and informal proofs are introduced though most of the reasoning is done informally. Data structures are coded and unit tested in an object-oriented language. Selecting the appropriate ADT and a suitable implementation depending on the application is covered. Prerequisites: EECS1019 or EECS1028, EECS1030 or 2030, MATHS1090\nDate of submission: 2013-13-03"
        },
        {
            "dept": "eecs",
            "code": "2021",
            "credit": 4.0,
            "name": "Computer Organization",
            "prereqs": "eecs1021 eecs1022 eecs1720 eecs1030",
            "desc": "Introduction to computer organization and instruction set architecture, covering assembly language, machine language and encoding, addressing modes, single/multicycle datapaths (including functional units and controls), pipelining, memory segments and memory hierarchy. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 1021 3.00 or LE/EECS 1022 3.00 or LE/EECS 1720 3.00 or LE/EECS 1030 3.00. Previously offered as: LE/CSE 2021 4.00, SC/CSE 2021 4.00."
        },
        {
            "dept": "eecs",
            "code": "2030",
            "credit": 3.0,
            "name": "Advanced Object Oriented Programming",
            "prereqs": "eecs1021 eecs1022 eecs1720",
            "desc": "This course continues the separation of concern theme introduced in LE/EECS 1020 3.00 and LE/EECS1021 3.00. While 1020 and 1021 focuses on the client concern, this course focuses on the concern of the implementer. Hence, rather than using an API (Application Programming Interface) to build an application, the student is asked to implement a given API. Topics include implementing classes (non-utilities, delegation within the class definition, documentation and API generation, implementing contracts), aggregations (implementing aggregates versus compositions and implementing collections), inheritance hierarchies (attribute visibility, overriding methods, abstract classes versus interfaces, inner classes);\r\napplications of aggregation and inheritance in concurrent programming and event-driven programming; recursion; searching and sorting including quick and merge sorts); stacks and queues; linked lists; binary trees. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS1021 3.00 or LE/EECS 1020 (prior to Fall 2015) 3.00 or LE/EECS1022 3.00 or LE/EECS 1720 3.00. Course credit exclusions: AP/ITEC 2620 3.00. Previously offered as: LE/EECS1030 3.00, LE/CSE 1030 3.00."
        },
        {
            "dept": "eecs",
            "code": "2031",
            "credit": 3.0,
            "name": "Software Tools",
            "prereqs": "eecs1021 eecs1022 eecs1030 eecs1720",
            "desc": "Tools commonly used in the software development process: the C language; shell programming; filters and pipes; version control systems and &quot;make&quot;; debugging and testing. Prerequisites: Cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); one of LE/EECS 1021 3.00 or LE/EECS 1022 3.00 or LE/EECS 1030 3.00 or LE/EECS 1720 3.00\n\n"
        },
        {
            "dept": "eecs",
            "code": "2032",
            "credit": 4.0,
            "name": "Introduction to Embedded Systems",
            "prereqs": "eecs1021 eecs1022 eecs2021",
            "desc": "This course introduces students to embedded systems. The students will learn basic features of embedded system architecture, as well as how to design, implement, and test programs for embedded systems. Topics include microcontrollers architectures, peripherals and communication protocols, interfacing, and program development, and testing. Prerequisites: General Prerequisite: Cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;), LE/EECS 1021 3.00 , or LE/EECS 1022 3.00, and LE/EECS 2021 4.00.  Course Credit Exclusion LE/EECS 2031 3.00, LE/EECS 3215 4.00, LE/CSE 3215 4.00. Co-requsities: LE/EECS 2030 3.00.\n"
        },
        {
            "dept": "eecs",
            "code": "2200",
            "credit": 3.0,
            "name": "Electrical Circuits",
            "prereqs": "phys1010 phys1801",
            "desc": "This course covers the basic principles of linear circuits. Kirchhoff's laws, circuit equations, RL, RC, and RLC circuits, three-phase circuits, power analysis and power factor, and magnetically coupled circuits. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit&quot;&quot;5&quot;), SC/PHYS 1010 6.00 or SC/PHYS 1801 3.00. Course credit exclusions: SC/PHYS 3050 3.00.\n"
        },
        {
            "dept": "eecs",
            "code": "2210",
            "credit": 3.0,
            "name": "Electronic Circuits and Devices",
            "prereqs": "eng2200",
            "desc": "This course covers the basic material required in the design of both analog and digital electronic circuits. Diodes, transistors (both BJT and FET), amplifiers, rectifiers. Prerequisites: Cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;), LE/ENG 2200 3.00. Course credit exclusion: SC/PHYS 3150 3.00."
        },
        {
            "dept": "eecs",
            "code": "2311",
            "credit": 3.0,
            "name": "Software Development Project",
            "prereqs": "eecs1030 eecs2030",
            "desc": "This course allows students to develop a significant piece of software utilizing all the skills they have acquired so far. This includes requirement elicitation, system specification, implementation, testing, deployment, and user documentation. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 1030 3.00 or LE/EECS 2030 3.00."
        },
        {
            "dept": "eecs",
            "code": "2501",
            "credit": 1.0,
            "name": "Fortran and Scientific Computing",
            "prereqs": "eecs1020 eecs1530",
            "desc": "Covers computer-based problem solving in a variety of scientific and engineering settings. Introduces the FORTRAN programming language and its interface with scientific libraries. Applications are drawn mainly from scientific areas such as numerical methods, processing experimental data, simulation and data visualization. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (EECS courses with the second digit &quot;5&quot; are not major courses.); One of LE/EECS 1020 3.00 or EECS1021 3.00 or EECS1022 3.00 or LE/EECS 1530 3.00. "
        },
        {
            "dept": "eecs",
            "code": "2910",
            "credit": 3.0,
            "name": "Industry Practicum",
            "prereqs": "",
            "desc": "This course is only available to students in the Industry Partnership Stream of the Computer Science Honours BSc (enrollment by permission). Students in the stream may enroll in the course during a term for which they are employed by the industrial partner. The learning outcomes of the course will be approved by the instructor prior to enrollment. Prerequisites: 12 EECS credits in the 1000 level"
        },
        {
            "dept": "eecs",
            "code": "2911",
            "credit": 3.0,
            "name": "Industry Practicum",
            "prereqs": "",
            "desc": "This course is only available to students in the Industry Partnership Stream of the Computer Science Honours BSc (enrollment by permission). Students in the stream may enroll in the course during a term for which they are employed by the industrial partner. The learning outcomes of the course will be approved by the instructor prior to enrollment. Prerequisites: 12 EECS credits in the 1000 level\n"
        },
        {
            "dept": "eecs",
            "code": "3000",
            "credit": 3.0,
            "name": "Professional Practice in Computing",
            "prereqs": "eecs2030 eecs1030",
            "desc": "Professional, legal and ethical issues in the development, deployment and use of computer systems; their impact on society including privacy and security, computer crime, malware, and intellectual property; professional ethics and responsibilities; guest lecturers from industry, government and university. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00. Course credit exclusions: LE/ENG 4000 6.00, SC/ENG 4000 6.00 (prior to Summer 2013)."
        },
        {
            "dept": "eecs",
            "code": "3101",
            "credit": 3.0,
            "name": "Design and Analysis of Algorithms",
            "prereqs": "eecs2011 math1090 math1310",
            "desc": "Review of fundamental data structures. Analysis of algorithms: time and space complexity. Algorithm design paradigms: divide-and-conquer, exploring graphs, greedy methods, local search, dynamic programming, probabilistic algorithms, computational geometry. NP-complete problems. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2011 3.00; SC/MATH 1090 3.00; SC/MATH 1310 3.00. Course credit exclusion: LE/SC CSE 3101 3.00."
        },
        {
            "dept": "eecs",
            "code": "3121",
            "credit": 3.0,
            "name": "Numerical Methods I",
            "prereqs": "math1010 math1014 math1310 math1021 math1025 math2221 eecs1540 eecs2031 eecs2501",
            "desc": "An introductory course in computational linear algebra. Topics include simple error analysis, linear systems of equations, non-linear equations, linear least squares and interpolation. Prerequisites: One of SC/MATH 1010 3.00, SC/MATH 1014 3.00, SC/MATH 1310 3.00; one of SC/MATH 1021 3.00, SC/MATH 1025 3.00, SC/MATH 2221 3.00; one of LE/EECS 1540 3.00, LE/EECS 2031 3.00, or LE/EECS 2501 1.00. Course credit exclusions: LE/EECS 3121 3.00, LE/CSE 3121 3.00 (prior to Fall 2014), SC/CSE 3121 3.00 (prior to Summer 2013).\n"
        },
        {
            "dept": "eecs",
            "code": "3122",
            "credit": 3.0,
            "name": "Numerical Methods II",
            "prereqs": "math3241 eecs3121",
            "desc": "Algorithms and computer methods for solving problems of differentiation, integration, systems of non-linear equations and matrix eigenvalues. Prerequisite: SC/MATH 3241 3.00 or LE/EECS 3121 3.00. Course credit exclusions: LE/EECS 3122 3.00, LE/CSE 3122 3.00 (prior to Fall 2014), SC/CSE 3.00 (prior to Summer 2013).\n"
        },
        {
            "dept": "eecs",
            "code": "3201",
            "credit": 4.0,
            "name": "Digital Logic Design",
            "prereqs": "eecs1021 eecs1022 phys1801",
            "desc": "Theory, analysis, and design of logic circuits used in digital systems. Students will be introduced to design of switching circuits to implement logic gates, digital number representation and arithmetic circuits. They will learn how to use logic gates to construct combinational and sequential logic\ncircuits and functional blocks. The course and the laboratory introduces the students to hardware description language and modern cad tools. Prerequisites: Cumulative GPA of 4.50 or better over all major EECS courses.(without second digit of '5 ) LE/EECS 1021 3.00 or LE/EECS 1022 3.00; SC/PHYS 1012 or SC/PHYS 1412 or SC/PHYS 1422 or SC/PHYS 1801 3.0 or SC/PHYS 1010"
        },
        {
            "dept": "eecs",
            "code": "3213",
            "credit": 3.0,
            "name": "Communication Networks",
            "prereqs": "eecs2030 eecs1030 math1310",
            "desc": "Introduces the basics of communications and networking. Topics include transmission media; fundamental limits; protocols and hierarchies; the OSI model; encoding of data as signals; error and flow control; medium access; routing; internetworking; transport services; high-level applications. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; SC/MATH 1310 3.00. Previously offered as: LE/CSE 3213 3.00. PRIOR TO SUMMER 2013: SC/CSE 3213 3.00."
        },
        {
            "dept": "eecs",
            "code": "3214",
            "credit": 3.0,
            "name": "Computer Network Protocols and Applications",
            "prereqs": "eecs2030 eecs1030",
            "desc": "This course focuses on the higher-level network protocols, security issues, network programming, and applications. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; NCR: This course is not open for credit to students who passed LE/EECS 4213 3.00, LE/CSE 4213 3.00, SC/CSE 4213 3.00, LE/CSE 4213 3.00, SC/CSE 4213 3.00."
        },
        {
            "dept": "eecs",
            "code": "3215",
            "credit": 4.0,
            "name": "Embedded Systems",
            "prereqs": "eecs2031 eecs3201",
            "desc": "Introduction to the design of embedded systems using both hardware and software. Topics include microcontrollers; their architecture, and programming; design and implementation of embedded systems using field programmable gate arrays. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2031 3.00, LE/EECS 3201 4.00. Course Credit Exclusion: LE/CSE 3215 4.00."
        },
        {
            "dept": "eecs",
            "code": "3216",
            "credit": 3.0,
            "name": "Digital Systems Engineering: Modeling, Implementation and Validation",
            "prereqs": "eecs2032 eecs2031 eecs3201",
            "desc": "This is a project intensive course to introduce students to modeling, implementation, testing, and validation of hardware-based embedded systems. The emphasis in this course is on complex digital systems that interact with physical systems. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;), LE/EECS 2032 4.00, or LE/EECS 2031 3.00, and  LE/EECS 3201 3.00."
        },
        {
            "dept": "eecs",
            "code": "3221",
            "credit": 3.0,
            "name": "Operating System Fundamentals",
            "prereqs": "eecs2030 eecs1030 eecs2021 eecs2031 eecs2032",
            "desc": "Principles of operating systems. Concurrent processes, CPU scheduling, deadlocks, memory management, file systems, protection and security, and case studies. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2021 4.00 and LE/EECS 2031 3.00 or LE/EECS 2032 4.00. Course Credit Exclusion: LE/CSE 3221 3.00"
        },
        {
            "dept": "eecs",
            "code": "3311",
            "credit": 3.0,
            "name": "Software Design",
            "prereqs": "eecs2030 eecs1030 eecs2011 math1090 eecs2031 eecs2032",
            "desc": "A study of design methods and their use in the correct implementation, maintenance and evolution of software systems. Topics include design, implementation, testing, documentation needs and standards, support tools. Students design and implement components of a software system. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2011 3.00; SC/MATH 1090 3.00; LE/EECS 2031 3.00 or LE/EECS 2032 4.00. Course Credit Exclusions: LE/CSE 3311 3.00"
        },
        {
            "dept": "eecs",
            "code": "3342",
            "credit": 3.0,
            "name": "System Specification and Refinement",
            "prereqs": "eecs2030 eecs1030 eecs2011 math1090",
            "desc": "Theory and tools for specifying computer systems (sequential, concurrent and embedded). Specification (via set theory and predicate logic), modelling, abstraction, refinement and formal reasoning are undertaken before code development so that systems are correct by construction under the stated assumptions. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2011 3.00; SC/MATH 1090 3.00."
        },
        {
            "dept": "eecs",
            "code": "3401",
            "credit": 3.0,
            "name": "Introduction to Artificial Intelligence and Logic Programming",
            "prereqs": "eecs2030 eecs1030 eecs2011",
            "desc": "Artificial Intelligence (AI) deals with how to build intelligent systems. In this course, we examine fundamental concepts in AI: knowledge representation and reasoning, search, constraint satisfaction, reasoning under uncertainty, etc. The course also introduces logic programming and Prolog. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2011 3.00; MATH 1090 3.00. Previously offered as: LE/CSE 3401 3.00. PRIOR TO FALL 2014: course credit exclusion: LE/CSE 3402 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 3401 3.00, SC/CSE 3402 3.00."
        },
        {
            "dept": "eecs",
            "code": "3421",
            "credit": 3.0,
            "name": "Introduction to Database Systems",
            "prereqs": "eecs2030 eecs1030",
            "desc": "Concepts, approaches and techniques in database management systems (DBMS). Logical model of relational databases. An introduction to relational database design. Other topics such as query languages, crash recovery and concurrency control. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; Course credit exclusions: AP/ITEC 3220 3.00. Previously offered as: LE/CSE 3421 3.00. PRIOR TO SUMMER 2013: SC/CSE 3421 3.00."
        },
        {
            "dept": "eecs",
            "code": "3431",
            "credit": 3.0,
            "name": "Introduction to 3D Computer Graphics",
            "prereqs": "eecs2030 math1025",
            "desc": "Introduces the fundamental concepts and algorithms of three-dimensional computer graphics, including object modelling, transformations, cameras, visibility and shading. Prerequisites: Cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00;\nSC/MATH 1025 3.00. Course credit exclusions: AK/AS/SC/CSE 4431 3.00."
        },
        {
            "dept": "eecs",
            "code": "3451",
            "credit": 4.0,
            "name": "Signals and Systems",
            "prereqs": "eecs2021 math1310",
            "desc": "An introduction to the mathematical background in signals and systems; signal and image processing: sampling, discrete Fourier transform, filtering; linear system theory; Kalman filtering; feedback. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2021 4.00, SC/MATH 1310 3.00. Course credit exclusions: SC/MATH 4130B 3.00, SC/PHYS 4060 3.00. Previously offered as: LE/CSE 3451 4.00. PRIOR TO FALL 2014: course credit exclusions: SC/MATH 4830 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 3451 4.00, SC/EATS 4020 3.00."
        },
        {
            "dept": "eecs",
            "code": "3461",
            "credit": 3.0,
            "name": "User Interfaces",
            "prereqs": "eecs2030 eecs1030",
            "desc": "Introduces user interfaces and the tools and mechanisms to create and prototype them. Students work in small groups and learn how to design user interfaces, how to realize them and how to evaluate the end result. Prerequisite: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00. Course credit exclusions: AP/ITEC 3230 3.00. Previously offered as: LE/CSE 3461 3.00. PRIOR TO SUMMER 2013: SC/CSE 3461 3.00."
        },
        {
            "dept": "eecs",
            "code": "3481",
            "credit": 3.0,
            "name": "Applied Cryptography",
            "prereqs": "eecs2011",
            "desc": "An overview of cryptographic algorithms and the main cryptosystems in use today, emphasizing the application of cryptographic algorithms to designing secure protocols. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;);  LE/EECS 2011 3.00."
        },
        {
            "dept": "eecs",
            "code": "3482",
            "credit": 3.0,
            "name": "Introduction to Computer Security",
            "prereqs": "",
            "desc": "Introduces fundamental computer security concepts. Topics include security goals and terminology, an overview of the various security domains, an introduction to cryptography, security policies, risk management and auditing. Laboratory exercises emphasize these topics in a practical manner. Prerequisites: Any 12 university credits at the 2000-level in any discipline."
        },
        {
            "dept": "eecs",
            "code": "3505",
            "credit": 3.0,
            "name": "Electrical Systems for Mechanical Engineers",
            "prereqs": "phys1801 mech2502",
            "desc": "Many mechanical systems today are integrated with electrical systems. This course will prepare students to work on electromechanical systems by introducing them to topics such as: The basics of circuit analysis and setup, as well as electronics; power systems including 3-phase; DC and AC motors; electro-mechanical actuators; and, time permitting, basics of communication protocols. Prerequisites: SC/PHYS 1801 3.00, LE/MECH 2502 3.00."
        },
        {
            "dept": "eecs",
            "code": "3603",
            "credit": 4.0,
            "name": "Electromechanical Energy Conversion",
            "prereqs": "eecs2200 phys2020",
            "desc": "This course covers the basic construction and principles of operation of different types of electric machines; magnetic circuit analysis, single-phase and poly-phase transformers, principles of electromechanical energy conversion, DC machines, three-phase induction machines, synchronous machines, and special machines (stepper motors, linear motors and brushless DC (BLDC) motors). The transients and dynamics of machines are analyzed. Introduction of Solid-State control of motors. In addition to lectures and tutorials, field trip: six hours. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2200 3.00, SC/PHYS 2020 3.00."
        },
        {
            "dept": "eecs",
            "code": "3604",
            "credit": 4.0,
            "name": "Electromagnetic theory and wave propagation",
            "prereqs": "math1014 math1025 phys2020",
            "desc": "Provides the student with an introduction to partial differential equations and the mathematics of wave propagation. Specific applications to electromagnetic waves are discussed. Guided waves, transmission lines, and antennas are also introduced. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); SC/MATH 1014 3.00 or SC/MATH 1025 3.00 or SC/PHYS 2020 3.00."
        },
        {
            "dept": "eecs",
            "code": "3611",
            "credit": 4.0,
            "name": "Analog Electronics",
            "prereqs": "eecs2210",
            "desc": "This course focuses on the analysis and design of analog electronic circuits in bipolar and CMOS technology. It covers the aspects of circuit design from single transistor operation to complex amplifiers, operational amplifiers and feedback. Prerequisites: Cumulative GPA of 4.50 or better over all\nmajor EECS courses (without second digit &quot;5&quot;); LE/EECS 2210 3.00."
        },
        {
            "dept": "eecs",
            "code": "3622",
            "credit": 4.0,
            "name": "Introduction to Power Systems",
            "prereqs": "eecs2200",
            "desc": "The course discusses the basic modeling and analysis techniques in electrical energy systems including generation, transmission, and distribution systems. It covers the power system fundamentals consisting of 3-phase systems, complex and phasor quantities, single line diagrams and Per Unit system of calculations. Concept of complex power and active and reactive power are covered and reactive power compensation is also described. Functional descriptions and modeling of generators, transformers, transmission lines, motors and other loads are discussed. Various types of renewable energy systems are also introduced and basic functionality of the critical components of these systems are discussed. Prerequisites: Cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2200 3.00. Course Credit Exclusion LE/EECS 4622 4.00"
        },
        {
            "dept": "eecs",
            "code": "3900",
            "credit": 0.0,
            "name": "Computer Science Internship Work Term",
            "prereqs": "eecs3311 cse3311 cse3311",
            "desc": "This experiential education course reflects the work term component of the Technology Internship Program (TIP). Qualified Honours students gain relevant work experience as an integrated complement to their academic studies, reflected in the requirements of a learning agreement and work term report. Students are required to register in this course for each four month work term, with the maximum number of work term courses being four (i.e. 16 months). Students in this course receive assistance from the Career Centre prior to and during their internship, and are also assigned a Faculty Supervisor/Committee. Prerequisites: Enrolment is by permission only. Criteria for permission include: 1. that students have successfully completed at least nine EECS or CSE credits at the 3000-level including LE/EECS 3311 3.00 or LE/CSE 3311 3.00 or SC/CSE 3311 3.00, with a GPA of at least 6.0 in all mathematics and computer science courses completed; 2. that students are enrolled full-time in the Honours program prior to beginning their internship and have attended the mandatory preparatory sessions as outlined by the Career Centre; 3. that students have not been absent for more than two consecutive years as a full-time student from their Honours degree studies; 4. that upon enrolling in this course students have a minimum of 9 credits remaining toward their Honours degree and need to return as a full-time student for at least one academic term to complete their degree after completion of their final work term. Registration in LE/EECS 3900 0.00 (formerly LE/CSE 3900 0.00, SC/CSE 3900 0.00) provides a record on the transcript for each work term."
        },
        {
            "dept": "eecs",
            "code": "3910",
            "credit": 3.0,
            "name": "Industry Practicum",
            "prereqs": "",
            "desc": "This course is only available to students in the Industry Partnership Stream of the Computer Science Honours BSc (enrollment by permission). Students in the stream may enroll in the course during a term for which they are employed by the industrial partner. The learning outcomes of the course will be approved by the instructor prior to enrollment. Prerequisites: EECS credits in the 2000 level\n"
        },
        {
            "dept": "eecs",
            "code": "3911",
            "credit": 3.0,
            "name": "Industry Practicum",
            "prereqs": "",
            "desc": "This course is only available to students in the Industry Partnership Stream of the Computer Science Honours BSc (enrollment by permission). Students in the stream may enroll in the course during a term for which they are employed by the industrial partner. The learning outcomes of the course will be approved by the instructor prior to enrollment. Prerequisites: EECS credits in the 2000 level\n"
        },
        {
            "dept": "eecs",
            "code": "3980",
            "credit": 0.0,
            "name": "Computer Security Internship Work Term",
            "prereqs": "eecs3482 cse3482 cse3482",
            "desc": "This experiential education course reflects the work term component of the Technology Internship Program (TIP). Qualified Honours students gain relevant work experience as an integrated complement to their academic studies, reflected in the requirements of a learning agreement and work term report. Students are required to register in this course for each four month work term, with the maximum number of work term courses being four (i.e. 16 months). Students in this course receive assistance from the Career Centre prior to and during their internship, and are also assigned a Faculty Supervisor/Committee. Prerequisites: Enrolment is by permission only. Criteria for permission include: 1. that students have successfully completed at least nine EECS or CSE credits at the 3000-level including LE/EECS 3482 3.00 or LE/CSE 3482 3.00 or SC/CSE 3482 3.00, with a GPA of at least 6.00 in all mathematics and computer science courses completed; 2. that students are enrolled full-time in the Honours program prior to beginning their internship and have attended the mandatory preparatory sessions as outlined by the Career Centre; 3. that students have not been absent for more than two consecutive years as a full-time student from their Honours degree studies; 4. that upon enrolling in this course students have a minimum of nine credits remaining toward their Honours degree and need to return as a full-time student for at least one academic term to complete their degree after completion of their final work term. Registration in LE/EECS 3980 0.00 (formerly LE/CSE 3980 0.00, SC/CSE 3980 0.00) provides a record on the transcript for each work term."
        },
        {
            "dept": "eecs",
            "code": "4070",
            "credit": 3.0,
            "name": "Directed Studies ",
            "prereqs": "eecs2030 eecs1030",
            "desc": "By special arrangement, a student may carry out independent study in a specialized area of computer science or engineering under the direction of a member of the EECS department. The student will be expected to meet regularly with the supervisor throughout the term. In addition to regular meetings with the supervisor, a student is expected to do about 10 hours per week on reading and preparation of assigned work. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;), LE/EECS 2030 3.00 or LE/EECS 1030 3.00, successful completion of 24 credits in EECS and permission of course coordinator.\n"
        },
        {
            "dept": "eecs",
            "code": "4080",
            "credit": 3.0,
            "name": "Computer Science Project",
            "prereqs": "eecs2030 eecs1030",
            "desc": "A project in computer science chosen in consultation with, and supervised by, a member of the department. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; permission of the Instructor. Normally restricted to students who have taken 36 credits in computer science. Course credit exclusions: LE/EECS 4081 6.00, LE/EECS 4082 6.00, LE/EECS 4084 6.00, LE/EECS 4088 6.00, LE/EECS 4480 6.00, LE/ENG 4000 6.00. PRIOR TO FALL 2014: Course credit exclusions: LE/CSE 4081 6.00, SC/CSE 4081 6.00, LE/CSE 4082 6.00, SC/CSE 4082 6.00, LE/CSE 4084 6.00, SC/CSE 4084 6.00, LE/CSE 4088 6.00, SC/CSE 4088 6.00, LE/CSE 4480 3.00, SC/CSE 4480. LE/EECS 4700 6.00, LE/CSE 4700 6.00, LE/ENG 4000 6.00, SC/ENG 4000 6.00."
        },
        {
            "dept": "eecs",
            "code": "4088",
            "credit": 6.0,
            "name": "Computer Science Capstone Project",
            "prereqs": "eecs2030 eecs1030",
            "desc": "A project in computer science chosen in consultation with, and supervised by, a member of the department. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;), LE/EECS 2030 3.00 or LE/EECS 1030 3.00, permission of the Instructor. Normally restricted to students who have taken 36 credits in computer science. Course credit exclusions: LE/EECS 4080 3.00, LE/EECS 4081 6.00, LE/EECS 4082 6.00, LE/EECS 4084 6.00, LE/EECS 4480 3.00, LE/EECS 4700 6.00, LE/ENG 4000 6.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 4080 3.00, LE/CSE 4081 6.00, LE/CSE 4082 6.00, LE/CSE 4084 6.00, LE/CSE 4480 3.00, LE/CSE 4700 6.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 4080 3.00, SC/CSE 4081 6.00, SC/CSE 4082 6.00, SC/CSE 4084 6.00, SC/CSE 4480 3.00, SC/ENG 4000 6.00."
        },
        {
            "dept": "eecs",
            "code": "4090",
            "credit": 6.0,
            "name": "Software Development Capstone Project",
            "prereqs": "eecs3311 eecs3101 eecs3342",
            "desc": "Large-scale project involving all stages of the software development life cycle: requirements, analysis and design, implementation, testing and delivery.  Team work.  Open only to students in the Software Development Stream.  Prerequisites:  LE/EECS 3311 3.00 (with minimum grade of B), LE/EECS 3101 3.00, LE/EECS 3342 3.00. Corequisites:  LE/EECS 4312 3.00, LE/EECS 4313 3.00."
        },
        {
            "dept": "eecs",
            "code": "4101",
            "credit": 3.0,
            "name": "Advanced Data Structures",
            "prereqs": "eecs2030 eecs1030 eecs2001 eecs3101",
            "desc": "Amortized and worst-case analysis of data structures. Data structuring paradigms: self-adjustment and persistence. Lists: self-adjustment with the move-to-front heuristic. Search trees: splay trees, finger search trees. Heaps: skew heaps, Fibonacci heaps. Union-find trees. Link-and-cut trees. Multidimensional data structures and dynamization. Integrated with: GS/CSE 5101 3.00. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2001 3.00, LE/EECS 3101 3.00. Previously offered as: LE/CSE 4101 3.00. PRIOR TO SUMMER 2013: SC/CSE 4101 3.00."
        },
        {
            "dept": "eecs",
            "code": "4111",
            "credit": 3.0,
            "name": "Automata and Computability",
            "prereqs": "eecs2030 eecs1030 eecs2001 eecs3101",
            "desc": "Introduction to more advanced topics in theoretical foundations of computer science, including the study of formal languages and automata, formal models of computation, and computational complexity measures. Integrated with: GS/CSE 5111 3.00. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2001 3.00, LE/EECS 3101 3.00. Previously offered as: LE/CSE 4111 3.00."
        },
        {
            "dept": "eecs",
            "code": "4141",
            "credit": 3.0,
            "name": "Introduction to Quantum Computing",
            "prereqs": "math1025 eecs2021 eecs3101",
            "desc": "This course presents an overview of the quantum computing field without assuming any prior exposure to quantum mechanics. Drawing parallels between quantum and classical computing, the course covers the physical layer briefly before moving to quantum gates, the circuit model, and quantum algorithms. Quantum information is covered through applications. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;), SC/MATH 1025 3.00, LE/EECS 2021 4.00, LE/EECS 3101 3.00."
        },
        {
            "dept": "eecs",
            "code": "4161",
            "credit": 3.0,
            "name": "Mathematics of Cryptography",
            "prereqs": "eecs3101",
            "desc": "Probability, information theory and number theory and applications to cryptography. Classical codes such as Caesar shift, Vigenere, ADFGVX, rectangular substitution, and others. Other topics: comma free codes, perfect secrecy, index of coincidence, public key systems, primality testing and factorization algorithms. Prerequisites: At least 12 credits from 2000-level (or higher) MATH courses (without second digit &quot;5&quot;, or second digit &quot;7&quot;); or LE/EECS 3101 3.00 or permission of the Instructor."
        },
        {
            "dept": "eecs",
            "code": "4201",
            "credit": 3.0,
            "name": "Computer Architecture",
            "prereqs": "eecs3201 eecs3221",
            "desc": "The internal structure and design ideas embodied in many computers and the techniques for evaluating them. Fast arithmetic algorithms, memory system designs, pipeline techniques, input-output subsystems and parallel computing structures. Future trends in computer architecture. Prerequisites: Cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 3201 4.00, LE/EECS 3221 3.00. Previously offered as: LE/CSE 4201 3.00."
        },
        {
            "dept": "eecs",
            "code": "4214",
            "credit": 4.0,
            "name": "Digital Communications",
            "prereqs": "eecs3213 math2030 math2930 eecs3451 eecs3602 esse4020 math4830 phys4060 phys4250",
            "desc": "Introduces fundamental principles underlying design and analysis of digital communication systems. Develops mathematical/physical understanding from the information source through the transmitter, channel, receiver, and information sink. Topics include baseband transmission, matched filtering, modulation, channel coding, and spread spectrum. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;), LE/EECS 3213 3.00, One of SC/MATH 2030 3.00 or SC/MATH 2930 3.00, One of LE/EECS 3451 4.00, LE/EECS 3602 4.00, LE/ESSE 4020 3.00, SC/MATH 4830 3.00, SC/PHYS 4060 3.00 or SC/PHYS 4250 3.00. Previously offered as: LE/CSE 4214 4.00. PRIOR TO SUMMER 2013: course credit exclusion: SC/CSE 4214 4.00."
        },
        {
            "dept": "eecs",
            "code": "4215",
            "credit": 3.0,
            "name": "Mobile Communications",
            "prereqs": "eecs2030 eecs1030 eecs3213",
            "desc": "Provides an overview of the latest developments and trends in wireless mobile communications, and addresses the impact of wireless transmission and user mobility on the design and management of wireless mobile systems. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3213 3.00."
        },
        {
            "dept": "eecs",
            "code": "4312",
            "credit": 3.0,
            "name": "Software Engineering Requirements",
            "prereqs": "eecs2030 eecs1030 eecs3311",
            "desc": "This course deals with the elicitation, specification and analysis of software requirements and provides a critical description of available methods and tools, and practical exercises on applying these methods and tools to realistic problems. Three lecture hours per week.  One laboratory hour per week. One term. Three credits. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3311 3.00. Course credit exclusions: LE/CSE 4312 3.00, AK/AS/SC/CSE 4312 3.00."
        },
        {
            "dept": "eecs",
            "code": "4313",
            "credit": 3.0,
            "name": "Software Engineering Testing",
            "prereqs": "eecs2030 eecs1030 eecs3311",
            "desc": "An introduction to systematic methods of testing and verification, covering a range of static and dynamic techniques and their use within the development process; emphasizes the view that design should be carried out with verification in mind to achieve overall project goals. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS1030 3.00; LE/EECS 3311 3.00. Previously offered as: LE/CSE 4313 3.00."
        },
        {
            "dept": "eecs",
            "code": "4314",
            "credit": 3.0,
            "name": "Advanced Software Engineering",
            "prereqs": "eecs2030 eecs1030 eecs3311",
            "desc": "Advanced software engineering methods, processes and measurements (from requirements through to system evolution) for managing and delivering reliable software on time and within budget. Understanding the different types of systems and their associated technical, ethical and professional issues. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3311 3.00."
        },
        {
            "dept": "eecs",
            "code": "4315",
            "credit": 3.0,
            "name": "Mission-Critical Systems",
            "prereqs": "eecs2030 eecs1030 eecs3342",
            "desc": "Theory and practical tools underlying deductive and algorithmic methods for ensuring the safety and correctness of mission critical systems (e.g. medical systems, nuclear reactors and train systems) with the practical ability to use verification tools to perform software certification. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3342 3.00."
        },
        {
            "dept": "eecs",
            "code": "4401",
            "credit": 3.0,
            "name": "Artificial Intelligence",
            "prereqs": "eecs2030 eecs1030 eecs3401",
            "desc": "This is a second course in Artificial intelligence that covers selected topics in this area such as: reasoning about action and planning, uncertain and fuzzy reasoning, knowledge representation, automated reasoning, non-monotonic reasoning and answer set programming, ontologies and description logic, local search methods, Markov decision processes, autonomous agents and multi-agent systems, machine learning, reasoning about beliefs and goals, and expert systems. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3401 3.00."
        },
        {
            "dept": "eecs",
            "code": "4404",
            "credit": 3.0,
            "name": "Introduction to Machine Learning and Pattern Recognition",
            "prereqs": "eecs2030 eecs1030 math2030 math2930 math1131",
            "desc": "Machine learning is the study of algorithms that learn how to perform a task from prior experience. This course introduces the student to machine learning concepts and techniques applied to pattern recognition problems in a diversity of application areas. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; one of SC/MATH 2030 3.00 or SC/MATH 2930 3.00 or SC/MATH 1131 3.00."
        },
        {
            "dept": "eecs",
            "code": "4411",
            "credit": 3.0,
            "name": "Database Management Systems",
            "prereqs": "eecs2011 eecs2021 eecs2031 eecs2032 eecs3421",
            "desc": "A study of principles of database management systems. A thorough analysis of theory of normal, relational algebra and calculus and query languages based on these concepts. Other topics: security and integrity issues, concurrency control, distributed systems, query optimization. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2011 3.00; LE/EECS 2021 4.00; LE/EECS 2031 3.00 or LE/EECS 2032 4.00; LE/EECS 3421 3.00. Course Credit Exclusion: LE/CSE 4411 3.00."
        },
        {
            "dept": "eecs",
            "code": "4412",
            "credit": 3.0,
            "name": "Data Mining",
            "prereqs": "eecs2030 eecs1030 eecs3101 eecs3421 math2030 math2930 math1131",
            "desc": "Introduces and presents basic concepts of data mining, data mining techniques, models and applications. Topics include association rule mining, classification models, sequential pattern mining and clustering. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3101 3.00, LE/EECS 3421 3.00 and one of SC/MATH 2030 3.00 or SC/MATH 2930 3.00 or SC/MATH 1131 3.00. Previously offered as: LE/CSE 4412 3.00."
        },
        {
            "dept": "eecs",
            "code": "4413",
            "credit": 3.0,
            "name": "Building E-Commerce Systems",
            "prereqs": "eecs2030 eecs1030",
            "desc": "A study of the technical infrastructure that underlies Electronic Commerce on the Internet. The foundational concepts are presented through a series of projects that use an industrial-strength framework on the server side, standard-compliant technologies on the client side, and a variety of messaging protocols on the network side. Best practices, security concerns, and performance issues are emphasized throughout. Prerequisite: Cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00. Previously offered as: LE/CSE 4413 3.00."
        },
        {
            "dept": "eecs",
            "code": "4414",
            "credit": 3.0,
            "name": "Information Networks",
            "prereqs": "eecs3421 eecs3101 math2030 math2930",
            "desc": "Information networks are effective representations of pairwise relationships between objects. Examples include technological networks (e.g., World Wide Web), online social networks (e.g., Facebook), and biological networks (e.g., Protein-to-Protein interactions). The study of information networks is an emerging discipline of immense importance that combines graph theory, probability and statistics, data mining and analysis, and computational social science. This course provides students with both theoretical knowledge and practical experience of the field by covering models and algorithms of information networks and their basic properties. In addition, analysis of information networks provides the means to explore large, complex data coming from vastly diverse sources and to inform computational problems and better decisions. Topics include: basic graph theory, network measurements, network models, community detection, graph partitioning, link analysis, link prediction, information cascades &amp; epidemics, influence maximization, network ties, recommendation systems, mining graphs, and connections to problems in the social sciences and economics. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;), LE/EECS 3421 3.00, LE/EECS 3101 3.00, SC/MATH 2030 3.00 or SC/MATH 2930 3.00.\n\nDate of submission: 2017-03-07"
        },
        {
            "dept": "eecs",
            "code": "4415",
            "credit": 3.0,
            "name": "Big Data Systems",
            "prereqs": "eecs3421 eecs3101",
            "desc": "Storing, managing, and processing datasets are foundational to both computer science and data science. The enormous size of today's data sets and the specific requirements of modern applications necessitated the growth of a new generation of data management systems, where the emphasis is put on distributed and fault-tolerant processing. New programming paradigms have evolved, an abundance of information  platforms offering data management and analysis solutions appeared and a number of novel methods and tools have been developed. This course introduces the fundamentals of big data storage, retrieval, and processing systems. As these fundamentals are introduced, exemplary\ntechnologies are used to illustrate how big data systems can leverage very large data sets that become available through multiple sources and are characterized by diverse levels of volume (terabytes; billion records), velocity (batch; real-time; streaming) and variety (structured; semi-structured; unstructured). The course aims to provide students with both theoretical knowledge and practical experience of the field by covering recent research on big data systems and their basic properties. Students consider both small and large datasets because both are equally important and justify different trade-offs. Topics include: software frameworks for distributed storage and processing of very large data sets, MapReduce programming model, querying of structured data sets, column stores, key-value stores, document stores, graph databases, distributed stream processing frameworks. Prerequisites: Cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;), LE/EECS 3421 3.00, LE/EECS 3101 3.00"
        },
        {
            "dept": "eecs",
            "code": "4421",
            "credit": 3.0,
            "name": "Introduction to Robotics",
            "prereqs": "math1025 math1310 eecs2031",
            "desc": "An introduction to robotic manipulators and autonomous vehicles. The course covers the kinematics and dynamics of manipulators and autonomous platforms, robot sensors and navigation. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); SC/MATH 1025 3.00, SC/MATH 1310 3.00, LE/EECS 2031 3.00. Previously offered as: LE/CSE 4421 3.00."
        },
        {
            "dept": "eecs",
            "code": "4422",
            "credit": 3.0,
            "name": "Computer Vision",
            "prereqs": "math1025 math1310 eecs2031 eecs2032",
            "desc": "Fundamental concepts of Computer vision and including aspects of biological vision, image formation process, image processing, feature extraction and matching, 3-D parameter estimation, applications and statistical techniques.  Twelve supervised laboratory hours. Prerequisites: Cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); SC/MATH1025 3.00; SC/MATH1310 3.00; LE/EECS2031 3.00 or LE/EECS 2032 4.00."
        },
        {
            "dept": "eecs",
            "code": "4441",
            "credit": 3.0,
            "name": "Human-Computer Interaction",
            "prereqs": "eecs2030 eecs1030 eecs3461",
            "desc": "Introduces the concepts and technology necessary to design, manage and implement interactive software. Students work in small groups and learn how to design user interfaces, how to realize them and how to evaluate the end result. Both design and evaluation are emphasized. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3461 3.00. Previously offered as: LE/CSE 4441 3.00."
        },
        {
            "dept": "eecs",
            "code": "4443",
            "credit": 3.0,
            "name": "Mobile User Interfaces",
            "prereqs": "eecs2030 eecs1030 eecs3461",
            "desc": "The design and implementation of user interfaces for touchscreen devices and tablet computers. Students develop user interfaces that include touch, multi-touch, vibration, device motion, position, and orientation, environment sensing, video capture, and audio capture. Twelve Supervised laboratory hours that emphasize these topics in a practical manner. Prerequisites: General prerequisite; LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3461 3.00. (NOTE: The General Prerequisite is a cumulative GPA of 4.50 or better over all major EECS courses.  EECS courses with the second digit &quot;5&quot; are not major courses.)"
        },
        {
            "dept": "eecs",
            "code": "4452",
            "credit": 3.0,
            "name": "Digital Signal Processing: Theory and Applications",
            "prereqs": "eecs3451 eecs3602",
            "desc": "Fundamental digital signal processing. Inner product, Hilbert space, orthogonality principle, discrete-time Fourier transform, discrete Fourier transform, z-transform, multirate systems, sampling and interpolation. Prerequisite: LE/EECS 3451 4.00 or LE/EECS 3602 4.00"
        },
        {
            "dept": "eecs",
            "code": "4461",
            "credit": 3.0,
            "name": "Hypermedia and Multimedia Technology",
            "prereqs": "eecs2030 eecs1030 eecs3461",
            "desc": "Design and application of computer systems which provide information resources for learning, online-help, conceptual exploration, visualization and entertainment; e.g. hypertext/hypermedia, networked information-servers, systems for collaborative work, and &quot;virtual reality&quot;. One or two topics are discussed in depth using current research literature. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3461 3.00. Previously offered as: LE/CSE 4461 3.00."
        },
        {
            "dept": "eecs",
            "code": "4480",
            "credit": 3.0,
            "name": "Computer Security Project",
            "prereqs": "",
            "desc": "This is a capstone project course for computer security students. The students engage in a significant research and/or development project that has major computer security considerations. Prerequisites: Restricted to students in the Computer Security degree. Students must have passed 40 EECS or CSE credits. Permission of the Instructor is needed. Course credit exclusions: LE/EECS 4080 3.00; LE/EECS 4081 6.00; LE/EECS 4082 6.00; LE/EECS 4084 6.00; LE/EECS 4088 6.00; LE/EECS 4700 6.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 4080 3.00, LE/CSE 4081 6.00, LE/CSE 4084 6.00, LE/CSE 4088 6.00, LE/CSE 4700 6.00, LE/CSE 4082 6.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 4080 3.00, SC/CSE 4081 6.00, SC/CSE 4084 6.00, SC/CSE 4088 6.00, SC/CSE 4700 6.00, SC/CSE 4082 6.00."
        },
        {
            "dept": "eecs",
            "code": "4481",
            "credit": 4.0,
            "name": "Computer Security Laboratory",
            "prereqs": "eecs2030 eecs1030 eecs3214",
            "desc": "Provides a thorough understanding of the technical aspects of computer security. It covers network, operating systems, and application software security. Computer laboratory projects provide exposure to various tools in a hands-on setting. Prerequisites: Cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3214 3.00. Note: Students with background equivalent to the stated prerequisites are encouraged to seek permission to enrol."
        },
        {
            "dept": "eecs",
            "code": "4482",
            "credit": 3.0,
            "name": "Network Security and Forensics",
            "prereqs": "eecs3213 eecs3214 eecs3482",
            "desc": "This course provides a comprehensive coverage of theoretical and practical aspects of network security and forensics. The emphasis is on the limitations and attacks against network protocols and architectures most widely used in practice, as well as the best known detection, prevention and remediation techniques against these attacks. The course also has a strong emphasis on hands-on learning either by using already existing real-world tools or by developing new custom software. Familiarity with the TCP/IP protocol suite and basic computer networking concepts is required. Prerequisites: LE/EECS 3213 3.00 or LE/EECS 3214 3.00 and LE/EECS 3482 3.00."
        },
        {
            "dept": "eecs",
            "code": "4491",
            "credit": 3.0,
            "name": "Simulation and Animation for Computer Games",
            "prereqs": "eecs2030 eecs1030 eecs3431 math1310",
            "desc": "Introduction to simulation and animation techniques used in computer games, with a focus on the algorithms and methods that support moving objects in the virtual environments. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3431 3.00, SC/MATH 1310 3.00."
        },
        {
            "dept": "eecs",
            "code": "4613",
            "credit": 4.0,
            "name": "Power Electronics",
            "prereqs": "eecs2210",
            "desc": "The objective of this course is to understand the basic operating principles of power conversion using advanced electronic devices. The structure and characteristics of several switching devices are reviewed. Basic power electronic converters and inverters such as AC/DC rectifiers, DC/DC switch mode converters and voltage source DC/AC inverters are studied. Resonant DC/DC converters are introduced. Computation of circuit quantities such as average and RMS value, average power, power factor, total harmonics distortion and power efficiency are also studied. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;), LE/EECS 2210 3.00. Corequisite: LE/EECS 3603 4.00."
        },
        {
            "dept": "eecs",
            "code": "4622",
            "credit": 4.0,
            "name": "Introduction to Energy Systems",
            "prereqs": "eecs2200 eecs3603 phy2020",
            "desc": "Introduction to basic modeling and analysis techniques in electricity generation, transmission and distribution. Introduction to 3-phase systems, single line diagrams and Per Unit system of calculations. Functional descriptions and modeling of generators, transformers, transmission lines, motors and other loads are discussed. Load Flow study, Gauss-Seidel and Newton-Raphson iterative methods; Symmetrical fault analysis, symmetrical components, unsymmetrical fault analysis; introduction of protection relays and Circuit Breakers; power systems stability analysis; introduction to distribution systems and distributed generation. Prerequisites: Cumulative GPA of 4.50 or better over all major EECS courses (without second digit &quot;5&quot;); LE/EECS 2200 3.00, LE/EECS 3603 4.00, SC/PHY 2020 3.00."
        },
        {
            "dept": "eecs",
            "code": "4640",
            "credit": 3.0,
            "name": "Medical Imaging Techniques: Principles and Applications",
            "prereqs": "eecs2602 eecs3451",
            "desc": "This course introduces principles of medical imaging, focusing on major imaging modalities including ultrasound, X-ray radiography, computed tomography, magnetic resonance imaging, and nuclear medicine imaging. The course covers the physics and engineering aspects of how various imaging signals are acquired and processed in order to form medically useful images. The course applies the classical knowledge of engineering physics and signals and systems techniques to the development of various medical imaging technologies. Basic mathematical tools required to understand how the tomographic imaging modalities work are presented. Sources of image noise and other causes of artifacts are introduced,\nand the mechanisms that govern the achievable resolution of the different modalities are discussed. The course also covers essentials of medical image analysis. The students will learn the fundamentals, basic design and applications of medical imaging systems, imaging signal processing and  \nmedical image analysis. Background in signals and systems, and basic knowledge of physics are required before taking the course. Integrated with: GS/EECS 5640 3.00. Prerequisites: LE/EECS 2602 4.00 or LE/EECS 3451 4.00"
        },
        {
            "dept": "eecs",
            "code": "4700",
            "credit": 6.0,
            "name": "Digital Media Project",
            "prereqs": "",
            "desc": "This course involves the completion of a significant body of work in the area of Digital Media. The project will normally be a team project involving the development and analysis of a digital media work potentially having elements of interactivity, animation, 3-D graphics, and sound for example. The project will be presented at a public workshop towards the end of the year. Prerequisites: Only open to students in the final year of the Digital Media program. Course credit exclusions: LE/EECS 4080 3.00; LE/EECS 4081 6.00; LE/EECS 4082 6.00; LE/EECS 4084 6.00; LE/EECS 4088 6.00; LE/EECS 4480 3.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 4080 3.00, LE/CSE 4081 6.00, LE/CSE 4082 6.00, LE/CSE 4084 6.00, LE/CSE 4088 6.00, LE/CSE 4480 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 4080 3.00, SC/CSE 4081 6.00, SC/CSE 4082 6.00, SC/CSE 4084 6.00, SC/CSE 4088 6.00, SC/CSE 4480 3.00."
        },
        {
            "dept": "eecs",
            "code": "4910",
            "credit": 3.0,
            "name": "Industry Practicum",
            "prereqs": "",
            "desc": "This course is only available to students in the Industry Partnership Stream of the Computer Science Honours BSc (enrollment by permission). Students in the stream may enroll in the course during a term for which they are employed by the industrial partner. The learning outcomes of the course will be approved by the instructor prior to enrollment. Prerequisites: EECS credits in the 3000 level\n"
        },
        {
            "dept": "eecs",
            "code": "4911",
            "credit": 3.0,
            "name": "Industry Practicum",
            "prereqs": "",
            "desc": "This course is only available to students in the Industry Partnership Stream of the Computer Science Honours BSc (enrollment by permission). Students in the stream may enroll in the course during a term for which they are employed by the industrial partner. The learning outcomes of the course will be approved by the instructor prior to enrollment. Prerequisites: EECS credits in the 3000 level\n"
        },
        {
            "dept": "eecs",
            "code": "5111",
            "credit": 3.0,
            "name": "Automata Computability and Complexity",
            "prereqs": "",
            "desc": "N/A"
        },
        {
            "dept": "eecs",
            "code": "5323",
            "credit": 3.0,
            "name": "Computer Vision ",
            "prereqs": "",
            "desc": "Introduces the basic concepts in Computer Vision. Primarily a survey of current computational methods, we begin by examining methods for measuring visual data (image based operators, edge detection, feature extraction), and low-level processes for feature aggregation (optic flow, segmentation, correspondence). Finally, we consider some issues in &quot;high-level&quot; vision by examining current high-level vision systems."
        },
        {
            "dept": "eecs",
            "code": "5326",
            "credit": 3.0,
            "name": "Artificial Intelligence",
            "prereqs": "",
            "desc": "This course is an in-depth treatment of one or more specific topics within the field of Artificial Intelligence. Integrated with the undergraduate course LE/EECS 4401 3.00."
        },
        {
            "dept": "eecs",
            "code": "5327",
            "credit": 3.0,
            "name": "Introduction to Machine Learning and Pattern Recognition",
            "prereqs": "",
            "desc": "Machine learning is the study of algorithms that learn how to perform a task from prior experience. This course introduces the student to machine learning concepts and techniques applied to pattern recognition problem in a diversity of application areas."
        },
        {
            "dept": "eecs",
            "code": "5351",
            "credit": 3.0,
            "name": "Human-Computer Interaction",
            "prereqs": "",
            "desc": "Introduces the concepts and technology necessary to design, manage and implement interactive software. Students work in small groups and learn how to design user interfaces, how to realize them and how to evaluate the end result. Both design and evaluation are emphasized."
        },
        {
            "dept": "eecs",
            "code": "5391",
            "credit": 3.0,
            "name": "Simulation and Animation for Computer Games",
            "prereqs": "",
            "desc": "This course covers the basic principles and practices related to motion synthesis and motion control for animated objects, such as those that appear in films and computer games. It is integrated with LE/EECS 4491."
        },
        {
            "dept": "eecs",
            "code": "5414",
            "credit": 3.0,
            "name": "Information Networks",
            "prereqs": "",
            "desc": "Information networks are effective representations of pairwise relationships between objects. Examples include technological networks (e.g., the Web), social networks (e.g., Facebook), biological networks (e.g., protein-to-protein interactions), and more. Analysis of information networks is an emerging discipline of immense importance. This course provides students with theoretical knowledge and practical experience of the field by covering models and algorithms of information networks."
        },
        {
            "dept": "eecs",
            "code": "5431",
            "credit": 3.0,
            "name": "Mobile Communications",
            "prereqs": "",
            "desc": "Provides an overview of the latest technology, developments and trends in wireless mobile communications, and addresses the impact of wireless transmission and user mobility on the design and management of wireless mobile systems."
        },
        {
            "dept": "eecs",
            "code": "5443",
            "credit": 3.0,
            "name": "Mobile User Interfaces",
            "prereqs": "",
            "desc": "This course teaches the design and implementation of user interfaces for touchscreen phones and tablet computers.  Students develop user interfaces that include touch, multi-touch, vibration, device motion, position, and orientation, environment sensing, and video and audio capture.  Lab exercises emphasise these topics in a practical manner."
        },
        {
            "dept": "eecs",
            "code": "5501",
            "credit": 3.0,
            "name": "Computer Architecture",
            "prereqs": "",
            "desc": "This course presents the core concepts of computer architecture and design ideas embodied in many machines and emphasizes a quantitative approach to cost/performance tradeoffs. This course concentratres on uniprocessor systems. A few machines are studies to illustrate how these concepts are implemented; how various tradeoffs that exit among design choices are treated; and how good designs make efficient use of technology. Future trends in computer architecture are also discussed.\r\nIntegrated with the undergraduate course Computer Science 4201.03. "
        },
        {
            "dept": "eecs",
            "code": "5611",
            "credit": 3.0,
            "name": "Analog Integrated Circuits Design ",
            "prereqs": "",
            "desc": "This course presents analog circuit principles for the analysis and design of high-performance circuits in modern technologies. Its techniques enable the realization of wide-band amplifiers, low-noise amplifiers, operational amplifiers, and feedback amplifiers. Advanced computer simulation, and physical layout are presented. Integrated with the undergraduate course Lassonde Electrical Engineering &amp; Computer Science 4611 3.0."
        },
        {
            "dept": "eecs",
            "code": "5640",
            "credit": 3.0,
            "name": "Medical Imaging Techniques: Principles and Applications",
            "prereqs": "",
            "desc": "This course introduces principles of medical imaging, focusing on major imaging modalities including ultrasound, X-ray radiography, computed tomography, magnetic resonance imaging, and nuclear medicine imaging. The course covers the physics and engineering aspects of how various imaging signals are acquired and processed in order to form medically useful images. The course also covers essentials of medical image analysis."
        },
        {
            "dept": "eecs",
            "code": "6002",
            "credit": 3.0,
            "name": "Directed Reading",
            "prereqs": "",
            "desc": "A reading course suited to students with special interests. Students select areas of study in consultation with their supervisor. These areas should not significantly overlap with material covered in courses currently offered at York University and undergraduate or graduate courses taken by the student either at York University or elsewhere.\r\n\r\nDirected reading courses require a completed Directed Reading Form, which can be obtained from the Assistant of the Graduate Program in Electrical Engineering &amp; Computer Science. Normally, students may take only directed reading course (EECS 6002) during a degree program."
        },
        {
            "dept": "eecs",
            "code": "6127",
            "credit": 3.0,
            "name": "Machine Learning Theory",
            "prereqs": "",
            "desc": "This course takes a foundational perspective on machine learning and covers some of its underlying mathematical principles. Topics range from well-established results in learning theory to current research challenges. We start with introducing a formal framework, and then introduce and analyze learning methods, such as Nearest Neighbors, Boosting, Support Vector Machines (SVMs) and Neural Networks. Finally, students present and discuss recent research papers."
        },
        {
            "dept": "eecs",
            "code": "6154",
            "credit": 3.0,
            "name": "Digital Image Processing:  Theory and Algorithms",
            "prereqs": "",
            "desc": "Fundamental image processing theories and algorithms. Signal representation using transforms, wavelets and frames is overviewed. Signal reconstruction methods using total variation, sparse coding and low-rank prior, based on convex optimization, are discussed. Applications include image compression, restoration and enhancement.\r\nPrior background in digital signal processing (Electrical Engineering &amp; Computer Science 4452 3.0 or equivalent) and numerical linear algebra is strongly recommended."
        },
        {
            "dept": "eecs",
            "code": "6222",
            "credit": 3.0,
            "name": "Coding and Information Theory",
            "prereqs": "",
            "desc": "This course introduces students to the fundamentals of information theory, as well as methods for achieving information-theoretic results using source codes and channel codes. Students will learn Shannon's source coding and channel coding theorems, as well as the mathematical machinery required to prove these and other information theoretic results. Students will also be exposed to source coding techniques, as well as channel coding techniques for state-of-the-art systems. Advanced topics such as multiterminal (Slepian-Wolf) source coding and rateless codes will also be covered, time permitting. "
        },
        {
            "dept": "eecs",
            "code": "6322",
            "credit": 3.0,
            "name": "Neural Networks and Deep Learning",
            "prereqs": "",
            "desc": "This course covers the theory and practice of deep learning and neural networks. Topics covered include training methods and loss functions, automatic differentiation and backpropagation, network architectures for different learning problems, validation, model selection and software tools. \r\nPrerequisites: EECS 5327 or EECS 6327 or permission of instructor"
        },
        {
            "dept": "eecs",
            "code": "6323",
            "credit": 3.0,
            "name": "Advanced Topics in Computer Vision",
            "prereqs": "",
            "desc": "N/A"
        },
        {
            "dept": "eecs",
            "code": "6327",
            "credit": 3.0,
            "name": "Probabilistic Models &amp; Machine Learning",
            "prereqs": "",
            "desc": "Intelligent systems must make effective judgements in the face of uncertainty.  This requires probabilistic models to represent complex relationships between random variables (learning) as well as algorithms that produce good estimates and decisions based on these models (inference).  This course explores both probabilistic learning and inference, in a range of application areas."
        },
        {
            "dept": "eecs",
            "code": "6330",
            "credit": 3.0,
            "name": "Critical Technical Practise:  Computer Accessibility and Assistive Technology",
            "prereqs": "",
            "desc": "This course examines issues of technological design in computer accessibility and computational forms of assistive technology (hardware and/or software).  Students learn to critically reflect on the hidden assumptions, ideologies and values underlying the design of these technologies, and to analyse and to design them."
        },
        {
            "dept": "eecs",
            "code": "6342",
            "credit": 3.0,
            "name": "Computational Models of Visual Perception",
            "prereqs": "",
            "desc": "This course examines the problem of developing rigorous computational models for visual processing.  Computational strategies may draw upon techniques in statistical inference, signal processing, optimization theory, graph theory and distributed computation."
        },
        {
            "dept": "eecs",
            "code": "6350",
            "credit": 3.0,
            "name": "Privacy in Sociotechnical Systems: Theory and Applications",
            "prereqs": "",
            "desc": "This course covers theory and application of digital privacy in sociotechnical systems. The first half of the course focuses on a privacy analysis of technologies that both enhance and threaten privacy through the lenses of law, policy, and theory. The second half covers topics on user privacy like profiling, online tracking, and anonymization. The evaluation is project-based."
        },
        {
            "dept": "eecs",
            "code": "6412",
            "credit": 3.0,
            "name": "Data Mining",
            "prereqs": "",
            "desc": "Introduces fundamental concepts of data mining. It presents various data mining technologies, algorithms and applications. Topics include association rule mining, classification models, sequential pattern mining and clustering."
        },
        {
            "dept": "eecs",
            "code": "6414",
            "credit": 3.0,
            "name": "Data Analytics and Visualization",
            "prereqs": "",
            "desc": "Data analytics and visualization is an emerging discipline of immense importance to any data-driven organization. This is a project-focused course that provides students with knowledge on tools for data mining and visualization and practical experience working with data mining and machine learning algorithms for analysis of very large amounts of data. It also focuses on methods and models for efficient communication of data results through data visualization."
        },
        {
            "dept": "eecs",
            "code": "6444",
            "credit": 3.0,
            "name": "Mining Software Engineering Data to Support the Development, Testing and Maintenance of Large Scale Software Systems",
            "prereqs": "",
            "desc": "Software engineering data (such as source code repositories, execution logs, performance counters, developer mailing lists and bug databases) contains a wealth of information about a project's status and history. Applying data mining techniques on such data, researchers can gain empirically based understanding of software development practices, and practitioners can better manage, maintain and evolve complex software projects."
        },
        {
            "dept": "eecs",
            "code": "6448",
            "credit": 3.0,
            "name": "Data Science for Requirements: From Mining Software Requirements to Planning Products ",
            "prereqs": "",
            "desc": "The course focuses on data mining techniques and analytical models for eliciting, prioritizing, and planning software requirements and releases, along with the importance of non-functional requirements, requirements change and reuse. The course provides examples by referring to the state of the art and state of the practice for mobile software applications. Prior background in software design and requirements is recommended."
        },
        {
            "dept": "eecs",
            "code": "6606",
            "credit": 3.0,
            "name": "Low Power ASIC Design",
            "prereqs": "",
            "desc": "This course introduces several important concepts and techniques in low power ASIC design. It covers VSLI design methodology, ASIC design flow, low power digital circuit design principles, timing closure in ASIC, power analysis, and power optimization. Student will have the opportunities to perform circuit design tasks using the state-of-the-art EDA tools. The concepts are enhanced through readings and projects."
        },
        {
            "dept": "eecs",
            "code": "6701",
            "credit": 3.0,
            "name": "High Frequency Power Electronic Converters",
            "prereqs": "",
            "desc": "This course discusses the fundamentals of loss-less switching techniques in high frequency power converters: zero-voltage switching and zero-current switching.  The course then focuses on various resonant converter topologies and soft-switching converters with auxiliary storage elements.  The course then discusses various control techniques used in high frequency power converters.  Special emphasis is placed on the design techniques using practical examples."
        },
        {
            "dept": "eecs",
            "code": "6705",
            "credit": 3.0,
            "name": "Power System Transients",
            "prereqs": "",
            "desc": "Electromagnetic-transient modelling of power system is of the most crucial requirements for many power system studies and engineering practices. This course covers fundamentals of the transient phenomena such as lightning, faults, switching, and discusses the principles of protecting power system equipment from the transient overvoltages. Electromagnetic transient models of power equipment are presented and advanced modelling features are discussed."
        },
        {
            "dept": "eecs",
            "code": "6808",
            "credit": 3.0,
            "name": "Engineering Optimization",
            "prereqs": "",
            "desc": "This course introduces classical and modern optimization techniques to solve engineering analysis and design problems. Students will learn how to formulate single- and multi-variable engineering problems as optimization problems and how to solve such problems using appropriate optimization techniques. The details of specific techniques required to solve the formulated problems will be discussed from theory and application points of view."
        }
    ]
}