{
    "courses": [
        {
            "dept": "fnmi",
            "code": "3000",
            "credit": 3.0,
            "name": "Teaching First Nations, Métis & Inuit Studies in the Intermediate Division",
            "prereqs": "",
            "desc": "This methods course is designed to prepare teachers in the Intermediate level to teach First Nations, Métis and Inuit Studies as their teaching subject. Students will be prepared provide their students with a broad range of knowledge that will help them to better understand issues relating to First Nations, Métis and Indigenous (FNMI) people at the regional, national and local levels. They will be prepared to design course content that can be used in specific First Nations, Métis and Inuit Studies courses or in a cross-curricular format. They will consider the participation and learning needs of students in their programs whose first language is not English, of students who need special learning accommodations, and of those who may-or may not-be of FNMI backgrounds, as well as those who may be from indigenous cultures outside Canada. The course will help them prepare to deliver the First Nations, Métis and Inuit Studies curriculum in all aspects, from meeting curriculum expectations, designing an engaging course, providing meaningful feedback and assessment/evaluation. \nThis course is only available to students in the Bachelor of Education (BEd) degree program."
        },
        {
            "dept": "fnmi",
            "code": "4000",
            "credit": 3.0,
            "name": "Teaching First Nations, Métis & Inuit Studies in the Intermediate Senior Division - Part A",
            "prereqs": "",
            "desc": "This course begins to prepare students to be qualified teachers of Native Studies in Ontario classrooms. It allows students to examine the theories, philosophies, knowledge, policies and practices specific to teaching Native Studies in the intermediate and senior grades. \nThis course is only available to students in the Bachelor of Education (BEd) degree program."
        },
        {
            "dept": "fnmi",
            "code": "4001",
            "credit": 3.0,
            "name": "Teaching First Nations, Métis & Inuit Studies in the Intermediate/Senior Division - Part B",
            "prereqs": "",
            "desc": "This course continues to prepare students to be qualified teachers of Native Studies in Ontario classrooms. It develops students' expertise in the theories, philosophies, knowledge, policies and practices specific to teaching Native Studies areas in order to further develop students' expertise for teaching this subject. ED/NVST 4000 (Part A) is a prerequisite for this course.\nThis course is only available to students in the Bachelor of Education (BEd) degree program."
        }
    ]
}