{
    "courses": [
        {
            "dept": "fran",
            "code": "1325",
            "credit": 3.0,
            "name": "Français de préspécialisation I (courant post-immersif)",
            "prereqs": "",
            "desc": "Ce cours s'adresse spécifiquement aux étudiants venant d'un programme d'immersion. Il vise à améliorer les compétences orales et écrites par la découverte de stratégies d'apprentissage et d'autorégulation, par une réflexion sur la langue et par l'utilisation de divers outils d'apprentissage électroniques. Remarque : Ce cours ne peut pas être crédité pour la spécialisation en études françaises. Cours incompatibles : GL/FRLS 1510 6.00 (Avant l'automne 2013), GL/FRAN 1825 3.00, GL/FRLS 1040 3.00, GL/FRLS 1140 3.00."
        },
        {
            "dept": "fran",
            "code": "1330",
            "credit": 3.0,
            "name": "Français de préspécialisation II (courant post-immersif)",
            "prereqs": "",
            "desc": "Ce cours s'adresse spécifiquement aux étudiants venant d'un programme d'immersion. Il vise à approfondir les compétences orales et écrites en français par la pratique de stratégies d'apprentissage et d'autorégulation, par une réflexion sur la langue et par l'utilisation de divers outils d'apprentissage électroniques. Remarque : Ce cours ne peut pas être crédité pour la spécialisation en études françaises.Condition préalable : GL/FRAN 1325 3.00 ou GL/FRLS 1140 3.00 avec un minimum de C ou test de placement. Cours incompatibles : GL/FRLS 1510 6.00 (Avant l'automne 2013), GL/FRAN 1830 3.00, GL/FRLS 1041 3.00, GL/FRLS 1141 3.00. "
        },
        {
            "dept": "fran",
            "code": "1820",
            "credit": 3.0,
            "name": "Français écrit et oral : révision des fondements",
            "prereqs": "",
            "desc": "Ce cours s'adresse essentiellement aux étudiants ayant suivi un cours de français langue seconde préuniversitaire 4U et ayant besoin d'une mise à niveau pour envisager la préspécialisation. Il revoit les fondements grammaticaux, lexicaux et communicatifs du français et introduit à divers outils d'apprentissage électroniques. Cours incompatibles : GL/FRLS 1035 3.00, GL/FRLS 1500 6.00 (Avant l'automne 2013), GL/FRLS 1512 3.00, GL/FRLS 1515 3.00, AP/FR 1030 6.00."
        },
        {
            "dept": "fran",
            "code": "1825",
            "credit": 3.0,
            "name": "Français de préspécialisation I",
            "prereqs": "",
            "desc": "Ce cours de français langue seconde a pour objectif d'amener les étudiants à consolider leurs bases en français oral et écrit tout en explorant le monde francophone. L'utilisation de divers outils d'apprentissage électroniques fait partie intégrante du cours. Remarque : Ce cours ne peut pas être crédité pour la spécialisation en études françaises. Condition préalable : GL/FRLS 1035 3.00 ou GL/FRAN 1820 3.00 avec un minimum de C ou GL/FRLS 1515 3.00 avec un minimum de C ou test de placement. Cours incompatibles : GL/FRLS 1510 6.00, GL/FRLS 1040 3.00 (Avant l'automne 2013), GL/FRAN 1325 3.00, GL/FRLS 1140 3.00. "
        },
        {
            "dept": "fran",
            "code": "1830",
            "credit": 3.0,
            "name": "Français de préspécialisation II",
            "prereqs": "",
            "desc": "Ce cours de français langue seconde a pour objectif d'élargir les compétences écrites et orales en français des étudiants ainsi que leur connaissance du monde francophone. L'utilisation de divers outils d'apprentissage électroniques fait partie intégrante du cours.Remarque : Ce cours ne peut pas être crédité pour la spécialisation en études françaises. Condition préalable : GL/FRLS 1040 3.00 ou GL/FRAN 1825 3.00 avec un minimum de C ou test de placement. Cours incompatibles : GL/FRLS 1041 3.00, GL/FRLS 1510 6.00, GL/FRAN 1330 3.00, GL/FRLS 1141 3.00."
        },
        {
            "dept": "fran",
            "code": "1835",
            "credit": 3.0,
            "name": "Français de préspécialisation III",
            "prereqs": "",
            "desc": "Ce cours de français langue seconde vise à consolider les compétences écrites en français par le réemploi et l'ancrage de structures grammaticales, l'enrichissement lexical, le travail de la cohérence textuelle et l'utilisation des outils électroniques d'aide à la rédaction mis à leur disposition. Remarque : Ce cours ne peut pas être crédité pour la spécialisation en études françaises. Conditions préalables : GL/FRLS 1041 3.00 ou GL/FRAN 1830  3.00 avec un minimum de C, GL/FRLS 1141 3.00 ou GL/FRAN 1330 3.00 avec un minimum de C, ou équivalent. Cours incompatibles : GL/FRLS 1240 3.00, GL/FRLS 1530 3.00."
        },
        {
            "dept": "fran",
            "code": "1870",
            "credit": 3.0,
            "name": "Pratiques phonétique, auditive et orale ",
            "prereqs": "",
            "desc": "Ce cours propose un entraînement intensif au français oral. Il vise à développer la compétence orale des étudiants en leur faisant faire des exercices de discrimination auditive, des exercices d'écoute et de transcription phonétique. Il cherche aussi à améliorer la qualité de la prononciation et du débit ainsi que la correction grammaticale et la précision lexicale des productions orales. Remarque : Ce cours devrait idéalement se suivre en même temps que le GL/FRAN 1835 3.00.  Il n'est pas ouvert aux étudiants qui suivent ou ont suivi des cours de langue du courant francophone (GL/FRAN 1740 3.00 , GL/FRAN 1745 3.00, GL/FRAN 2210 3.00, GL/FRAN 2710 3.00,  GL/FRAN 2212 3.00, GL/FRAN 2712 3.00, GL/FRAN 3240 3.00, GL/FRAN 3710 3.00, GL/FRAN 3712 3.00 et GL/FRAN 3241 3.00). Cours incompatible : GL/FRLS 1700 3.00."
        },
        {
            "dept": "fran",
            "code": "2335",
            "credit": 6.0,
            "name": "Initiation à la méthodologie littéraire",
            "prereqs": "",
            "desc": "Ce cours de méthodologie a pour objectif de familiariser les étudiants avec les techniques et la terminologie de la critique littéraire appliquée aux trois genres: roman, théâtre et poésie. Les étudiants seront initiés aux différentes démarches de la dissertation littéraire (recherche, bibliographie, références et plan) et à l'analyse littéraire proprement dite. Des approches diverses seront appliquées - l'analyse d'éléments littéraires tels que le personnage, l'organisation spatiale et temporelle, l'énonciation, l'intertexte, le style. Condition préalable : Justifier d'un minimum de C en GL/FRLS 1240 3.00 (ou GL/FRLS 1530 3.00) ou en GL/FRAN 1745 3.00 ou permission du département. Cours incompatible : AP/FR 2200 6.00. Remarque : Tout étudiant se spécialisant en études françaises devra justifier d'un minimum de C dans le GL/FRAN 2335 6.00 avant de pouvoir s'inscrire dans n'importe quel autre cours de littérature pour lequel GL/FRAN 2335 6.00 est un préalable. "
        },
        {
            "dept": "fran",
            "code": "2600",
            "credit": 6.0,
            "name": "Introduction à la linguistique générale et française",
            "prereqs": "",
            "desc": "On étudiera l'appareil conceptuel de la linguistique structurale, en montrant quel regard elle autorise sur les langues en général et sur le français en particulier. L'examen systématique des niveaux d'analyse (phonologie, morphologie, syntaxe et sémantique) permettra d'aborder les principales théories contemporaines : fonctionnalisme, générativisme, linguistique énonciative. Conditions préalables : Justifier d'un minimum de C en GL/FRLS 1240 3.00 ou GL/FRAN 1835 3.00 (ou GL/FRLS 1530 3.00) ou GL/FRAN 1745 3.00 ou permission du département. Cours incompatibles : AP/FR 2100 6.00. Remarque : Tout étudiant se spécialisant en études françaises devra justifier d'un minimum de C dans le GL/FRAN 2600 6.00 avant de pouvoir s'inscrire dans n'importe quel autre cours de linguistique pour lequel GL/FRAN 2600 6.00 est un préalable. "
        },
        {
            "dept": "fran",
            "code": "2621",
            "credit": 6.0,
            "name": "Faire du théâtre en français",
            "prereqs": "",
            "desc": "Ce cours introduit des notions générales sur les théâtres francophones, mettant l'accent sur le vocabulaire spécialisé de ce champ d'études. Les personnes dans le cours auront l'occasion de se familiariser concrètement avec toutes les disciplines d'une production théâtrale lors d'un spectacle public. "
        },
        {
            "dept": "fran",
            "code": "2710",
            "credit": 3.0,
            "name": "Pratiques de rédaction : résumé et synthèse",
            "prereqs": "",
            "desc": "Ce cours a pour objet le traitement synthétique de l'information. Il s'appuie sur une méthodologie ayant pour objectifs la sélection pertinente de l'information et l'utilisation optimale des outils linguistiques. Les étudiants auront à produire des synthèses et des résumés à partir de sources variées. Condition préalable :  GL/FRAN 1745 3.00 avec un minimum de C, ou test de classement. Cours incompatible : GL/FRAN 2210 3.00."
        },
        {
            "dept": "fran",
            "code": "2712",
            "credit": 3.0,
            "name": "Pratiques de rédaction : l'argumentation",
            "prereqs": "",
            "desc": "Ce cours a pour objet l'analyse et la rédaction de textes argumentatifs et s'appuie sur l'observation et la mise en oeuvre de la description, de l'explication et de l'argumentation dans la phrase, le paragraphe et le texte. Il inclut l'étude systématique des outils linguistiques nécessaires à la compréhension et à la production de textes argumentatifs. Condition préalable : avoir obtenu une note minimum de C en GL/FRAN 2710 3.00 ou GL/FRAN 2210 3.00. Cours incompatible : GL/FRAN 2212 3.00. "
        },
        {
            "dept": "fran",
            "code": "2810",
            "credit": 6.0,
            "name": "Français écrit pour spécialistes",
            "prereqs": "",
            "desc": "Ce cours de français langue seconde de spécialisation propose un entraînement intensif au français écrit, en s'appuyant sur l'utilisation régulière d'outils électroniques d'aide à la rédaction et sur diverses pratiques d'écriture collaborative, notamment électronique.Condition préalable : GL/FRLS 1530 3.00 avec un minimum de C, ou GL/FRAN 1835 3.00 ou GL/FRLS 1240 3.00 avec un minimum de C, ou permission du département.  Cours incompatible : GL/ FRLS 2240 6.00."
        },
        {
            "dept": "fran",
            "code": "2870",
            "credit": 3.0,
            "name": "Traits caractéristiques du français parlé  ",
            "prereqs": "",
            "desc": "Ce cours a pour double objectif l'amélioration du français parlé par les étudiants en situation de communication (débit, fluidité, précision...), ainsi que l'acquisition d'une connaissance plus poussée du français parlé dans la diversité de ses formes. Condition préalable : GL/FRAN 1835 3.00 ou GL/FRLS 1240 3.00 ou GL/FRLS 1530 3.00 ou permission du Département. Cours incompatibles : GL/FRLS 2700 3.00, AP/FR 2082 3.00. Remarque : ce cours n'est pas ouvert aux étudiants qui suivent ou ont suivi des cours de langue du courant francophone (GL/FRAN 1740 3.00, GL/FRAN 1745 3.00, GL/FRAN 2210 3.00, GL/FRAN 2710 3.00, GL/FRAN 2212 3.00, GL/FRAN 2712 3.00, GL/FRAN 3240 3.00, GL/FRAN 3710 3.00, GL/FRAN 3241 3.00, GL/FRAN 3712 3.00)."
        },
        {
            "dept": "fran",
            "code": "3214",
            "credit": 3.0,
            "name": "Rédaction professionnelle et technologie du texte",
            "prereqs": "",
            "desc": "Ce cours vise à former les étudiants à la rédaction et à la mise en page de différents genres de textes professionnels en exploitant \r\npleinement les outils informatiques servant à la production de documents, le tout dans l'optique d'une efficacité communicationnelle \r\naccrue.\r\nCondition préalable : GL/FRAN 2810 6.00 ou GL/FRAN 2712 3.00 (ou GL/FRLS 2240 6.00 ou GL/FRAN 2212 3.00) avec un minimum de C, ou équivalent."
        },
        {
            "dept": "fran",
            "code": "3252",
            "credit": 3.0,
            "name": "La littérature jeunesse contemporaine",
            "prereqs": "",
            "desc": "Ce cours a pour objet l'étude de la littérature pour enfants au Canada français et en France : son statut, ses formes, ses thèmes de prédilection, ses inspirations, ses illustrations et son exploitation pédagogique. Condition préalable : GL/FRAN 2335 6.00 ou permission du département. Remarque : une note minimale de C en GL/FRAN 2335 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises. "
        },
        {
            "dept": "fran",
            "code": "3305",
            "credit": 3.0,
            "name": "Initiation à l'étude du mythe littéraire",
            "prereqs": "",
            "desc": "Ce cours offre une introduction aux principaux outils théoriques servant au repérage des mythes dans la littérature contemporaine. Les théories mythocritique et mythanalytique, principalement, mais aussi les travaux de Joseph Campbell, de René Girard et de John J. White seront étudiés. De nombreux extraits d'oeuvres, tirés notamment des corpus littéraires français et québécois, permettront de mettre en pratique la matière examinée dans le cadre du cours d'Initiation aux grandes mythologies."
        },
        {
            "dept": "fran",
            "code": "3306",
            "credit": 3.0,
            "name": "Introduction aux grandes mythologies",
            "prereqs": "",
            "desc": "Ce cours propose une introduction aux grands mythes fondateurs d'Occident et d'Orient et une exploration des thèmes afférents aux ensembles mythologiques : cosmogonie, architecture cosmique, eschatologie, divinités et héros, ordre social. Mère universelle, mythes modernes, etc. La lecture d'extraits de textes anciens de la littérature permettra de se familiariser avec ces thèmes et de se doter d'outils de repérage des mythes dans la littérature contemporaine."
        },
        {
            "dept": "fran",
            "code": "3310",
            "credit": 3.0,
            "name": "Roman du XIXe siècle",
            "prereqs": "",
            "desc": "Bref historique de l'activité littéraire et artistique depuis la Révolution française. Évolution du genre romanesque, du romantisme au réalisme et au naturalisme. Étude détaillée de quelques \u009cuvres marquantes. Condition préalable : GL/FRAN 2335 6.00 ou permission du département.  Remarque : une note minimale de C en GL/FRAN 2335 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises. Cours incompatibles : AP/FR 4341 3.00, AP/FR 4343 3.00. "
        },
        {
            "dept": "fran",
            "code": "3321",
            "credit": 3.0,
            "name": "Roman de la première moitié du XXe siècle en France ",
            "prereqs": "",
            "desc": "Étude de quatre ou cinq oeuvres représentatives du genre romanesque en France dans la première moitié du XXe siècle. Condition préalable : GL/FRAN 2335 6.00 ou permission du département. Remarque : une note minimale de C en GL/FRAN 2335 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises. Cours incompatible : GL/FRAN 3320 6.00"
        },
        {
            "dept": "fran",
            "code": "3515",
            "credit": 3.0,
            "name": "Cinéma français",
            "prereqs": "",
            "desc": "Le cours propose l\u0092étude du développement du cinéma français, des recherches et spécificités de chaque période de son constant renouvellement, des apports des principaux réalisateurs, ainsi que des rapports qui placent le cinéma dans son contexte social, économique et politique. \r\nCondition préalable : GL/FRAN 2810 6.00 avec un minimum de C ou GL/FRAN 2710 3.00 avec un minimum de C ou permission du Département d\u0092études françaises.\r\nCours incompatible : GL/HUMA/FRAN 3915 3.00."
        },
        {
            "dept": "fran",
            "code": "3556",
            "credit": 3.0,
            "name": "Introduction aux théories psycholinguistiques appliquées à l'apprentissage des L2",
            "prereqs": "",
            "desc": "Ce cours compare l'acquisition de L1 et de L2 et étudie les facteurs psychologiques et cognitifs individuels (personnalité, attitude, motivation, anxiété, intelligence, mémoire...) qui influencent l'apprentissage des L2. Il examine les théories de la période critique et celles des styles/stratégies d'apprentissage. Condition préalable : GL/FRAN LIN 2600 6.00. Remarque : une note minimale de C en GL/FRAN 2600 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises. Avant l'automne 2016: cours incompatibles : GL/FRAN 3656 3.00, GL/LIN 3656 3.00. Cours incompatibles : GL/FRAN 4656 3.00, GL/LIN 4656 3.00."
        },
        {
            "dept": "fran",
            "code": "3600",
            "credit": 3.0,
            "name": "La dramaturgie du XVIIe siècle",
            "prereqs": "",
            "desc": "Ce cours porte sur le théâtre du « Grand Siècle ». Seront étudiées certaines oeuvres de Corneille, Molière et Racine aussi bien que quelques pièces baroques et les théories de Boileau sur le théâtre. Condition préalable : GL/FRAN 2870 3.00 ou GL/FRLS 2700 3.00 ou permission du département d'études françaises.\nCours incompatible: GL/FRAN 3250 3.00."
        },
        {
            "dept": "fran",
            "code": "3608",
            "credit": 3.0,
            "name": "Roman féminin des XVIIe, XVIIIe et XIXe siècles",
            "prereqs": "",
            "desc": "Analyse de 4 ou 5 romans féminins des XVIIe, XVIIIe et XIXe siècles choisis pour la contribution de leurs auteures à l'évolution du genre romanesque et leur participation à la vie intellectuelle."
        },
        {
            "dept": "fran",
            "code": "3614",
            "credit": 3.0,
            "name": "Grammaire raisonnée du français : approche énonciative",
            "prereqs": "",
            "desc": "Dans ce cours, nous montrons comment des outils issus des théories énonciatives de Benveniste, Ducrot et Culioli peuvent fournir aux linguistes et éventuellement aux futurs enseignants de langue de solides bases permettant d'expliquer les règles sous-jacentes aux marqueurs grammaticaux. Condition préalable : GL/FRAN 2600 6.00 ou GL/LIN 2600 6.00.  Remarque : une note minimale de C en GL/FRAN 2600 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises."
        },
        {
            "dept": "fran",
            "code": "3621",
            "credit": 3.0,
            "name": "Phonétique/Phonologie du français moderne",
            "prereqs": "",
            "desc": "Phonétique articulatoire; classification des consonnes et des voyelles. Établissement de la distinction entrephonétique et phonologie, notion de phonème, traits distinctifs. Phonétique combinatoire (syllabe, assimilation, liaison) et suprasegmentale (accent, intonation). Description phonologique des français contemporains; étude détaillée du français canadien. Condition préalable : Cours d'introduction à la linguistique ou GL/FRAN 2600 6.00 ou GL/LIN 2600 6.00 ou GL/EN 2605 6.00 ou GL/LIN 2605 6.00. Remarque : une note minimale de C en GL/FRAN 2600 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises. Cours incompatibles : AP/FR 3140 6.00, GL/LIN 3603 3.00."
        },
        {
            "dept": "fran",
            "code": "3622",
            "credit": 3.0,
            "name": "Sémantique",
            "prereqs": "",
            "desc": "Ce cours analyse la problématique du sens et de la référence, la sémantique lexicale (polysémie, synonymie, notion de marque), la sémantique grammaticale : (deixis du temps et de la personne, aspects, modalités, détermination). Ce cours traite du passage de la sémantique à la pragmatique : (typologie de l'implicité et actes de discours). Condition préalable : Cours d'introduction à la linguistique ou GL/FRAN 2600 6.00 ou GL/LIN 2600 6.00 ou GL/EN 1603 6.00 ou GL/LIN 1603 6.00. Remarque : une note minimale de C en GL/FRAN 2600 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises. Cours incompatibles : GL/LIN 3611 3.00."
        },
        {
            "dept": "fran",
            "code": "3710",
            "credit": 3.0,
            "name": "Stylistique française I : écriture d'un article",
            "prereqs": "",
            "desc": "Ce cours a pour but la maîtrise du français écrit grâce à l'étude approfondie de textes variés et à la pratique intensive de l'écriture. Il comporte une partie théorique (fonctions du langage; notions de norme, de style, de registre, figures de style, etc.) et une partie pratique (analyse de textes, entraînement à la rédaction). Ce cours est centré sur l'écriture journalistique avec pour travail final la rédaction d'un article. Condition préalable :  GL/FRAN 2712 3.00 ou GL/FRAN 2212 3.00 avec une note minimale de C, ou cours reconnu par le département comme équivalent. Cours incompatibles : GL/FRLS 3810 3.00/6.00, GL/FRLS 3240 3.00, GL/FRAN 3240 3.00."
        },
        {
            "dept": "fran",
            "code": "3810",
            "credit": 6.0,
            "name": "Rédaction avancée en français langue seconde ",
            "prereqs": "",
            "desc": "Ce cours propose un travail intensif de rédaction de divers types de résumés, de textes d'idées et de récits. Il vise ainsi la consolidation de la grammaire des accords, l'emploi de structures syntaxiques libérées de l'anglais et sémantiquement pertinentes, la précision et l'adéquation lexicales, et une capacité rédactionnelle en langue seconde de niveau universitaire. L'utilisation des outils électroniques fait partie intégrante du cours. \r\nCondition préalable : GL/FRAN 2810 6.00 ou GL/FRLS 2240 6.00 (avec un minimum de C) ou tout cours reconnu par le Département comme équivalent.\r\nCours incompatibles : GL/FRLS 3240 3.00, GL/FRAN 3810 3.00, GL/FRAN 3812 3.00."
        },
        {
            "dept": "fran",
            "code": "3865",
            "credit": 3.0,
            "name": "Le français des stars",
            "prereqs": "",
            "desc": "Ce cours a pour objectif de travailler prononciation et élocution par le biais du français oral des milieux littéraire, théâtral/cinématographique et médiatique. Il présente l'évolution de la prononciation et de l'élocution françaises et invite les étudiants à réciter des poèmes, déclamer des tirades et présenter l'actualité. \r\nCondition préalable : GL/FRAN 2870 3.00 avec un minimum de C ou permission du Département d'études françaises. Remarque : ce cours n'est pas ouvert aux francophones.\r\nCours incompatible : GL/FRLS 3925 3.00."
        },
        {
            "dept": "fran",
            "code": "3870",
            "credit": 3.0,
            "name": "Le français oral contemporain ",
            "prereqs": "",
            "desc": "Ce cours a pour objectif l'étude de variétés orales du français contemporain (régionales, stylistiques, sociales, etc.) ainsi que l'acquisition de structures phonologiques, morphologiques et syntaxiques et d'un lexique adaptés aux exigences des situations de communication authentiques. \r\nCondition préalable : GL/FRAN 2870 3.00 ou GL/FRLS 2700 3.00 (avec un minimum de C) ou tout cours reconnu par le département comme équivalent. Cours incompatibles :  GL/FRLS 3700 3.00, AP/FR 3089 6.00. Remarque : Ce cours  n'est pas ouvert aux étudiants qui suivent ou ont suivi des cours de langue du courant francophone (GL/FRAN 1740 3.00, GL/FRAN 1745 3.00, GL/FRAN 2210 3.00 ou GL/FRAN 2710 3.00,  GL/FRAN 2212 3.00 ou GL/FRAN 2712 3.00, GL/FRAN 3240 3.00  ou GL/FRAN 3710 3.00 et GL/FRAN 3241 3.00 ou GL/FRAN 3712 3.00)."
        },
        {
            "dept": "fran",
            "code": "3921",
            "credit": 3.0,
            "name": "Littérature suisse de langue française",
            "prereqs": "",
            "desc": "Étude de la littérature suisse de langue française envisagée dans son contexte historique et social. Condition préalable GL/FRAN 2335 6.00 ou permission du département.  Remarque : une note minimale de C en GL/FRAN 2335 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises"
        },
        {
            "dept": "fran",
            "code": "4100",
            "credit": 6.0,
            "name": "Travail Individuel",
            "prereqs": "",
            "desc": "Les étudiants de quatrième année peuvent choisir un programme d'étude individuel. Pour ce faire, ils doivent soumettre au directeur du département une description de l'étude projetée. Cette description (détaillée et accompagnée d'une bibliographie) doit être signée par le professeur qui aura accepté de diriger le travail. Conditions préalables : (1) L'étudiant doit avoir obtenu une moyenne minimale de B+ dans les cours suivis au Département d'études françaises. (2) Le cours individuel doit être dirigé par un professeur de littérature, de linguistique ou de didactique du département, et dans le seul domaine de sa profession. (3) Ce cours ne peut en aucune manère remplacer un cours déjà offert par le département. (4) À moins de circonstances exceptionnelles, aucun professeur ne pourra diriger plus d'un étudiant pendant l'année universitaire. (5) Un même étudiant ne peut suivre qu'un seul cours FRAN 4100 3.00, FRAN 4100 6.00 pendant ses études à Glendon. Cours incompatible : AS/FR 4900 6.00."
        },
        {
            "dept": "fran",
            "code": "4212",
            "credit": 3.0,
            "name": "Conception et publication de documents",
            "prereqs": "",
            "desc": "Le cours couvre deux grandes composantes de la production de documents : la conception du matériel textuel et iconographique à partir de sources primaires et leur agencement dans des produits de communication. Condition préalable: GL/FRAN 3214 3.00 avec un minimum de C."
        },
        {
            "dept": "fran",
            "code": "4277",
            "credit": 3.0,
            "name": "Écriture narrative",
            "prereqs": "",
            "desc": "Ce cours forme les étudiants à l'écriture des genres littéraires narratifs (conte, nouvelle, roman). Il vise à amener chaque étudiant à améliorer son écriture, en maîtrisant différentes notions stylistiques et narratives. Condition préalable GL/FRAN 2335 6.00.  Remarque : une note minimale de C en GL/FRAN 2335 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises. Cours incompatible : GL/FRAN 3241 3.00."
        },
        {
            "dept": "fran",
            "code": "4532",
            "credit": 3.0,
            "name": "Images à lire et textes à voir",
            "prereqs": "",
            "desc": "Ce cours vise à explorer les différentes fonctions que l'image remplit au sein du texte littéraire. Le livre illustré et la description picturale, notamment celle des oeuvres d'art (ekphrasis), sont au centre de notre étude. Condition préalable : GL/FRAN 2335 6.00. Remarque : une note minimale de C en GL/FRAN 2335 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises."
        },
        {
            "dept": "fran",
            "code": "4537",
            "credit": 3.0,
            "name": "Monstres et monstrueux littéraires ",
            "prereqs": "",
            "desc": "Ce cours vise à comprendre, décrire et interpréter les formes esthétiques de la monstruosité dans un corpus de textes francophones tant populaire que consacré depuis la seconde moitié du XIXe siècle jusqu'à nos jours. Ce cours souhaite montrer que le monstre influence la définition et l'évolution de la modernité littéraire. Condition préalable GL/FRAN 2335 6.00 ou permission du département.  Remarque : une note minimale de C en GL/FRAN 2335 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises"
        },
        {
            "dept": "fran",
            "code": "4550",
            "credit": 3.0,
            "name": "Voix de femmes au XXe siècle",
            "prereqs": "",
            "desc": "Ce cours semestriel offre, à travers les textes de cinq écrivaines françaises, une réflexion sur la problématique des femmes au XXe siècle. D'une part, couvrant le siècle entier, les lectures feront l'objet d'une contextualisation socio-historique et offriront un aperçu de l'évolution de la condition des femmes. D'autre part, elles permettront d'aborder trois genres littéraires : le roman, l'autobiographie et la nouvelle.\r\nCondition préalable : GL/FRAN 2335 6.00.  Remarque : une note minimale de C en GL/FRAN 2335 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises"
        },
        {
            "dept": "fran",
            "code": "4562",
            "credit": 3.0,
            "name": "Linguistique appliquée à l'apprentissage et l'enseignement du français langue seconde",
            "prereqs": "",
            "desc": "Ce course examine et analyse, de façon critique, les théories contemporaines sur l'apprentissage et l'enseignement des langues secondes et en particulier du français langue seconde. Condition préalable : GL/FRAN 2600 6.00. Remarque : une note minimale de C en GL/FRAN 2600 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises. Avant l'automne 2016: cours incompatibles : GL/FRAN 4662 3.00, GL/LIN 4662 3.00. Avant l'automne 2011: cours incompatibles: GL/FRAN 4662 6.00, GL/LIN 4662 6.00."
        },
        {
            "dept": "fran",
            "code": "4640",
            "credit": 3.0,
            "name": "Littérature maghrébine au pluriel",
            "prereqs": "",
            "desc": "Ce cours vise à fournir un aperçu des étapes marquantes des littératures maghrébines de langue française. L'accent sera mis sur l'analyse de ces littératures dans le contexte historique, politique et socio-culturel des trois pays du Maghreb. On explorera, entre autres, les oeuvres représentatives des écrivains algériens, marocains et tunisiens suivants : Hélé Béji, Tahar Ben Jelloun, Rachid Boudjedra, Driss Chraibi, Mohammed Dib, Assia Djebar, Edmond Amran El Maleh, Rachid Mimouni, Abdelwahab Meddeb, Albert Memmi, Malika Mokeddem. Condition préalable : GL/FRAN 2335 6.00. Remarque : une note minimale de C en GL/FRAN 2335 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises."
        },
        {
            "dept": "fran",
            "code": "4651",
            "credit": 6.0,
            "name": "Histoire de la langue française",
            "prereqs": "",
            "desc": "Ce cours comprend deux parties: I. Introduction à la linguistique historique (définition et concepts, méthodologie, changement linguistique). II. Évolution historique du français: origine et formation (langue d'oil et langue d'oc); l'ancien français (structure et dialectes); le moyen français (transformations linguistiques, français littéraire/français populaire); le français moderne (type et tendances évolutives, le français et les langues romanes, les variétés sociolinguistiques et régionales, le français au Canada). Condition préalable : Cours d'introduction à la linguistique. Remarque : une note minimale de C en GL/FRAN 2600 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises.Cours incompatibles : AP/FR 4110 6.00, GL/FRAN 4651 3.00."
        },
        {
            "dept": "fran",
            "code": "4657",
            "credit": 3.0,
            "name": "La Sociolinguistique et les réalités de la francophonie",
            "prereqs": "",
            "desc": "Situation historique de la sociolinguistique. Aspects fondamentaux de cette science. Langues - dialectes - patois. Norme, tolérance, tabous, mythes qui régissent les diverses variétés de français (québécois, français, franco-ontarien, créole etc.). Influences des institutions religieuses, du rôle de la femme dans la société, des classes sociales, des fonctions du langage. Condition préalable : Cours d'introduction á la linguistique. Remarque : une note minimale de C en GL/FRAN 2600 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises. "
        },
        {
            "dept": "fran",
            "code": "4658",
            "credit": 3.0,
            "name": "Lexicologie/Lexicographie      ",
            "prereqs": "",
            "desc": "1. Généralités : les mots et les choses. Lexique et vocabulaire. Synchronie et diachronie. Lexicologie et lexicolographie; leur place au sein de la linguistique 2. Le mot, le signe linguistique et l'unité lexicale. Lexèmes et synthèmes. Identification des unités lexicales : synthèmes, figements et syntagmes. Formation des unités lexicales. L'information lexicale. 3. Lexicologie : typologie des dictionnaires. Nomenclature, article. Condition préalable : cours d'introduction à la linguistique. Remarque : une note minimale de C en GL/FRAN 2600 6.00 (ou équivalent) est requise pour tout étudiant se spécialisant en études françaises."
        }
    ]
}