{
    "courses": [
        {
            "dept": "fsl",
            "code": "1001",
            "credit": 3.0,
            "name": "Découverte du français / Discovering French",
            "prereqs": "",
            "desc": "This course introduces French to students with no prior formal or informal training in the language. It allows students to acquire the basics of French necessary to interact in an officially bilingual and socially plurilingual setting. \r\nCe cours propose une introduction à l\u0092apprentissage du français pour les étudiants n\u0092ayant aucune expérience d\u0092apprentissage formelle ou informelle du français. Il permet aux étudiants d\u0092acquérir les bases pour interagir en français dans un contexte de bilinguisme institutionnel et de plurilinguisme social.\r\nCours incompatible : GL/FSL 1000 6.00."
        },
        {
            "dept": "fsl",
            "code": "1110",
            "credit": 3.0,
            "name": "Français élémentaire 1 : Portraits ",
            "prereqs": "",
            "desc": "This course prepares beginner students (A1.2 of the CEFRL) to interact in oral and written French via the study of biographies and portraits of \r\ncities/places, in an officially bilingual and socially plurilingual setting. \r\nCe cours prépare les étudiants débutants en français (A1.2 du CECRL) à interagir à l\u0092oral et à l\u0092écrit à travers l\u0092étude du portrait de personnes ou de lieux, en contexte de bilinguisme institutionnel et de plurilinguisme social.\r\nCondition préalable : Placement, ou GL/FSL 1000 6.00, ou GL/FSL 1001 3.00 avec une note de C, ou la permission du Centre.\r\nCours incompatible : GL/FSL 1100 6.00."
        },
        {
            "dept": "fsl",
            "code": "1120",
            "credit": 3.0,
            "name": "Français élémentaire 2 : Itinérances",
            "prereqs": "",
            "desc": "Ce cours prépare les étudiants débutants en français (A2.1 du CECRL) à interagir à l\u0092oral et à l\u0092écrit à travers l\u0092étude du récit d\u0092immigration ou de voyage, en contexte de bilinguisme institutionnel et de plurilinguisme social.  \r\nThis course prepares beginner students (A2.1 of the CEFRL) to interact in oral and written French via the study of migrant stories and travel accounts, in an officially bilingual and socially plurilingual setting. \r\nCondition préalable : Placement, ou GL/FSL1110 3.00 avec une note de C, ou la permission du Centre.\r\nCours incompatible : GL/FSL 1100 6.00."
        },
        {
            "dept": "fsl",
            "code": "1210",
            "credit": 3.0,
            "name": "Français intermédiaire 1 : L'actualité",
            "prereqs": "",
            "desc": "This course prepares intermediate students (A2.2 of the CEFRL) to interact in oral and written French via the study of \u0093le fait divers\u0094 (human-interest stories), in an officially bilingual and socially plurilingual setting. \r\nCe cours permet aux étudiants intermédiaires en français (A2.2 du CECRL) de développer la compétence à interagir à l\u0092oral et à l\u0092écrit à travers l\u0092étude du fait divers et de l\u0092actualité, en contexte de bilinguisme institutionnel et de plurilinguisme social.\r\nCondition préalable : Placement, ou GL/FSL1100 6.00, ou GL/FSL1120 3.00 avec une note de C, ou la permission du Centre.\r\nCours incompatible : GL/FSL 1200 6.00."
        },
        {
            "dept": "fsl",
            "code": "1220",
            "credit": 3.0,
            "name": "Français intermédiaire 2 : La controverse",
            "prereqs": "",
            "desc": "This course prepares intermediate students (B1.1 of the CEFRL) to interact in oral and written French via the study of argumentative texts such as editorials, opinion pieces and blogs, in an officially bilingual and socially plurilingual setting. \r\nCe cours permet aux étudiants intermédiaires en français (B1.1 du CECRL) de développer la compétence à interagir à l\u0092oral et à l\u0092écrit à travers l\u0092étude de textes argumentatifs, comme le blog ou l\u0092éditorial, en contexte de bilinguisme institutionnel et de plurilinguisme social.\r\nCondition préalable : Placement, ou GL/FSL1210 3.00 avec une note minimale de C, ou la permission du Centre.\r\nCours incompatible : GL/FSL 1200 6.00."
        },
        {
            "dept": "fsl",
            "code": "2000",
            "credit": 3.0,
            "name": "Français avancé 1 : la vulgarisation scientifique",
            "prereqs": "",
            "desc": "Ce cours permet aux étudiants avancés en français (B1.2 du CECRL) de consolider la compétence à interagir en français, à l\u0092oral comme à l\u0092écrit, à travers l\u0092étude de l\u0092article de vulgarisation scientifique, en contexte de bilinguisme institutionnel et de plurilinguisme social.\r\nCondition préalable : Placement, ou GL/FSL1200 6.00, ou GLFSL1220 3.00 avec une note minimale de C, ou la permission du Centre \r\n"
        },
        {
            "dept": "fsl",
            "code": "2100",
            "credit": 3.0,
            "name": "Français avancé 2 : L'essai",
            "prereqs": "",
            "desc": "Ce cours permet aux étudiants avancés en français (B2.1 du CECRL) de consolider la compétence à interagir, à l\u0092oral et à l\u0092écrit, à travers l\u0092étude d\u0092extraits d\u0092essais, en contexte de bilinguisme institutionnel et de plurilinguisme social.\r\nCondition préalable : Placement, ou FSL 2000 3.0 avec une note minimale de C, ou la permission du Centre."
        },
        {
            "dept": "fsl",
            "code": "2200",
            "credit": 3.0,
            "name": "Le français par l'expérience",
            "prereqs": "",
            "desc": "Ce cours offre la possibilité aux étudiants avancés en français (B2 du CECRL) d\u0092approfondir leur apprentissage de la langue en effectuant un stage dans la communauté francophone. Remarque : pour s\u0092inscrire, les étudiants doivent se soumettre au processus de sélection du \r\ndépartement. Condition préalable : GL/FSL 2000 3.00 ou placement.   "
        }
    ]
}