{
    "courses": [
        {
            "dept": "hist",
            "code": "1010",
            "credit": 6.0,
            "name": "War, Revolution and Society in the 20th Century",
            "prereqs": "",
            "desc": "A study of the major political and social upheavals which have helped to shape the contemporary world. The course will concentrate on the origins of the two World Wars and the Cold War, and on their consequences. Topics chosen for detailed examination will vary from year to year."
        },
        {
            "dept": "hist",
            "code": "1025",
            "credit": 6.0,
            "name": "Ancient North America From the Last Ice Age to European Contact",
            "prereqs": "",
            "desc": "This course studies the history of Indigenous people in North America from \u0093time immemorial\u0094 to the regular settlement of Europeans in the 16th, 17th, and 18th centuries. Using a wide variety of sources it ranges from Meso-America to the High Arctic, and examines theories of the peopling of the continent; hunting, fishing and gathering; and the rise of corn civilizations."
        },
        {
            "dept": "hist",
            "code": "1040",
            "credit": 6.0,
            "name": "Popular Uses of History: An Introduction to Public History",
            "prereqs": "",
            "desc": "This course introduces students to the practice of public history, the ways in which history is produced for and understood by public audiences. It examines the ways the past has been brought to bear upon the present through monuments, museum exhibitions, parks and historical sites, film, historical fiction, and other locations constituting access points to history for the general public. "
        },
        {
            "dept": "hist",
            "code": "1074",
            "credit": 6.0,
            "name": "The Chinese Body in Cross-Cultural Perspective: Medicine, Food, and Footbinding",
            "prereqs": "",
            "desc": "This course uses the Chinese body as an entry point into the richness and complexity of daily life as it was lived and experienced in Chinese history. It focuses on two preeminent concerns in Chinese civilization\u0097health and food\u0097and on one of the most mysterious, widely condemned, and little understood Chinese bodily practices\u0097footbinding."
        },
        {
            "dept": "hist",
            "code": "1080",
            "credit": 6.0,
            "name": "Growing Up in North America",
            "prereqs": "",
            "desc": "Examines what it meant to be young in different times and places in the United States and Canada, and explores the interplay of cultural and material circumstances that shaped ideas about childhood and children's actual lives."
        },
        {
            "dept": "hist",
            "code": "1083",
            "credit": 6.0,
            "name": "Mass Media and Popular Culture in the Americas: Music, Movies and Power",
            "prereqs": "",
            "desc": "This course introduces the historical study of culture and culture industries in the Americas since 1820, analyzing how cultural change both created and was created by transformations in politics, economics, and societies. \r\nCourse credit exclusions: None.\r\n\r\nPrior TO FALL 2009: Course credit exclusion: AS/HIST 1083 6.00."
        },
        {
            "dept": "hist",
            "code": "1190",
            "credit": 6.0,
            "name": "The Jewish Experience, Civilization and Culture",
            "prereqs": "",
            "desc": "An examination of the interaction of Jews and gentiles in selected periods from antiquity through the 20th century. A case study in ethnic adaptation, the course seeks to understand how Jews sometimes adapted their lives to the world around them, and at other times withdrew into themselves, and how at certain times they exerted considerable influence on the people among whom they lived or who lived among them. \nCourse credit exclusion: AP/HUMA 2850 9.00 (prior to Fall 2014).\nNote: History Majors and Minors cannot take this course to satisfy the six credits required at the 1000-level in History for major or minor credit."
        },
        {
            "dept": "hist",
            "code": "1615",
            "credit": 6.0,
            "name": "Les origines des civilisations du monde",
            "prereqs": "",
            "desc": "Une perspective globale des développements intellectuels, sociaux, politiques, et culturels de la préhistoire jusqu'en 1914 sera explorée. Les événements et les évolutions à travers les siècles dans les différents continents seront étudiés. Cours incompatibles : GL/HIST 1200 6.00, GL/HUMA 1615 6.00."
        },
        {
            "dept": "hist",
            "code": "1680",
            "credit": 6.0,
            "name": "Modern Economic History: A Canadian Perspective ",
            "prereqs": "",
            "desc": "The economic history of Canada seen as an aspect of North American and, more generally, North Atlantic development, from the earliest staple trade to the present day. PRIOR TO FALL 2014: Course credit exclusions: GL/ECON 2680 6.00, GL/HIST 2680 6.00."
        },
        {
            "dept": "hist",
            "code": "2000",
            "credit": 3.0,
            "name": "Comment étudier l'histoire",
            "prereqs": "",
            "desc": "Ce cours est une initiation pratique à la méthodologie de la critique historique. Il développe les habiletés nécessaires à la sélection, à la lecture et à l'analyse des documents, en vue de maîtriser les étapes et la façon dont on écrit l'histoire."
        },
        {
            "dept": "hist",
            "code": "2100",
            "credit": 6.0,
            "name": "Ancient Greece and Rome",
            "prereqs": "",
            "desc": "A study of the Greek and Roman world, with particular emphasis on its social, economic and intellectual history, using primary sources archaeological, epigraphic and literary wherever possible."
        },
        {
            "dept": "hist",
            "code": "2150",
            "credit": 6.0,
            "name": "Classical Greek and Roman Archaeology: An Introduction",
            "prereqs": "",
            "desc": "The course provides an introduction to the history, theory and methodology of Classical Greek and Roman Archaeology. It examines key archaeological excavations in the Graeco-Roman world to explore the history of Greek and Roman archaeology, circa 1700 to the present. Introducing students to the formation processes of the archaeological record, it also examines modern archaeological methodology, theory and recording techniques."
        },
        {
            "dept": "hist",
            "code": "2220",
            "credit": 6.0,
            "name": "Medieval and Early Modern Europe",
            "prereqs": "",
            "desc": "This course surveys the economic, political, social and cultural evolution of Europe from the fall of the Roman Empire to the 17th century. \r\nCourse credit exclusions: GL/HIST 2600 6.00 (prior to Fall 2014), GL/HIST 3225 3.00. "
        },
        {
            "dept": "hist",
            "code": "2250",
            "credit": 3.0,
            "name": "Revolutions in the Stars: Science in the Age of Galileo",
            "prereqs": "",
            "desc": "This course surveys the major developments of the 'Scientific Revolution' (circa 1500-1700), when technical, theoretical and geographical discoveries gave rise to new understandings of the natural world. Celebrated astronomer, engineer, inventor and author Galileo serves as a focal point, bridging the worlds of famous theoreticians (Copernicus, Vesalius, and Newton) and of anonymous artisans and midwives. Course credit exclusions: SC/STS 3760 3.00."
        },
        {
            "dept": "hist",
            "code": "2300",
            "credit": 6.0,
            "name": "Modern Europe: From the French Revolution to the European Union",
            "prereqs": "",
            "desc": "An introduction to the development of modern Europe from the emergence of the seaborne empires to the First World War. Each week, there will be two lectures on aspects of European society, politics and intellectual life during the past three centuries. \r\nCourse credit exclusions: GL/HIST 2905 6.00, GL/HUMA 2905 6.00, GL/SOSC 2905 6.00."
        },
        {
            "dept": "hist",
            "code": "2500",
            "credit": 6.0,
            "name": "Canadian History",
            "prereqs": "",
            "desc": "From the arrival of its first human inhabitants tens of thousands of years ago to its increasingly globalized contemporary population, Canada has undergone numerous transformations. This course will examine the history of Canada from its earliest times to the present focusing of key transformations in the country's environmental, social, political, economic and cultural history. This survey of the nation-state from coast to coast to coast will introduce students to the main themes in Canadian history. It will trace broad changes over time and the consequences of colonization, ecological transformation, the development of an industrial capitalist economy, the emergence of the Canadian state, the role of global imperialism, urbanization, and Canada's changing position in international politics. In a country that is in the midst of tremendous change this course will help students understand the transformations of the past and the roots of our present circumstances.\nCourse Credit Exclusions: GL/HIST 2670 6.00, GL/SOSC 2670 6.00"
        },
        {
            "dept": "hist",
            "code": "2670",
            "credit": 6.0,
            "name": "Histoire du Canada",
            "prereqs": "",
            "desc": "Ce cours examine l\u0092histoire du Canada de la rencontre entre les Autochtones et les Européens jusqu\u0092à nos jours. Les thèmes comprennent l\u0092impact de la colonisation, les relations sociales et économiques dans les économies coloniales, la formation de l\u0092État et les transformations écologiques, les relations entre les francophones et les anglophones, les migrations internationales et la place du Canada dans le monde. \r\nCours incompatibles : AP/HIST 2500 6.00, AP/HIST 2501 3.00."
        },
        {
            "dept": "hist",
            "code": "2695",
            "credit": 3.0,
            "name": "Introduction à la philosophie ancienne",
            "prereqs": "",
            "desc": "Vue d'ensemble de la pensée philosophique de l'Antiquité par l'étude d'oeuvres marquantes des deux grands représentants de cette époque : Platon et Aristote, dont les oeuvres portent sur des questions de morale et de politique mais aussi de science naturelle. \nCours incompatibles : GL/PHIL/HIST/HUMA 1690 6.00 ; AP/PHIL 2015 3.00.\n"
        },
        {
            "dept": "hist",
            "code": "2696",
            "credit": 3.0,
            "name": "Introduction à la philosophie moderne",
            "prereqs": "",
            "desc": "Ce cours se penche sur les débuts au 17e siècle de la pensée philosophique moderne, que marque, notamment, le renversement de la conception aristotélicienne des sciences naturelles pour lui substituer celle - demeurée la nôtre - d'une science que structurent les mathématiques. \nCours incompatible : GL/PHIL/HUMA/HIST 1690 6.00."
        },
        {
            "dept": "hist",
            "code": "2710",
            "credit": 6.0,
            "name": "History of East Asia",
            "prereqs": "",
            "desc": "Explores how distinctive patterns of government, society and culture emerged over four millennia in East Asia - primarily China and Japan - and how this endogenous development prepared those nations to confront and challenge Western supremacy in the modern world."
        },
        {
            "dept": "hist",
            "code": "2721",
            "credit": 3.0,
            "name": "Introduction to Latin American History",
            "prereqs": "",
            "desc": "Introduces students to Latin America as an area of historical study. It provides a broad outline of major themes in Latin American history from the conquest era to the present day (15th-21st centuries) and an introduction to some of the key concepts and issues in the historiography.\r\nCourse credit exclusion: AP/HIST 2720 6.00."
        },
        {
            "dept": "hist",
            "code": "2731",
            "credit": 3.0,
            "name": "Introduction to Caribbean History",
            "prereqs": "",
            "desc": "Introduces students to some of the major themes of Caribbean historical evolution from its indigenous occupation to 20th century socio-political developments. The emphasis is on providing a broad outline and an introduction to some of the key concepts and issues in the historiography of the Caribbean. Course credit exclusion: AP/HIST 2730 6.00."
        },
        {
            "dept": "hist",
            "code": "2750",
            "credit": 6.0,
            "name": "African History, from 1800 to the Present",
            "prereqs": "",
            "desc": "The history of the African continent from 1800 to the present, concentrating on such major themes as political and economic change in pre-colonial African states, the impact of colonial rule and the emergence of modern nationalism."
        },
        {
            "dept": "hist",
            "code": "2790",
            "credit": 6.0,
            "name": "Islamic Civilization, 622 - 1400",
            "prereqs": "",
            "desc": "Explores the development and nature of Islamic civilization from the seventh century to 1400 AD."
        },
        {
            "dept": "hist",
            "code": "2810",
            "credit": 3.0,
            "name": "History of Modern Science",
            "prereqs": "",
            "desc": "Explores some of the central issues and theories in the history of physical and life sciences since the Renaissance. The focus is on the institutional trends and changing conceptual frameworks as they related to larger societal change. Course credit exclusions: AP/HIST 2810 6.00.\r Previously offered as: SC/STS 2010 6.00."
        },
        {
            "dept": "hist",
            "code": "2822",
            "credit": 3.0,
            "name": "Technology in the Modern World",
            "prereqs": "",
            "desc": "Examines the critical interconnections among technology, politics, culture, the arts, the sciences and social life. Specific topics will vary from year to year, covering social and historical contexts that may include Europe, North America, Africa, and Asia between 1500 and the present. Course Credit Exclusions: AP/HUMA 2412 3.00, SC/STS 3700 6.00, AP/HUMA 3700 6.00\n."
        },
        {
            "dept": "hist",
            "code": "2900",
            "credit": 6.0,
            "name": "Global Indigenous Histories",
            "prereqs": "",
            "desc": "This course compares the histories of Indigenous peoples around the world. It explores Indigenous rights, lands and resource conflicts, Indigenous-state relations, language and cultural revitalization, and political activism. Case studies may include Australia, New Zealand, Scandinavia, Africa, the South Pacific, Japan, the Americas, and the Circumpolar North. It also focuses on local Anishinaabe, Wendat, and Haudenosaunee First Nations."
        },
        {
            "dept": "hist",
            "code": "2901",
            "credit": 6.0,
            "name": "Introduction to Latin American History",
            "prereqs": "",
            "desc": "Introduces students to Latin American History from the moment of contact between Europeans and Americans through the 20th century. After a brief survey of the Colonial Era, it will explore the histories of several southern Republics, contrasting their development with that of North America. PRIOR TO FALL 2014: course credit exclusion: GL/HIST 2200 6.00."
        },
        {
            "dept": "hist",
            "code": "2905",
            "credit": 6.0,
            "name": "Introduction to the History of Modern Europe from 1450 to the Present ",
            "prereqs": "",
            "desc": "This course surveys the formation of Western civilization in Europe during the modern era as a foundation for subsequent studies in particular aspects of Western society or European civilization. It covers principally the social, political, economic and cultural history of Europe from the mid-15th century to the present."
        },
        {
            "dept": "hist",
            "code": "2920",
            "credit": 6.0,
            "name": "Medieval Science:  Thought and Practice",
            "prereqs": "",
            "desc": "A history of scientific thought in the Middle Ages, its divisions, its scope and its place in medieval society."
        },
        {
            "dept": "hist",
            "code": "2930",
            "credit": 6.0,
            "name": "The 20th Century:  A Global Perspective",
            "prereqs": "",
            "desc": "The history of the world from the First World War to the fall of communism. The course will consider the history of politics, war, culture and society. Subjects and themes will include the two world wars and their political and cultural impacts, the great depression of the 1930s, communism, fascism, liberalism and conservatism, feminism, demographic change, movements for national independence, the rise of the global economy, the environment and the apparent triumph of capitalism at the end of the century."
        },
        {
            "dept": "hist",
            "code": "2932",
            "credit": 3.0,
            "name": "Ancient Greece",
            "prereqs": "",
            "desc": "Explores ancient Mediterranean history from the early third millennium BCE through the rise and fall of Alexander the Great in the third century BCE. Proceeding chronologically, the course emphasizes the interdependence of social-political developments and intellectual-cultural movements. Course credit exclusions: GL/HIST 2635 6.00, AP/HIST/CLST 2100 6.00."
        },
        {
            "dept": "hist",
            "code": "2935",
            "credit": 3.0,
            "name": "Ancient Rome",
            "prereqs": "",
            "desc": "This course surveys the History of Ancient Rome from the founding of the Republic (753 BCE) to the fall of the Roman Empire in the fifth century. Proceeding chronologically, the course emphasizes the interdependence of socio-political developments and intellectual-cultural movements. Course credit exclusions: GL/HIST 2635 6.00, AP/HIST/CLST 2100 6.00."
        },
        {
            "dept": "hist",
            "code": "3000",
            "credit": 3.0,
            "name": "Teaching History in the Intermediate Classroom",
            "prereqs": "",
            "desc": "Examines the theories, philosophies, knowledge, policies and practices specific to teaching and learning History in the intermediate grades.\nThis course is only available to students in the Bachelor of Education (BEd) degree program. "
        },
        {
            "dept": "hist",
            "code": "3080",
            "credit": 3.0,
            "name": "Reading Landscapes Through Time",
            "prereqs": "",
            "desc": "Cultural landscapes change over time. This can result from changes in legal tenure, cultural adaptation, changes in the economic base or historical events. This course considers landscapes in various countries in chronological sequence."
        },
        {
            "dept": "hist",
            "code": "3150",
            "credit": 6.0,
            "name": "Early Greek History from the Bronze Age to the Persian Wars",
            "prereqs": "",
            "desc": "Examines the political, social, economic and intellectual history of Greece in the Bronze Age and the Archaic Period. It covers Mycenean Greece, the Dark Age, the rise of the city-state and culminates in the Persian Wars."
        },
        {
            "dept": "hist",
            "code": "3154",
            "credit": 3.0,
            "name": "Egypt from Alexander to Cleopatra",
            "prereqs": "",
            "desc": "Examines the social and cultural history of Ptolemaic Egypt from the Macedonian occupation in 332 BC to the death of Cleopatra VII in 30 BC."
        },
        {
            "dept": "hist",
            "code": "3155",
            "credit": 3.0,
            "name": "Egypt after Cleopatra: Society and Culture in a Roman Province",
            "prereqs": "",
            "desc": "Examines the social and cultural history of Egypt from the Roman conquest and death of the last Ptolemaic monarch, Cleopatra, in 30 BC to the end of Roman rule in the seventh century AD."
        },
        {
            "dept": "hist",
            "code": "3214",
            "credit": 3.0,
            "name": "Indigenous Resistance in the Americas",
            "prereqs": "",
            "desc": "This course compares the history of indigenous resistance from European contact with the Americas through\nto the expanding nation-state periods of the eighteenth and nineteenth centuries. Case studies will focus on\nLatin America and the United States with an emphasis on borderlands, religion, gender, and the law."
        },
        {
            "dept": "hist",
            "code": "3222",
            "credit": 3.0,
            "name": "The European Resistances during World War II",
            "prereqs": "",
            "desc": "This course analyzes the development of European resistance movements during the Second World War via a comparative perspective that highlights their specificities. The values they championed shaped post-war European societies and their struggle against oppression became a model in other wars of liberation."
        },
        {
            "dept": "hist",
            "code": "3240",
            "credit": 6.0,
            "name": "Renaissance and Reformation: Brand New or New Again",
            "prereqs": "",
            "desc": "How did inadequate education, greed, power struggles and rapid change produce Renaissance high culture? Was it a return to classical education, culture and institutions? A religious renewal? Or new social, political and economic patterns shaping the modern world? \r\nCourse credit exclusions: GL/HIST 3250 3.00, GL/HIST 3255 3.00.  \r\n\r\nPRIOR TO FALL 2009: Course credit exclusions: AK/HUMA 3460 6.00, AK/HUMA 3660 6.00 (taken between F84 and S91), AK/HIST 3410 6.00 (prior to Summer 1996), AK/HIST 3550 6.00, AK/HIST 3780 6.00 (prior to Summer 2003), GL/HIST 3250 3.00 and GL/HIST 3255 3.00."
        },
        {
            "dept": "hist",
            "code": "3315",
            "credit": 3.0,
            "name": "Modern Ukrainian History",
            "prereqs": "",
            "desc": "This course focuses on the integration of Ukrainians into the Habsburg and Russian empires, socio-economic change, cultural and ideological development and the emergence of a modern Ukrainian nation. Other topics include the Revolution of 1917-1921, Soviet and Western Ukraine between the wars, the impact of the Second World War and developments in Soviet Ukraine in the post-war period. \r\nCourse credit exclusions: None. \r\n\r\nPrior TO FALL 2009: Course credit exclusion: AS/HIST 3315  3.00."
        },
        {
            "dept": "hist",
            "code": "3315",
            "credit": 3.0,
            "name": "Francophonies d'Amérique de 1867 à nos jours ",
            "prereqs": "",
            "desc": "L'histoire des communautés francophones de l'Amérique du nord entre la continuité culturelle, le renouveau et l'éclipse. Le cours examine les raisons pour lesquelles ces communautés ont connu des parcours si différents."
        },
        {
            "dept": "hist",
            "code": "3344",
            "credit": 3.0,
            "name": "The Immigrant Experience in Canada before 1920",
            "prereqs": "",
            "desc": "This course examines immigrants' rural and urban experiences from European settlement to the First World War. Within a broadly chronological framework, a number of thematic issues are examined: public policy, work, gender, class structure, religion, institutional development, and xenophobia."
        },
        {
            "dept": "hist",
            "code": "3356",
            "credit": 3.0,
            "name": "Greeks in the World. A history of Greek migration and diaspora in the 20th Century",
            "prereqs": "",
            "desc": "Examines the history of migration from Greece to North America, Australia and Europe in the 19th and 20th centuries and combines a detailed historical narrative on the development of Greek diaspora with a more in-depth examination of specific communities. It also introduces students to the field of Diaspora and migration studies. Previously offered as: AP/HIST 3356 6.00."
        },
        {
            "dept": "hist",
            "code": "3392",
            "credit": 3.0,
            "name": "The Spanish Civil War",
            "prereqs": "",
            "desc": "While examining the causes and nature of the Spanish Civil War, this course also considers the place of the conflict in European politics and culture."
        },
        {
            "dept": "hist",
            "code": "3420",
            "credit": 6.0,
            "name": "The British Empire from 1600 to the Present",
            "prereqs": "",
            "desc": "This course surveys the history of the British Empire from 1600 to the present, from the founding of the East India Company, to dominant world power, to decolonization and independence, to imperial nostalgia."
        },
        {
            "dept": "hist",
            "code": "3436",
            "credit": 3.0,
            "name": "Machiavelli's World",
            "prereqs": "",
            "desc": "This course examines Renaissance culture between 1350-1500. It focuses in particular on the relationship between the writings of Niccolò Machiavelli - the period's most influential political philosopher, historian, and playwright - and the social, political and intellectual history of Renaissance Florence."
        },
        {
            "dept": "hist",
            "code": "3450",
            "credit": 3.0,
            "name": "Oral History Workshop",
            "prereqs": "",
            "desc": "This course examines the methodology, theory, and ethics of gathering, preserving, and interpreting the voices and memories of people and communities from the past. Students develop the skills to research, design, carry out, and write about an oral history project. "
        },
        {
            "dept": "hist",
            "code": "3520",
            "credit": 3.0,
            "name": "History of Quebec since 1867",
            "prereqs": "",
            "desc": "This course analyses the development of Quebec since Confederation. It looks at the cultural, economic, ideological, political, and social factors that have shaped Quebec society since 1867.\r\nCourse credit exclusions: None."
        },
        {
            "dept": "hist",
            "code": "3531",
            "credit": 6.0,
            "name": "The Working Class in Canadian Society",
            "prereqs": "",
            "desc": "Explores the changing nature of paid and unpaid work in Canada in the 19th and 20th centuries and the impact of those changes on Canadian society. Course credit exclusion: AP/HIST 3250 6.00. "
        },
        {
            "dept": "hist",
            "code": "3533",
            "credit": 6.0,
            "name": "The History of Women in Canada",
            "prereqs": "",
            "desc": "The political, economic and social history of women in Canada, from 1600 to the present. A thematic approach investigates commonalities and differences of women's experience. Course credit exclusions: GL/HIST 3690 6.00, GL/SOSC 3690 6.00, GL/WMST 3690 6.00."
        },
        {
            "dept": "hist",
            "code": "3535",
            "credit": 6.0,
            "name": "African-Canadian History",
            "prereqs": "",
            "desc": "Examines the history of African-Canadians from colonial contact in the 17th century through to the post-Second World War migrations from Africa and the Caribbean."
        },
        {
            "dept": "hist",
            "code": "3581",
            "credit": 6.0,
            "name": "Immigrant Experience in Canada",
            "prereqs": "",
            "desc": "Examines government policy, public attitudes and the immigrant life in Canada before and after the Second World War, as well as the refugee question and multiculturalism."
        },
        {
            "dept": "hist",
            "code": "3601",
            "credit": 6.0,
            "name": "Indigenous and Colonial American History to 1776",
            "prereqs": "",
            "desc": "Analyzes change and continuity in indigenous and colonial America, beginning with indigenous cultures before the European invasions, tracing the rise of British, French, and Spanish colonies in North America, focusing on the emergence and expansion of African American slavery, and concluding with the Declaration of Independence and the establishment of the United States in 1776.\r\nCourse credit exclusions: None. "
        },
        {
            "dept": "hist",
            "code": "3618",
            "credit": 3.0,
            "name": "United States Since 1945",
            "prereqs": "",
            "desc": "This course examines the conflicts and contradictions of American politics, culture, and society since the end of World War II. Through popular culture, journalism and political sources, we explore how social movements like civil rights, feminism, and the religious right changed the United States and probe the relationship between America's global military and economic power and ordinary people's lives.  This course is open to students who have  successfully completed 24 credits."
        },
        {
            "dept": "hist",
            "code": "3639",
            "credit": 3.0,
            "name": "Comparative Slavery and Emancipation in the Americas ",
            "prereqs": "",
            "desc": "Africans formed a core population in the colonies of the Americas. This course looks at the daily life of slaves along with the laws and codes that constructed and justified racial difference, comparing slave societies from fifteenth-century Iberia through to post-emancipation. Course credit exclusion: GL/HIST 3317 3.00."
        },
        {
            "dept": "hist",
            "code": "3658",
            "credit": 3.0,
            "name": "Colonialisme, genre sociétés en Afrique noire",
            "prereqs": "",
            "desc": "La colonisation par sa mission civilisatrice a contribué entre autres à forger des rapports de genre dans les sociétés africaines. Dans ce sens, ce cours traite de son impact sur les rapports sociaux de sexe autant en Afrique coloniale que postcoloniale. Offert précédemment comme suit: AP/WMST 3524 3.00, GL/WMST 3524 3.00."
        },
        {
            "dept": "hist",
            "code": "3659",
            "credit": 3.0,
            "name": "Revolutions in Latin America",
            "prereqs": "",
            "desc": "This comparative course focuses on the socio-political and economic roots of revolutions, as well as the changing nature of revolutionary experiences in Latin America, from the Cuban wars for independence (1868-98) through the uprising in Chiapas, Mexico (1994).\r\nCourse credit exclusion: GL/HIST 3212 6.00. Previously offered as: GL/HIST 3659 6.00."
        },
        {
            "dept": "hist",
            "code": "3667",
            "credit": 3.0,
            "name": "War, Power, and Sovereignty: Early Modern Political Theory I",
            "prereqs": "hist2905 hist3225 hist3436 phil1690 phil2620 phil2645 pols2485 pols2920",
            "desc": "This course examines concepts such as war, power, and sovereignty through the works of thinkers such as Machiavelli, Hobbes, and Locke not as abstract ideas but as responses to, comments on, defences, or critiques of historical events and social realities.\r\nPrerequisites: none required, but students can acquire recommended background by taking GL/HIST 2905 6.00, GL/HIST 3225 3.00, GL/HIST 3436 3.00, GL/PHIL 1690 6.00, GL/PHIL 2620 6.00, GL/PHIL 2645 6.00, GL/POLS 2485 6.00 or GL/POLS 2920 6.00.\r\nCourse credit exclusion: GL/POLS 3660 6.00."
        },
        {
            "dept": "hist",
            "code": "3668",
            "credit": 3.0,
            "name": "Community, Liberty, and Institutions: Early Modern Political Theory II",
            "prereqs": "hist2905 hist3225 hist3436 phil1690 phil2620 phil2645 pols2485 pols2920",
            "desc": "This course examines concepts such as community, liberty, and institutions through the works of thinkers such as Rousseau, Madison, Mill, and Marx not as abstract ideas but as responses to, comments on, defences, or critiques of historical events and social realities.\r\nPrerequisites: none required, but students can acquire recommended background by taking GL/HIST 2905 6.00, GL/HIST 3225 3.00, GL/HIST 3436 3.00, GL/PHIL 1690 6.00, GL/PHIL 2620 6.00, GL/PHIL 2645 6.00, GL/POLS 2485 6.00 or GL/POLS 2920 6.00.\r\nCourse credit exclusion: GL/POLS 3660 6.00."
        },
        {
            "dept": "hist",
            "code": "3695",
            "credit": 6.0,
            "name": "Medieval Intellectual History ",
            "prereqs": "",
            "desc": "A survey of the development of medieval thought and learning. This course emphasizes primary sources, and the works of a series of major medieval authors are studied in detail. "
        },
        {
            "dept": "hist",
            "code": "3700",
            "credit": 3.0,
            "name": "World War I",
            "prereqs": "",
            "desc": "This course examines the cataclysmic events of World War I, assessing the political, economic, social, and cultural responses to the fighting. Topics covered include: the theatres of war and home fronts, the global conflict, and the memory of the war."
        },
        {
            "dept": "hist",
            "code": "3701",
            "credit": 6.0,
            "name": "Spain's Global Empire, 1500-1900",
            "prereqs": "",
            "desc": "Few states in world history have had the global impact of the Spanish crown, which in the 1500s established control over large parts of the Americas and Southeast Asia. This course seeks to explain how this vast assemblage functioned and held together until the 1800s. In particular, we will examine how diverse non-European peoples responded to Spanish rule."
        },
        {
            "dept": "hist",
            "code": "3761",
            "credit": 3.0,
            "name": "Modern Japan: Meiji Restoration to Postwar Era (1868-Present)",
            "prereqs": "",
            "desc": "This course concerns modern Japan from the Meiji Restoration of 1867-1868, its relations with Europe, the Americas, and its East Asian neighbors on its tumultuous path to the Second World War, as well as its postwar efforts towards reconstruction and resurgence.  It examines the historical underpinnings of Japan as we see it today-economy, society, culture, politics, its successes and failures.  In a mere 150 years, Japan transformed itself from a feudal, decentralized regime into a highly centralized, internationally respected capitalist government and economy.  We evaluate that history as reflected in society, the economy, cultural, politics, and international relations.\r\nCourse credit exclusion: AP/HIST 3760 6.00."
        },
        {
            "dept": "hist",
            "code": "3780",
            "credit": 6.0,
            "name": "Themes in African History",
            "prereqs": "",
            "desc": "This course explores major issues in African history over the past 500 years. These include the rise and fall of kingdoms; relations with Europe and Asia; 19th-century revolutions; colonial administration; decolonization; and the search for economic and political stability post-independence. \r\nCourse credit exclusions: None. \r\n\r\nPrior TO FALL 2009: Course credit exclusions: AK/HIST 3100Q 6.00 (prior to Fall/Winter 2000-2001) and AK/HIST 3970 6.00."
        },
        {
            "dept": "hist",
            "code": "3781",
            "credit": 3.0,
            "name": "African Civilizations before Colonialism",
            "prereqs": "",
            "desc": "Explores the rise and fall of African Civilizations before the advent of formal European colonialism in the late nineteenth century. By emphasizing the &quot;African Genious&quot; in the making (and unmaking) of complex societies throughout the continent over millennia so as to dispel ahistorical notions of the so-called &quot;dark continent&quot;."
        },
        {
            "dept": "hist",
            "code": "3785",
            "credit": 3.0,
            "name": "Africa and Europe in the Age of Colonialism",
            "prereqs": "",
            "desc": "This course addresses the development of colonial empires across Africa and explores the interconnected histories of Africa and Europe from the French invasion of Algeria in 1830 to the period of decolonization in the1960s."
        },
        {
            "dept": "hist",
            "code": "3791",
            "credit": 6.0,
            "name": "The Islamic Gunpowder Empires",
            "prereqs": "",
            "desc": "This course studies, in a comparative fashion, the rise, consolidation and decline of the three major early modern Islamic empires (the Ottoman Turks, the Safavids of Persia and the Mughals of India) between 1500 to 1800. \r\nCourse credit exclusions: None. PRIOR TO FALL 2009: Course credit exclusion: AS/HIST 3791 6.00."
        },
        {
            "dept": "hist",
            "code": "3792",
            "credit": 6.0,
            "name": "The Middle East Since 1800",
            "prereqs": "",
            "desc": "This course surveys the main political events, social institutions, cultural and economic developments, as well as various aspects of everyday life in the Middle East from 1800 to the present. \r\nCourse credit exclusion: AP/POLS 3260 6.00. \r\n\r\nPRIOR TO FALL 2009: Course credit exclusions: AK/HIST 3920 6.00, AS/HIST 3792 6.00."
        },
        {
            "dept": "hist",
            "code": "3801",
            "credit": 3.0,
            "name": "Video Games and History",
            "prereqs": "",
            "desc": "This course introduces students to the video game industry and the development of video games as a social and technological phenomenon since the 1970s. It analyzes genre, narratives, themes, the use of History, and the depiction of class, gender, and race in video games. It also pays attention to the impact of video games on individuals and society."
        },
        {
            "dept": "hist",
            "code": "3843",
            "credit": 3.0,
            "name": "Occupation, Collaboration and Death: A Social and Military History of the Second World War to 1944 ",
            "prereqs": "",
            "desc": "This course provides a global history of the Second World War. It begins in 1937 with the Japanese invasion of mainland China and ends in 1944 with the invasion of northern Europe (D-Day). The course examines how, in occupied and unoccupied regions, the war affected ordinary peoples' lives. Attention is on collaboration with the enemy and the killing of civilians. "
        },
        {
            "dept": "hist",
            "code": "3844",
            "credit": 3.0,
            "name": "Liberation, Violence, and Reconstruction: A History of the Second World War and its Aftermath, 1944-1949 ",
            "prereqs": "",
            "desc": "This course provides a global history of the Second World War from 1944 and its aftermath. The course begins in June 1944 with D-Day and ends in 1949 with the Communist Party's military victory in China. It examines how liberation resulted in violence, war crimes trials, and reconstruction of those communities the war had affected. "
        },
        {
            "dept": "hist",
            "code": "3850",
            "credit": 6.0,
            "name": "Murder and Other Crimes: Law and Justice in 19th & 20th Century North America",
            "prereqs": "",
            "desc": "Examines the Canadian and American criminal justice systems from the mid-19th through late 20th century. The course focuses on important trials - such as Lizzie Borden (1892), the &quot;&quot;Scottsboro Boys&quot;&quot; (1931), and Steven Truscott (1959) - and how our explanations of these crimes are shaped by factors such as politics and the popular press, racial stereotypes, and contemporary understandings of gender and class. The course also looks at the role of the legal system, particularly the Supreme Court, showing both how the criminal law was applied in murder trials, as well as how these cases often resulted in changing interpretations of the law, and new developments in our understandings of civil rights.\n"
        },
        {
            "dept": "hist",
            "code": "3880",
            "credit": 6.0,
            "name": "Medicine and North American Society in Historical Perspective",
            "prereqs": "",
            "desc": "Explores North American social and cultural responses to disease. It offers a critical, historical evaluation of the ways in which science accorded medicine a new intellectual and institutional status that transformed explanations for disease and patterns of healing/caregiving."
        },
        {
            "dept": "hist",
            "code": "3891",
            "credit": 3.0,
            "name": "The Nature of Cities: The History of Urban Environments in North America",
            "prereqs": "",
            "desc": "Urbanization is the predominant form of human settlement in Canada and the United States. Over the course of the nineteenth- and twentieth-centuries, a majority of North Americans came to live in ever more populous cities. This course will examine the environmental consequences of urban development in North America from the end of the eighteenth-century to the twenty-first century.\r\nCourse credit exclusions: AP/GEOG 3040 3.00."
        },
        {
            "dept": "hist",
            "code": "3895",
            "credit": 3.0,
            "name": "Animal Histories: Historical Perspectives on Human-Animal Relationships",
            "prereqs": "",
            "desc": "This course takes a historical approach to the study of human-animal relationships. It examines how humans and their environments have been shaped by interactions with non-human animals over time. Drawing upon case studies from around the world, we examine the historical role of animals as agents of colonization, as raw material for human industry, as sources of protein and carriers of disease, as forms of technology and objects of display.\r\nPrerequisites: Students need 24 credits to apply and must have fulfilled a 1000-level requirement.\r\nCourse Credit Exclusions: AP/HUMA 3016 6.00, ES/ENVS 3150 3.00"
        },
        {
            "dept": "hist",
            "code": "3990",
            "credit": 6.0,
            "name": "Supervised Reading and Research",
            "prereqs": "",
            "desc": "Supervised reading and research course. It is normally open only to undergraduate history majors of exceptional ability. Prospective candidates must submit in advance a written application for approval to the departmental Chair or undergraduate director. For more information regarding the application criteria, please contact the department. Note: For Faculty regulations on independent study courses, please consult the Faculty of Arts Independent Reading Courses section of this calendar."
        },
        {
            "dept": "hist",
            "code": "3990",
            "credit": 3.0,
            "name": "Supervised Reading and Research",
            "prereqs": "",
            "desc": "Supervised reading and research course. It is normally open only to undergraduate history majors of exceptional ability. Prospective candidates must submit in advance a written application for approval to the departmental Chair or undergraduate director. For more information regarding the application criteria, please contact the department. Note: For Faculty regulations on independent study courses, please consult the Faculty of Arts Independent Reading Courses section of this calendar."
        },
        {
            "dept": "hist",
            "code": "4000",
            "credit": 3.0,
            "name": "Teaching History in the Intermediate-Senior Divisions - A",
            "prereqs": "",
            "desc": "This course begins to prepare students to be qualified teachers of History in Ontario classrooms. It allows students to examine the theories, philosophies, knowledge, policies and practices specific to teaching History in the intermediate and senior grades.\nThis course is only available to students in the Bachelor of Education (BEd) degree program. "
        },
        {
            "dept": "hist",
            "code": "4000",
            "credit": 6.0,
            "name": "Honours Essay",
            "prereqs": "",
            "desc": "Open only to exceptional Honours candidates in history after the completion of 84 credits and with the permission of the department. Candidates should confer with the Chair before the end of the preceding academic session."
        },
        {
            "dept": "hist",
            "code": "4001",
            "credit": 3.0,
            "name": "Teaching History in the Intermediate-Senior Division - B",
            "prereqs": "",
            "desc": "This course continues to prepare students to be qualified teachers of History in Ontario classrooms. It develops students' expertise in the theories, philosophies, knowledge, policies and practices specific to teaching History areas in order to further develop students' expertise for teaching this subject. ED/HIST 4000 (Part A) is a prerequisite for this course."
        },
        {
            "dept": "hist",
            "code": "4116",
            "credit": 6.0,
            "name": "Alexander the Great: Myth and Reality",
            "prereqs": "hist2100 huma3100 huma3102 huma3104 huma3105 huma3110 hist3120 hist3125 hist3130 hist3131 hist3135 hist3140 hist3150 hist3152 hist3153 hist3154 hist3160",
            "desc": "This course studies the life of Alexander the Great. It seeks to set his achievements within the context of Greek, Macedonian and Near Eastern history, and to disentangle the truth about him from the often unreliable and conflicting sources. \r\nPrerequisites: AP/HIST 2100 6.00 or AP/HUMA 3100 6.00 or AP/HUMA 3102 3.00 or AP/HUMA 3104 6.00 or AP/HUMA 3105 6.00 or AP/HUMA 3110 6.00 and AP/HIST 3120 6.00 or AP/HIST 3125 3.00 or AP/HIST 3130 6.00 or AP/HIST 3131 6.00 or AP/HIST 3135 3.00 or AP/HIST 3140 3.00 or AP/HIST 3150 6.00 or AP/HIST 3152 6.00 or AP/HIST 3153 6.00 or AP/HIST 3154 3.00 or AP/HIST 3160 6.00 or departmental permission.\r\nOpen to: Priority is given to History, Classical Studies or Hellenic Studies Honours majors and minors who have successfully completed at least 84 credits."
        },
        {
            "dept": "hist",
            "code": "4132",
            "credit": 6.0,
            "name": "Caesar's Palace: A Social History of the Roman Imperial Court",
            "prereqs": "hist1100 hist2100 huma3110 hist3120 hist3125 hist3130 hist3131 hist3135 hist3136 hist3140 hist3150 hist3152 hist3154 hist3155 hist3160",
            "desc": "Roman emperors have traditionally been studied from the point of view of the political decisions that they made. Until recently, less emphasis has been given to the household or court of which they formed the centre. In this course, we examine the new contributions that 'court studies' are making to our understanding of the emperor and his court. Prerequisites: AP/HIST 1100 6.00 or AP/HIST 2100 6.00 or AP/HUMA 3110 6.00 AND AP/HIST 3120 6.00 or AP/HIST 3125 3.00 or AP/HIST 3130 6.00 or AP/HIST 3131 6.00 or AP/HIST 3135 3.00 or AP/HIST 3136 6.00 or AP/HIST 3140 3.00 or AP/HIST 3150 6.00 or AP/HIST 3152 6.00 or AP/HIST 3154 3.00 or AP/HIST 3155 3.00 or AP/HIST 3160 6.00 or departmental permission. Course credit exclusions: AP/HIST 4130 6.00 (prior to Fall 2016) Priority is given to History, Classical Studies or Hellenic Studies Honours majors and minors who have successfully completed at least 84 credits."
        },
        {
            "dept": "hist",
            "code": "4200",
            "credit": 6.0,
            "name": "Culture and Society in Medieval Europe",
            "prereqs": "hist2220 hist2790 hist3212 hist3234 hist3255 hist3280 hist3809 huma3780 huma4680 huma4680",
            "desc": "Relationships between important works of medieval literature and the society that produced them. \r\nThis course is restricted to History or European Studies Honours majors and minors who have successfully completed at least 84 credits. Prerequisites: AP/HIST 2220 6.00 or AP/HIST 2790 6.00 or AP/HIST 3212 6.00 or AP/HIST 3234 6.00 or AP/HIST 3255 6.00 or AP/HIST 3280 6.00 or AP/HIST 3809 6.00 or AP/HUMA 3780 6.00 or AP/HUMA 4680 3.00 AP/HUMA 4680 6.00 or departmental permission."
        },
        {
            "dept": "hist",
            "code": "4220",
            "credit": 6.0,
            "name": "Canadian Labour and Immigration History",
            "prereqs": "",
            "desc": "The growth and development of the trade union movement and the impact on it of immigration and other policies of the Canadian government."
        },
        {
            "dept": "hist",
            "code": "4225",
            "credit": 6.0,
            "name": "Church, Mosque and Synagogue: Jews, Muslims and Christians in Medieval Spain",
            "prereqs": "",
            "desc": "Explores the contours of Christian-Muslim-Jewish co-existence in medieval Spain, focusing on religious and social themes. Topics include conversion, cross-traditional intellectual stimuli, sacred violence and positive images of the religious other."
        },
        {
            "dept": "hist",
            "code": "4310",
            "credit": 6.0,
            "name": "Living History: Creating History in the Greater Toronto Area",
            "prereqs": "",
            "desc": "This course explores the approaches and practices of public history in Canada. Students learn about historical memory and commemorations, visit museums, meet experts, and students spend 12-weeks in a work placement during the Winter term in a heritage or cultural institution.\r\nPrerequisite: Permission from the Department.\r\nCourse credit exclusion: AP/HIST 4840 6.00."
        },
        {
            "dept": "hist",
            "code": "4360",
            "credit": 6.0,
            "name": "Europe Between the Wars, 1918-1939",
            "prereqs": "",
            "desc": "Problems such as political ideologies, militarism, economic instability, youth movements and class roles in modernization, studied comparatively across frontiers wherever possible. Course credit exclusion: AP/HIST 4030 6.00."
        },
        {
            "dept": "hist",
            "code": "4410",
            "credit": 3.0,
            "name": "Society, Human Rights, and the Archives",
            "prereqs": "",
            "desc": "Through field trips and in-class activities, this course analyses the role of archives in facilitating or impeding human rights activism, movements for redress, and documenting the experience of historically marginalized groups. It considers questions of access, preservation, and memory. "
        },
        {
            "dept": "hist",
            "code": "4500",
            "credit": 6.0,
            "name": "Historiography",
            "prereqs": "",
            "desc": "A survey of history's evolution as a unique intellectual craft. It examines history's changing relationship with the broader social and cultural milieu, its varied functions and significant methodological innovations.\r\nPrerequisite: 36 credits in History or permission of the Department."
        },
        {
            "dept": "hist",
            "code": "4505",
            "credit": 6.0,
            "name": "Canadian Labour and Immigration History",
            "prereqs": "",
            "desc": "The growth and development of the trade union movement and the impact on it of immigration and other policies of the Canadian government."
        },
        {
            "dept": "hist",
            "code": "4508",
            "credit": 6.0,
            "name": "Cultures and Colonialism: Canada, 1600-1900",
            "prereqs": "hist1035 hist1050 hist1086 hist2500 cdns2200 hist3546 hist3550 hist3581 mist1050",
            "desc": "Explores issues of contact and colonialism in Canadian history from 1600 - 1900. Themes may include the shifting practices of European imperialism; new cultural forms created by First Nations-European contact; changing economic systems; and patterns of state formation. \r\nPrerequisites: AP/HIST 1035 6.00 or AP/HIST 1050 6.00 or AP/HIST 1086 6.00 or AP/HIST 2500 6.00 or AP/CDNS 2200 6.00 or AP/HIST 3546 6.00 or AP/HIST 3550 6.00 or AP/HIST 3581 6.00 or AP/MIST 1050 6.00 or by departmental permission.\nOpen to: This course is restricted to History or Canadian Studies Honours majors and minors who have successfully completed at least 84 credits."
        },
        {
            "dept": "hist",
            "code": "4560",
            "credit": 6.0,
            "name": "Religion and Society in Ancient Greece",
            "prereqs": "",
            "desc": "This seminar course explores the relationship between religion, ancient thought and society through forms of worship. It introduces students to the diversity of ancient documents (archaeological, epigraphic and iconographic evidence, as well as literature) and conceptions about religion. \nCourse credit exclusions: AP/HUMA/CLST 3105 6.00"
        },
        {
            "dept": "hist",
            "code": "4619",
            "credit": 3.0,
            "name": "Cultural Encounters in Early Modern Europe, 1492-1700",
            "prereqs": "",
            "desc": "This seminar course examines European society\u0092s first contact with the world beyond the Mediterranean, a crucial sustained moment in the cultural transformation of Europe, Africa, and the Americas. The course considers questions of power, perception, and understanding in that long cultural encounter."
        },
        {
            "dept": "hist",
            "code": "4621",
            "credit": 6.0,
            "name": "Decolonising Canada - Décoloniser le Canada",
            "prereqs": "",
            "desc": "This seminar course examines the history, current state, and possible futures of Indigenous-non-Indigenous relations in Canada.\r\nCe séminaire examine l'histoire, l\u0092état actuel, et les avenirs potentiels des relations entre les autochtones et les non-autochtones au Canada.\r\nPrerequisite: Six credits in any discipline on the study of Canada or permission of the Department.\r\nCourse credit exclusion: GL/CDNS/SOSC 4622 6.00."
        },
        {
            "dept": "hist",
            "code": "4630",
            "credit": 6.0,
            "name": "Brazil Globalization Seminar",
            "prereqs": "",
            "desc": "This discussion seminar examines major contemporary developments in Brazil's domestic situation and external relations, notably the rise of nationalism, industrialization, urbanization, the social condition of Afro-Brazilian and indigenous peoples, migration flows, and the country's role in intra-Hemispheric and world affairs. Course credit exclusions: GL/HIST 3670 3.00, GL/HIST 3710 6.00."
        },
        {
            "dept": "hist",
            "code": "4670",
            "credit": 3.0,
            "name": "Writing Women's History",
            "prereqs": "",
            "desc": "Examines how feminist issues and theories have influenced the ways women's history has been written, the questions asked and the themes studied. Students are encouraged to develop the conceptual and methodological skills to undertake their own historical research. \r\nPreviously offered as: AP/WMST 4507 3.00, GL/WMST 4507 3.00."
        },
        {
            "dept": "hist",
            "code": "4699",
            "credit": 6.0,
            "name": "Selected Topics in US History",
            "prereqs": "hist2600 hist3601 hist3602 hist3610 hist3622 hist3625 hist3692 huma2325",
            "desc": "Research seminar on selected topics in US history. Topics vary from year to year. Please consult the History supplemental calendar for more details. This course is restricted to History Honours majors and minors who have successfully completed at least 84 credits. Prerequisites: AP/HIST 2600 6.00 or AP/HIST 3601 6.00 or AP/HIST 3602 6.00 or AP/HIST 3610 6.00 or AP/HIST 3622 3.00 or AP/HIST 3625 3.00 or AP/HIST 3692 6.00 or AP/HUMA 2325 6.00 or departmental permission."
        },
        {
            "dept": "hist",
            "code": "4725",
            "credit": 6.0,
            "name": "Topics in Modern Caribbean History",
            "prereqs": "hist2730 hist3480 huma2310",
            "desc": "Examines topics in the development of the Caribbean, 1938-1983, from the labour riots of the thirties to the American intervention in Grenada. It includes a Pan-Caribbean examination of economic, political and socio-cultural developments in this period. \r\nThis course is restricted to History or Latin American and Caribbean Studies Honours majors and minors who have successfully completed at least 84 credits. Prerequisites: AP/HIST 2730 6.00 or AP/HIST 3480 6.00 or AP/HUMA 2310 9.00 or departmental permission."
        },
        {
            "dept": "hist",
            "code": "4754",
            "credit": 6.0,
            "name": "Aztec and Inca Nobles under Spanish Rule",
            "prereqs": "",
            "desc": "Focusing on Mexico and Peru in the 16th and 17th centuries, this course studies the indigenous elites of the former Aztec and Inca empires under Spanish rule. It approaches native nobles as mediators between colonial and indigenous society and as creators of new narratives and cultural practices that sought to position indigenous peoples more advantageously in the colonial context."
        },
        {
            "dept": "hist",
            "code": "4765",
            "credit": 6.0,
            "name": "Rethinking Gender in East Asian History",
            "prereqs": "hist2710 hist3760 hist3766 hist3770 hist3775 huma2420 huma2430 huma2435 huma3500 huma3505 huma3506 huma3510",
            "desc": "Examines gender roles in pre-modern and modern China, Korea and Japan. It focuses on women: their places in the family and society, their relationships with one another and men, and the evolution of ideas about gender. Note: Priority is given to History or East Asian Studies Honours majors and minors who have successfully completed at least 84 credits. \r\n\r\nPrerequisites: AP/HIST 2710 6.00 or AP/HIST 3760 6.00 or AP/HIST 3766 3.00 or AP/HIST 3770 6.00 or AP/HIST 3775 3.00 or AP/HUMA 2420 9.00 or AP/HUMA 2430 9.00 or AP/HUMA 2435 9.00 or AP/HUMA 3500 6.00 or AP/HUMA 3505 3.00 or AP/HUMA 3506 3.00 or AP/HUMA 3510 6.00 or departmental permission."
        },
        {
            "dept": "hist",
            "code": "4799",
            "credit": 6.0,
            "name": "Selected Topics in African History",
            "prereqs": "hist2750 hist3780 sosc2480 hist3480",
            "desc": "Research seminar on selected topics in African history. Topics vary from year to year. Please consult the History supplemental calendar for more details. This course is restricted to History and African Studies Honours majors and minors who have successfully completed at least 84 credits. Prerequisites: AP/HIST 2750 6.00 or AP/HIST 3780 6.00 or AP/SOSC 2480 9.00 or AP/HIST 3480 6.00 or departmental permission."
        },
        {
            "dept": "hist",
            "code": "4830",
            "credit": 6.0,
            "name": "In Slavery and Freedom: Blacks in the Americas",
            "prereqs": "",
            "desc": "Examines and compares the responses of Africans and their descendants to the experiences of enslavement, racism, colonialism and imperialism from the 15th century to the 20th century and analyses the impact of the African presence on western 'civilization'. Note: Priority is given to History Honours majors and minors who have successfully completed at least 84 credits."
        },
        {
            "dept": "hist",
            "code": "4840",
            "credit": 6.0,
            "name": "Public History",
            "prereqs": "",
            "desc": "This course examines the forms, goals, and practices of making history in museums, archives, historic sites, and other institutions of public history. It enables students to learn the meaning and methods in the production of memory and introduces them to the practical skills for the public presentation of historical knowledge. The course combines analytical study with a part-time placement in a public-history site. Course credit exclusion: GL/HIST 4310 6.0\r\nNote: Priority is given to History Honours Majors and Minors who have successfully completed at least 84 credits."
        },
        {
            "dept": "hist",
            "code": "4850",
            "credit": 6.0,
            "name": "History of Me: The Genealogy Seminar",
            "prereqs": "",
            "desc": "We have been shaped by our families' histories. This hands-on workshop explores the choices, limitations and opportunities of one or more person from each student's past - a parent, grandparent, or anyone else the student deemed worthy of researching - through genealogical research, and links these intimate realities with the global and Canadian histories of which they are necessarily a part. \r\nStudents need 84 credits to apply and must have fulfilled a 1000-level requirement."
        },
        {
            "dept": "hist",
            "code": "4990",
            "credit": 3.0,
            "name": "Supervised Reading and Research",
            "prereqs": "",
            "desc": "This course is intended to enable students of exceptional ability to pursue individual fields of interest not otherwise provided for by the regular curriculum."
        },
        {
            "dept": "hist",
            "code": "4990",
            "credit": 6.0,
            "name": "Supervised Reading and Research",
            "prereqs": "",
            "desc": "This course is intended to enable students of exceptional ability to pursue individual fields of interest not otherwise provided for by the regular curriculum. Note: Open to history majors after completion of 84 credits with the permission of the Chair and with the agreement of a member of the department who will act as supervisor."
        },
        {
            "dept": "hist",
            "code": "4991",
            "credit": 6.0,
            "name": "Advanced Seminar in History",
            "prereqs": "",
            "desc": "Fourth-year students with an average of B+ in history courses may enrol in a 5000-level seminar with permission from the Instructor. Consult the Graduate Program Calendar for available courses."
        },
        {
            "dept": "hist",
            "code": "4991",
            "credit": 3.0,
            "name": "Advanced Seminar in History",
            "prereqs": "",
            "desc": "Fourth-year students with an average of B+ in history courses may enrol in a 5000-level seminar with permission from the Instructor. Consult the Graduate Program Calendar for available courses."
        },
        {
            "dept": "hist",
            "code": "5001",
            "credit": 3.0,
            "name": "Doing History: An Introduction",
            "prereqs": "",
            "desc": "As an introduction to graduate studies, the course uses a select list of 'great books' about diverse times and places in order to discover and describe what good historians do as they research and write. The course focuses on students' cultivating skills, including reading strategically, deriving synopses, approaching primary sources, and writing proposals for research projects."
        },
        {
            "dept": "hist",
            "code": "5025",
            "credit": 3.0,
            "name": "The Conflict of Religions in the Roman Empire",
            "prereqs": "",
            "desc": "N/A"
        },
        {
            "dept": "hist",
            "code": "5060",
            "credit": 6.0,
            "name": "Directed Readings                      ",
            "prereqs": "",
            "desc": "Supervised reading for individual students or small groups, the separate sections of the course being devoted to the several fields of study and examination.\r\n"
        },
        {
            "dept": "hist",
            "code": "5060",
            "credit": 3.0,
            "name": "Directed Readings                      ",
            "prereqs": "",
            "desc": "Supervised reading for individual students or small groups, the separate sections of the course being devoted to the several fields of study and examination.\r\n"
        },
        {
            "dept": "hist",
            "code": "5070",
            "credit": 6.0,
            "name": "Directed Readings                      ",
            "prereqs": "",
            "desc": "Supervised reading for individual students or small groups,\nthe separate sections of the course being devoted to the several fields of study and examination.\n"
        },
        {
            "dept": "hist",
            "code": "5070",
            "credit": 3.0,
            "name": "Directed Readings                      ",
            "prereqs": "",
            "desc": "Supervised reading for individual students or small groups, the separate sections of the course being devoted to the several fields of study and examination.\r\n\r\n"
        },
        {
            "dept": "hist",
            "code": "5172",
            "credit": 3.0,
            "name": "State and Society in Canada, 1945 to the Present",
            "prereqs": "",
            "desc": "Explores aspects of the so-called expansion of the role of the state in Canada at all levels following the Second World War, and since the 1980s, its supposed contraction."
        },
        {
            "dept": "hist",
            "code": "5230",
            "credit": 3.0,
            "name": "Race, Gender and American Politics",
            "prereqs": "",
            "desc": "In recent years, a wealth of scholarship on race, gender and ethnicity has transformed the way scholars treat almost every aspect of US. \r\nhistory. This course uses this historical literature to re-examine conventional topics, such as the New Deal and the Cold War, broach fresh subjects like the history of whiteness, and shed new light on American culture and politics. Weekly readings explore such topics as \r\nslavery, the formation of the US. welfare system, Americanization and ethnicity, lynching and miscegenation, African American organizing in \r\n the Jim Crow south, gay history, and the urban crisis."
        },
        {
            "dept": "hist",
            "code": "5480",
            "credit": 3.0,
            "name": "The Making of Asian Studies: Critical Perspectives",
            "prereqs": "",
            "desc": "Offers a historical examination of the multiple, overlapping processes through which Asian identities and regions were constituted. It will also examine new directions in Asian studies in an era of intensified global flows, transnationalism, and the presence of Asian diaspora in Canada and elsewhere."
        },
        {
            "dept": "hist",
            "code": "5532",
            "credit": 3.0,
            "name": "The North American Immigrant Experience",
            "prereqs": "",
            "desc": "A social and cultural history of immigrants in North America from the origins of mass migration to the present. Beginning with a critical examination of the historiography of North American immigrant and ethnic studies, it assesses the immigrant experience through a variety of themes. The social dimensions are explored through such topics as the causes and strategies of migration, social segregation and stratification, race and gender. The cultural aspects deal with questions of identity, cultural retention and accommodation, xenophobia, multiculturalism, and multiracialism. Attention will also be given to immigration and refugee policies, responses to such policies, as well as their effectiveness in regulating the economic, social, and cultural life of North America."
        },
        {
            "dept": "hist",
            "code": "5538",
            "credit": 3.0,
            "name": "Critical Interpretations of Disability History",
            "prereqs": "",
            "desc": "Examines the historical experiences of people with disabilities from medieval European history to twentieth century North American society. Topics to be examined include: pre-industrial interpretations of physical and mental disability; the impact of the industrial revolution on disability as a social category and lived experience; segregation, trans-institutionalization and community living; rehabilitation programs and their critics in the twentieth century; diversity, discrimination and activism within the disability community; the modern development of critical literature on the history of people with disabilities."
        },
        {
            "dept": "hist",
            "code": "5543",
            "credit": 3.0,
            "name": "Nature and Society in the Industrial World: Global Environmental History since Industrialization",
            "prereqs": "",
            "desc": "This course examines the relationships between people and their environments from the mid-nineteenth century to the early twenty-first century. It considers the global ecological consequences of industrialization and the growing human footprint on Earth from a historical perspective, drawing from the field of environmental history."
        },
        {
            "dept": "hist",
            "code": "5562",
            "credit": 3.0,
            "name": "Issues in Comparative Women's and Gender History: Part II, The Twentieth Century",
            "prereqs": "",
            "desc": "This course aims to give students a broad introduction to the diversity of women's experience in different countries by examining selected themes in the history of women during the 20th century. PRIOR TO WINTER 2015: course credit exclusion: GS/WMST 6406 3.00."
        },
        {
            "dept": "hist",
            "code": "5564",
            "credit": 3.0,
            "name": "Histories: Women, Genders, Sexualities",
            "prereqs": "",
            "desc": "This course examines key concepts, debates, methodologies, and theoretical directions in the history of women, genders and sexualities from a transnational and intersectional perspective.\nIt focuses on the dialogue between gender history and social history and asks how social movements have shaped the questions historians ask and how gender articulates with major analytic categories including class relations and racial formation.\n"
        },
        {
            "dept": "hist",
            "code": "5590",
            "credit": 3.0,
            "name": "Transnational and Global Histories",
            "prereqs": "",
            "desc": "Examines transnational historical processes and events, focusing on temporal and geographic scales outside of traditional national histories, and on linking the local and the global. It considers how global forces affect societies, and problematizes core historical assumptions."
        },
        {
            "dept": "hist",
            "code": "5701",
            "credit": 6.0,
            "name": "Modern Cultural History",
            "prereqs": "",
            "desc": " "
        },
        {
            "dept": "hist",
            "code": "5740",
            "credit": 3.0,
            "name": "History of Things: Objects, Representation, and Display",
            "prereqs": "",
            "desc": "This course explores critical debates and interdisciplinary research methods employed in the study of material objects. It draws on case studies and theoretical work on material culture, display, and representation to consider the influence of the 'material turn' on contemporary scholarship and on historical and curatorial practices."
        },
        {
            "dept": "hist",
            "code": "5751",
            "credit": 3.0,
            "name": "Food in World History",
            "prereqs": "",
            "desc": "This course examines food in world history to the present day.  Beginnning in evolutionary prehistory, the course focuses on hunter-gatherers and the first farmers, the development of cuisines and cross-cultural contacts before 1500 CE, the Columbian exchange of peoples, plants, animals, and food technologies, and the effects of colonialization, industrialization, war, and commerce on world food production, consumption and cultures.  "
        },
        {
            "dept": "hist",
            "code": "5770",
            "credit": 3.0,
            "name": "Languages, Empires, and Nations",
            "prereqs": "",
            "desc": "Explores the history of ideologies and policies concerning languages and their relation to society in Europe and its colonies since the fifteenth century. The course examines the linguistic policies of early modern and modern colonial empires, the rise of linguistic nationalism, and the broad implications of changing forms of linguistic knowledge."
        },
        {
            "dept": "hist",
            "code": "5830",
            "credit": 6.0,
            "name": "Contexts Of Victorian Science      ",
            "prereqs": "",
            "desc": "Contexts of Victorian Science. This course focuses on nineteenth century\nBritish and European science and its social, political, cultural, and intellectual contexts. Adopting the contextualist approach to the history of science allows us to raise a series of provocative questions: in what way did all of these different contexts shape the nature of nineteenth century\nscientific thought? How were scientific facts socially constructed? What was it about the nineteenth century context that led many intellectuals to reject Christianity and embrace science as providing a new, privileged form of knowledge? Included among the topics to be covered are the discourse of natural theology, the politics of geological controversy, Scottish philosophy and phrenology, radical working class Lamarckianism in England during the 1830s, the plurality of worlds debate, science and gender, the professionalization of science, English scientific naturalism and German scientific materialism, the literary structure of Darwin's Origin of Species, Darwinian theory and its ideological uses, and late nineteenth century physics and psychics. This course will be of interest to students of British, European, social, and intellectual history.\n"
        },
        {
            "dept": "hist",
            "code": "6001",
            "credit": 3.0,
            "name": "Directed Readings                      ",
            "prereqs": "",
            "desc": "Supervised reading for individual students or small groups, the separate sections of the course being devoted to the several fields of study and examination.\r\n"
        },
        {
            "dept": "hist",
            "code": "6001",
            "credit": 6.0,
            "name": "Directed Readings                      ",
            "prereqs": "",
            "desc": "Supervised reading for individual students or small groups, the separate sections of the course being devoted to the several fields of study and examination.\r\n"
        },
        {
            "dept": "hist",
            "code": "6002",
            "credit": 3.0,
            "name": "Directed Readings                      ",
            "prereqs": "",
            "desc": "Supervised reading for individual students or small groups, the separate sections of the course being devoted to the several fields of study and examination.\r\n"
        },
        {
            "dept": "hist",
            "code": "6002",
            "credit": 6.0,
            "name": "Directed Readings                      ",
            "prereqs": "",
            "desc": "Supervised reading for individual students or small groups, the separate sections of the course being devoted to the several fields of study and examination.\r\n"
        },
        {
            "dept": "hist",
            "code": "6030",
            "credit": 6.0,
            "name": "Selected Topics In The Hist. Of Canada ",
            "prereqs": "",
            "desc": "This course deals with important problems in Canadian history, and it emphasizes the critical examination of the historical literature concerned with those problems. The topics normally included are the interpretation of Canadian history, the foundation and development of New France and British North America prior to Confederation, the nature of Canadian nationalism, regionalism and continentalism, political parties and the political process, the political economy of Canada, external relations, French-Canadian society, and French-English relations. When appropriate, attention is paid to relevant literature in other disciplines. Normally open only to Ph.D. Candidates. Open to M.A. Candidates in exceptional circumstances and with the permission of the\n Director.\n"
        }
    ]
}