{
    "courses": [
        {
            "dept": "mgmt",
            "code": "1000",
            "credit": 3.0,
            "name": "Introduction to Business",
            "prereqs": "",
            "desc": "Using lectures, team-based exercises, interactive discussions and field research, this course will introduce students to the key management\r\nconcepts and theories about how businesses operate, compete, provide value to customers and make money. It will provide a solid foundation to help students develop the general management skills (e.g., problem-solving, teamwork, critical thinking, networking and decision-making) required to be successful in their chosen career path.\r\n"
        },
        {
            "dept": "mgmt",
            "code": "1030",
            "credit": 3.0,
            "name": "History of Capitalism: Structures, Agents, Artefacts",
            "prereqs": "",
            "desc": "This core course provides students with a deeper understanding of the world they live in. It examines the historical forces that have shaped global capitalism, looking at the evolution of business organizations, different sectors, key stakeholders and their effect on individuals and society, both globally and in Canada. The course also helps develop critical thinking, analysis, reading, and writing skills.\r\nNote: Not open to iBBA students for credit.\r\nCourse Credit Exclusion: AP/HIST 1090 6.00 (prior to Fall 2009), AK/HIST 2110 3.00 (for BBA students only)"
        },
        {
            "dept": "mgmt",
            "code": "2050",
            "credit": 3.0,
            "name": "Business Analytics 2",
            "prereqs": "mgmt1050",
            "desc": "Managers use data to make critical decisions. Business analytics begins with data and transforms it into insights to aid organizational decision making and problem solving. This course builds on SB/MGMT 1050 3.00, equipping students with the skills to select relevant information, to use analytics tools, to apply appropriate quantitative techniques and to critically evaluate results leading to better and faster fact-based decisions\r\nPrerequisite: SB/MGMT 1050 3.00."
        },
        {
            "dept": "mgmt",
            "code": "2060",
            "credit": 3.0,
            "name": "Business and Society",
            "prereqs": "",
            "desc": "In this course, students reflect critically on the role of business in society.  Students appreciate the causes of tension between business and society and gain skills to assess a company\u0092s impact on and commitment to society.  Students learn how businesses have redfined the traditional purpose of profit maximization and have become a solution to society\u0092s most challenging problems.\r\nNote: Not open to iBBA students for credit."
        },
        {
            "dept": "mgmt",
            "code": "3030",
            "credit": 3.0,
            "name": "Creating Global Capitalism",
            "prereqs": "",
            "desc": "Examines the role of firms and entrepreneurs in the creation of the global economy over the past two centuries. Based on a historical perspective, the course addresses many contemporary issues related to globalization: the opportunities and problems of operating abroad, the role of governments in attracting and controlling foreign investment, the contribution of multinationals to growth and prosperity. \r\n\r\nNote: Open only to students in third- or fourth-year."
        },
        {
            "dept": "mgmt",
            "code": "3100",
            "credit": 3.0,
            "name": "Business Administration and the Law",
            "prereqs": "",
            "desc": "This course familiarizes students with basic legal concepts and principles relevant to business administration. Topics include: the Canadian judicial system; contract law; tort law (including negligence, product liability and defamation); forms of carrying on business (including sole proprietorships, partnerships and corporations); bailment, agency and employment law; real property and mortgage law; and intellectual property law (including trademarks, copyright and patents).\r\n\r\nCourse credit exclusions: AP/POLS 3165 3.00, AP/SOSC 3165 3.00."
        },
        {
            "dept": "mgmt",
            "code": "3150",
            "credit": 3.0,
            "name": "Business Case Analysis and Presentation Skills Development",
            "prereqs": "",
            "desc": "This course familiarizes students with key elements related to analyzing and developing comprehensive solutions for business cases with the goal of improving participants\u0092 ability to present their arguments in a compelling way, preparing them for job interviews, work and case competitions. Participants will also develop specific skills such as problem-solving, presentation building, story-telling and managing group dynamics. This course will require students to present frequently, coach others and reflect on their own progress based on feedback and observing their videotape performances. MBA students and former SSB students will provide feedback in some sessions. The course will culminate with an In-Class Case competition.\r\nPrerequisite: Successful completion of all Year 1 and 2 core courses."
        },
        {
            "dept": "mgmt",
            "code": "3200",
            "credit": 3.0,
            "name": "Management Issues in Nonprofit Sector",
            "prereqs": "",
            "desc": "This course serves as a general introduction to the nonprofit organization. It explores the historic roots and social, political and economic function of the non-profit sector in Canada. It examines both the legal and policy environments in which nonprofit organizations operate, and the unique organizational structures and governance practices that are characteristic of this sector. Additionally, this course will examine the accounting, marketing, staffing and fundraising issues of the sector. \r\n\r\nThis course will appeal both to students who intend to pursue careers in the non-profit sector, as well as to students who will be involved with non-profit organizations over the course of their careers (either as board members and volunteers, or because their work in government or in the private sector brings them into contact and partnership with non-profit organizations)."
        },
        {
            "dept": "mgmt",
            "code": "3300",
            "credit": 3.0,
            "name": "Canada's Business Environment",
            "prereqs": "",
            "desc": "Introduces visiting exchange students to Canada\u0092s history and geography and their influence on today\u0092s nation. Important learning objectives are to increase students\u0092 awareness of Canada\u0092s economic heritage, its social environment as well as its business sector, including entrepreneurship, leading industries, and \u0093branch plant economy&quot;. Emphasis is placed on Canada\u0092s policy environment, including federal-provincial relations, corporate governance and foreign policy.\r\nNote: Students must be on exchange from one of Schulich's undergraduate exchange partner schools. Schulich students in the BBA and iBBA programs cannot take this course."
        },
        {
            "dept": "mgmt",
            "code": "4100",
            "credit": 3.0,
            "name": "Integrative Business Simulation",
            "prereqs": "sgmt3000 intl3000 intl4400",
            "desc": "In this core course, student teams use a sophisticated business simulation program to manage a firm through multiple years of operation in a competitive industry. All teams must integrate their knowledge of functional areas of business and ethics to develop a mission and strategy for their firm, implement the strategy in a dynamic market and consistently revise their strategy in response to the strategic moves of competing firms. \r\nNote: Not available to exchange students visiting Schulich. \r\nPrerequisites: SB/SGMT 3000 3.0 or SB/INTL 3000 3.0 (Previously offered as SB/INTL 4400 3.00).\r\n\r\n"
        },
        {
            "dept": "mgmt",
            "code": "4300",
            "credit": 3.0,
            "name": "Corporate Social Responsibility in a Global Context",
            "prereqs": "mgmt2040 mgmt1040 intl1400 intl3400",
            "desc": "Provides an advanced understanding of CSR by taking a distinctly global focus through readings and case analysis. The global focus not only reflects the main themes and issues raised in CSR debates, but also enables the student to appreciate the topic from the perspective of various regional settings. The emphasis is on providing a conceptual understanding of why CSR has become so important and a basic overview of how corporations have responded to this challenge. \r\nPrerequisites: BBA : SB/MGMT 2040 3.00  (previously offered as SB/MGMT 1040 3.00) \r\nPrerequisites: iBBA: SB/INTL 1400 3.00 (previously offered as SB/INTL 3400 1.50 and INTL 3500 3.00)\r\n"
        },
        {
            "dept": "mgmt",
            "code": "4700",
            "credit": 3.0,
            "name": "Project Management",
            "prereqs": "",
            "desc": "This course prepares students to work on project teams.  Students will learn the basic concepts of project management and, through the use of project management software, will be exposed to computerized methodology.  In addition, students will learn the organizational and interpersonal aspects of project management.  Topics include project strategy, time management and scheduling, risk management, cost management, and resource management. "
        },
        {
            "dept": "mgmt",
            "code": "4800",
            "credit": 3.0,
            "name": "Management Consulting",
            "prereqs": "intl3000 intl4400",
            "desc": "Using lectures, cases, simulations and role-playing of typical client/consultant interactions, the course will detail the steps of the consulting process. Emphasis is placed on the practical application of analytical, communication and teamwork skills required of consultants. The course will also include an overview of the management consulting profession and the different types of firms that make up the industry. When possible, practicing management consultants will visit as guest lectures and interact with students. \r\r\nPrerequisites: SB/INTL 3000 3.0 (Previously offered as SB/INTL 4400 3.00).\r\nNote: Open to 4th Year BBA/iBBA students only."
        },
        {
            "dept": "mgmt",
            "code": "4850",
            "credit": 3.0,
            "name": "Work Placement",
            "prereqs": "",
            "desc": "Provides BBA and iBBA students with an opportunity to earn credit for gaining relevant work experience. This is a work-focused component of Experiential Education (EE) that finds the key to learning is in application of theories and concepts that students learn in other courses to the professional-like activities students engage in and reflect upon their actions."
        },
        {
            "dept": "mgmt",
            "code": "4900",
            "credit": 6.0,
            "name": "Guided Study: Management: Selected Problems in Management",
            "prereqs": "",
            "desc": "Guided Study: Management"
        },
        {
            "dept": "mgmt",
            "code": "4900",
            "credit": 3.0,
            "name": "Guided Study: Management: Selected Problems in Management",
            "prereqs": "",
            "desc": "Guided Study: Management"
        },
        {
            "dept": "mgmt",
            "code": "5000",
            "credit": 0.0,
            "name": "Professional Development in the Canadian Context",
            "prereqs": "",
            "desc": "This course is designed to help international students acquire skills and knowledge that will facilitate their professional development in a Canadian context. Students will (1) engage in self-assessment, (2) develop an awareness of their new professional environment, (3) learn how to interact with other professionals in the North American cultural setting, and (4) promote themselves in an effective manner.\r\nNote: Open to students in Schulich India only."
        },
        {
            "dept": "mgmt",
            "code": "5150",
            "credit": 3.0,
            "name": "Skills for Leadership",
            "prereqs": "",
            "desc": "This course develops thinking and reflective skills required for leadership in a complex world. Drawing on complexity theory and a multiple-perspectives framework that embraces sustainability, ethics, history, and diversity & inclusion, the course advances students\u0092 ability to think creatively, analytically, and strategically. Students learn to identify and reframe complex problems more effectively, and to develop and communicate innovative solutions compellingly."
        },
        {
            "dept": "mgmt",
            "code": "5500",
            "credit": 0.0,
            "name": "Joint MBA/LLB Seminar: Business and The Law ",
            "prereqs": "",
            "desc": "This course is designed to introduce students in their first-year of the Joint MBA/LLB Program (either business or law) to practical issues related to business and law. Following an initial introduction to the relationship between business and law, students will be exposed to guest lectures from a number of Canadian corporate and professional leaders representing a variety of industrial sectors."
        },
        {
            "dept": "mgmt",
            "code": "6090",
            "credit": 0.0,
            "name": "Strategy Field Study Formation",
            "prereqs": "",
            "desc": "The Strategy Field Study represents the culmination of a student's work in the MBA program. Through a two-term study of an actual organization, students working together as a team attempt to integrate, apply, and test all the knowledge and skills they have acquired throughout their studies. Students must form and register their groups for this Strategy Field Study in the term that they begin the process and must register in MGMT 6090 to formalize the start of the study. Students must also register for MGMT 6100.30 in either the first or second term they are working on the Strategy Field Study. \r\n\r\nNOTE: Students undertake their Strategy Field Study during the last two semesters of their program.\r\nPrerequisites: Students are required to complete all 5000-series Required Foundations of Management Core Courses before enrolling in this course.\r\nPrerequisite or corequisite: SB/SGMT 6000 3.00 and registration in SB/MGMT 6100 3.00 in the first or second term of the Field Study."
        },
        {
            "dept": "mgmt",
            "code": "6100",
            "credit": 3.0,
            "name": "Strategy Field Study",
            "prereqs": "",
            "desc": "The Strategy Field Study represents the culmination of a student's work in the MBA program. Through a two-term study of an actual organization, students working together as a team attempt to integrate, apply, and test all the knowledge and skills they have acquired throughout their studies. They are required to undertake an extensive and in-depth analysis of the external and internal environments and an evaluation of an organization's activities; on that basis they develop actionable recommendations and an implementation plan that contribute to the organization's future success. \r\nNOTE: Students undertake their Strategy Field Study during the last two semesters of their program."
        },
        {
            "dept": "mgmt",
            "code": "6200",
            "credit": 3.0,
            "name": "Business Administration and the Law",
            "prereqs": "",
            "desc": "This course familiarizes students with basic legal concepts and principles relevant to business administration.  Topics include: the Canadian judicial system; contract law; tort law (including negligence, product liability and defamation); forms of carrying on business (including sole proprietorships, partnerships and corporations); bailment, agency and employment law;  real property and mortgage law; and intellectual property law (including trademarks, copyright and patents).\r\nPrerequisite:  All 5100-series Required Foundations of Management Core Courses.\r\nNote:  Law students or students with law degrees are not permitted to take this course."
        },
        {
            "dept": "mgmt",
            "code": "6300",
            "credit": 3.0,
            "name": "Case Analysis and Presentation Skills",
            "prereqs": "actg5100 mgmt5150 mgmt5260 mktg5200 orgs5100",
            "desc": "This course is designed to give students the opportunity to practice and develop their analytical thinking and presentation skills. The key objective of the course is to train students to successfully participate in national and international case competitions. A secondary objective is to prepare students to successfully interview for management consulting positions. Second-year MBA students who enjoy analyzing cases and delivering presentations are encouraged to take the course.\r\nPrerequisites: SB/ACTG 5100 3.00, SB/MGMT 5150 3.00, SB/MGMT 5260 3.00, SB/MKTG 5200 3.00 & SB/ORGS 5100 3.00.\r\nCorequisite: SB/SGMT 6000 3.00"
        },
        {
            "dept": "mgmt",
            "code": "6350",
            "credit": 3.0,
            "name": "Professional Development for Managers",
            "prereqs": "",
            "desc": "This course is designed to help MBA students acquire skills and knowledge that will facilitate their professional development and increase their employability. The students (1) engage in self-assessment, (2) develop an awareness of the changing professional environment (3) learn how to interact with other professionals in different cultural and\norganizational settings, and (4) promote themselves in an efficient manner."
        },
        {
            "dept": "mgmt",
            "code": "6400",
            "credit": 3.0,
            "name": "International Study Tour",
            "prereqs": "",
            "desc": "This course takes students from the classroom into the field where they can see how the theoretical study of business (as well as government policy and NGOs) translates into the practical. It is also designed to enhance students\u0092 understanding of management, organizations, government policy and economics by examining these phenomena in the context of countries very different from Canada.\r\nPrerequisites: All 5100-series Required Foundations of Management Courses"
        },
        {
            "dept": "mgmt",
            "code": "6400",
            "credit": 1.5,
            "name": "International Study Tour",
            "prereqs": "",
            "desc": "This course takes students from the classroom into the field where they can see how the theoretical study of business (as well as government policy and non-governmental organizations) translates into the practical. It is also designed to enhance students\u0092 understanding of management, organizations, government policy and economics by examining these phenomena in the context of countries very different from Canada.\r\nPrerequisites: All 5100-series Required Foundations of Management Courses"
        },
        {
            "dept": "mgmt",
            "code": "6700",
            "credit": 3.0,
            "name": "Project Management                     ",
            "prereqs": "",
            "desc": "This course covers the strategic, organizational and operational aspects of managing projects.  Students learn to manage the technical, behavioural, political and cultural aspects of temporary groups performing unique tasks.  Topics covered include: defining deliverables, formulating project strategy, effective group organization and management, dynamically allocating resources, managing without authority, and resolving conflict.  Traditional cost and time management techniques are covered using contemporary software packages.\r\nPrerequisite:  All 5100-series Required Foundations of Management Core Courses."
        },
        {
            "dept": "mgmt",
            "code": "6800",
            "credit": 3.0,
            "name": "Innovation through Technology and Design",
            "prereqs": "",
            "desc": "Managing innovation, technology and design is key to success. This cross-functional course provides students with understanding and hands-on &quot;innovation lab&quot; experience applying the latest thinking in technology and design to innovation strategies. Suitable for all students, the course emphasizes the balancing of 21st century management skills of creativity, rigor and intuition in the end-to-end managment of customer experience."
        },
        {
            "dept": "mgmt",
            "code": "6810",
            "credit": 3.0,
            "name": "Creativity & Innovation: Techniques for a Rapidly Changing World",
            "prereqs": "",
            "desc": "Creativity and innovation are essential leadership skills in the ever-changing environment. This applied-learning course arms MBA graduates with the right mix of creativity-enhancing tools and techniques to explore innovation in contemporary business contexts. These techniques include lenses of human understanding, creativity, visual thinking and holistic visioning. Bridging a necessary gap, the outcomes are applied to practical business issues.\r\n\r\nPrerequisite: All 5100-series Required Foundations of Management Core Courses."
        },
        {
            "dept": "mgmt",
            "code": "6850",
            "credit": 3.0,
            "name": "Graduate Placement",
            "prereqs": "",
            "desc": "This course provides MBA students with an opportunity to gain relevant work experience. The work experience must be structured to satisfy the requirements of the relevant program / diploma / project. It must be approved by the program / diploma / course director. This course may be configured as a 0.00 credit, 1.50 credit or 3.00 credit course, depending on the program\u0092s / diploma\u0092s / course director\u0092s requirements."
        },
        {
            "dept": "mgmt",
            "code": "6900",
            "credit": 1.5,
            "name": "Individual Study: Selected Problems in Management",
            "prereqs": "",
            "desc": "A student may work with an individual faculty member on a topic of mutual interest.  These studies are co-designed by the student and the faculty member based on:  1) learning objectives  2)  means of achieving these objectives  3) method of evaluation."
        },
        {
            "dept": "mgmt",
            "code": "6900",
            "credit": 3.0,
            "name": "Individual Study: Selected Problems in Management",
            "prereqs": "",
            "desc": "A student may work with an individual faculty member on a topic of mutual interest.  These studies are co-designed by the student and the faculty member based on:  1) learning objectives  2)  means of achieving these objectives  3) method of evaluation."
        },
        {
            "dept": "mgmt",
            "code": "6901",
            "credit": 1.5,
            "name": "Individual Study: Selected Problems in Management",
            "prereqs": "",
            "desc": "A student may work with an individual faculty member on a topic of mutual interest.  These studies are co-designed by the student and the faculty member based on:  1) learning objectives  2)  means of achieving these objectives  3) method of evaluation."
        },
        {
            "dept": "mgmt",
            "code": "6904",
            "credit": 3.0,
            "name": "Acknowledging & Addressing Systemic Racism",
            "prereqs": "",
            "desc": "Systemic anti-black and anti-indigenous racism are deeply rooted, pervasive in all sectors of society, and deeply problematic.  This course aims to familiarize students with key concepts required for understanding systemic racism and to help them better recognize how it manifests in important institutional fields. It further aims to help them learn how to be anti-racist and to work toward changes that will result in more equity and justice in society at large and within specific sectors and arenas. \r\nNote: This course is open to any student registered in a Masters program at the Schulich School of Business. However, enrolment will be capped at 20 for the first iteration.\r\n"
        },
        {
            "dept": "mgmt",
            "code": "6905",
            "credit": 3.0,
            "name": "Bringing Business Ideas to Life",
            "prereqs": "",
            "desc": "N/A"
        },
        {
            "dept": "mgmt",
            "code": "6960",
            "credit": 3.0,
            "name": "Management Consulting",
            "prereqs": "",
            "desc": "MBA students active in the York Consulting Group (YCG) for a minimum of two terms, may receive course credit for their experience. This experiential course will give participants a comprehensive understanding of management consulting through fieldwork, preparing proposals and completing client projects and participation in YCG business meetings, educational workshops and professional development events."
        }
    ]
}