{
    "courses": [
        {
            "dept": "socm",
            "code": "6200",
            "credit": 3.0,
            "name": "Leadership in Social Sector Management",
            "prereqs": "",
            "desc": "This course discusses contemporary challenges facing leaders in the social sector in both Canadian and international contexts. The course is suitable for those who wish to develop leadership skills as either a senior manager or a board member. The course is team-taught, involves sectoral speakers and live cases, and offers flexibility in assignments.\r\n\r\nPrerequisites: All 5100-series Required Foundations of Management Core Courses.\r\n\r\n"
        },
        {
            "dept": "socm",
            "code": "6400",
            "credit": 3.0,
            "name": "Social Purpose Investing &amp; Finance",
            "prereqs": "",
            "desc": "Social impact investing, including microfinance, is an increasingly used tool within traditional finance, social enterprise, not-for-profit and international development spheres. This course takes an international and structural approach to considering the historical context of its origins, the operations of a microfinance institution, the investor's due diligence and monitoring of an impact investment, and the field's current issues and developments. \r\nPrerequisites: All 5000-level core courses."
        },
        {
            "dept": "socm",
            "code": "6900",
            "credit": 3.0,
            "name": "Individual Study - Social Sector Management",
            "prereqs": "",
            "desc": "A student may work with an individual faculty member on a topic of mutual interest.  These studies are co-designed by the student and the faculty member based on:  1) learning objectives  2)  means of achieving these objectives  3) method of evaluation."
        },
        {
            "dept": "socm",
            "code": "6900",
            "credit": 1.5,
            "name": "Individual Study - Social Sector Management",
            "prereqs": "",
            "desc": "A student may work with an individual faculty member on a topic of mutual interest.  These studies are co-designed by the student and the faculty member based on:  1) learning objectives  2)  means of achieving these objectives  3) method of evaluation."
        }
    ]
}