{
    "courses": [
        {
            "dept": "tran",
            "code": "1410",
            "credit": 3.0,
            "name": "Le français écrit pour traducteurs I",
            "prereqs": "",
            "desc": "Ce cours vise l'apprentissage et le renforcement de la grammaire de la phrase pour l'amélioration des compétences des futurs traducteurs, en compréhension et en production. Des activités de lecture et d'écriture de textes informatifs favoriseront la réflexion métalinguistique et l'acquisition de stratégies d'apprentissage et d'autocorrection.  "
        },
        {
            "dept": "tran",
            "code": "1411",
            "credit": 3.0,
            "name": "Le français écrit pour traducteurs II",
            "prereqs": "",
            "desc": "Ce cours vise l'approfondissement des notions de la grammaire de la phrase pour la consolidation des compétences des futurs traducteurs, en compréhension et en production. Des activités de lecture et d'écriture de textes littéraires (fiction et non-fiction) favoriseront la réflexion métalinguistique et l'acquisition de stratégies d'apprentissage et d'autocorrection.\nCondition préalable : GL/TRAN 1410 3.00."
        },
        {
            "dept": "tran",
            "code": "1604",
            "credit": 3.0,
            "name": "Écriture, réécriture, traduction, communication/Writing, Rewriting, Translation, Communication ",
            "prereqs": "",
            "desc": "This course introduces writing and rewriting across languages and cultures, and links these practices with translation and other types of cross-cultural communication. Students analyze English and French texts of various types and learn to rewrite them for specific audiences/purposes.Ce cours porte sur l'écriture et la réécriture de textes entre langues et cultures et met ces pratiques en rapport avec la traduction et d'autres types de communication transculturelle. Les étudiants analysent des textes (français et anglais) et apprennent à les réécrire à l'intention de publics divers. "
        },
        {
            "dept": "tran",
            "code": "1640",
            "credit": 3.0,
            "name": "Ideas Through Time and Space: Knowledge Transfer Across Languages and Cultures",
            "prereqs": "",
            "desc": "This course investigates the movement of ideas and knowledge across time, cultures, and languages through translated texts. Canonic texts are examined with a focus on identifying linguistic, religious, political and social factors involved when ideas cross language barriers and cultural boundaries."
        },
        {
            "dept": "tran",
            "code": "2210",
            "credit": 3.0,
            "name": "Introduction to Translation into English I",
            "prereqs": "",
            "desc": "This course introduces students to the tools, principles, and methods used in translation, from both a practical and theoretical perspective. Individual and group exercises and assignments help students acquire both basic skills and an understanding of the translation process."
        },
        {
            "dept": "tran",
            "code": "2210",
            "credit": 3.0,
            "name": "Traduction générale I",
            "prereqs": "",
            "desc": "Initiation aux outils, aux principes et aux méthodes de la traduction.  Introduction aux enjeux théoriques et pratiques. Les exercices et les travaux (de groupe et individuels) visent l'acquisition des compétences de base et de l'aptitude à analyser les démarches."
        },
        {
            "dept": "tran",
            "code": "2220",
            "credit": 3.0,
            "name": "Traduction générale II",
            "prereqs": "",
            "desc": "Approfondissement des principes et des méthodes de la traduction par le biais de textes de difficulté croissante. Les travaux et les exercices visent le perfectionnement de compétences de base et de l'aptitude à évaluer les démarches et les produits. Condition préalable : GL/TRAN 2210 3.00."
        },
        {
            "dept": "tran",
            "code": "2220",
            "credit": 3.0,
            "name": "Introduction to Translation into English II",
            "prereqs": "",
            "desc": "Students build on their understanding of translation in specialized fields. They continue to acquire specialized translation strategies. They increase and apply their knowledge of research tools and resources, learn techniques for resolving translation problems, and practice appropriate English usage. Prerequisite: GL/TRAN 2210 3.00."
        },
        {
            "dept": "tran",
            "code": "2250",
            "credit": 3.0,
            "name": "Stylistique comparée / Comparative Stylistics",
            "prereqs": "",
            "desc": "Étude des problèmes de traduction découlant des différences et similarités lexicales, syntaxiques et stylistiques entre l\u0092anglais et le français. Students learn to solve translation problems, access appropriate references, and explain their choices using the terminology of the field."
        },
        {
            "dept": "tran",
            "code": "2280",
            "credit": 3.0,
            "name": "Documentation and Terminology",
            "prereqs": "",
            "desc": "This blended course introduces future translators to research methods in documentation and terminology. Assignments focus on\r\nthe development of critical and analytical thinking and on the practical application of these methods to translation projects.\r\nCourse credit exclusions: GL/TRAN 3260 3.00, GL/TRAN 4370 3.00."
        },
        {
            "dept": "tran",
            "code": "2280",
            "credit": 3.0,
            "name": "Documentation et terminologie / Documentation and Terminology",
            "prereqs": "",
            "desc": "Ce cours semi-présentiel initie les futurs traducteurs aux méthodes de recherche en documentation et en terminologie. Les\r\ntravaux sont axés sur le développement de l\u0092esprit critique et analytique et sur l\u0092application pratique de ces méthodes à des\r\nprojets de traduction.\r\nCourse credit exclusions/Cours incompatibles : GL/TRAN 3260 3.00, GL/TRAN 4370 3.00."
        },
        {
            "dept": "tran",
            "code": "3210",
            "credit": 3.0,
            "name": "Traduction spécialisée - Médecine et sciences de la santé            ",
            "prereqs": "",
            "desc": "Introduction à la traduction de textes spécialisés en médecine et en sciences de santé. Les étudiants développent leurs aptitudes à la recherche documentaire et terminologique. Ils acquièrent de nouvelles stratégies de traduction et perfectionnent leurs compétences.  Condition préalable : GL/TRAN 2210 3.00 et GL/TRAN 2220 3.00."
        },
        {
            "dept": "tran",
            "code": "3210",
            "credit": 3.0,
            "name": "Translation of Specialized Texts Into English, Level I   ",
            "prereqs": "",
            "desc": "Introduction to translation in a specialized area. Students acquire strategies for handling specialized translations from French to English. They increase and apply their knowledge of research tools and resources, learn techniques for resolving translation problems, and practice appropriate English usage. Prerequisite: GL/TRAN 2220 3.00."
        },
        {
            "dept": "tran",
            "code": "3220",
            "credit": 3.0,
            "name": "Traduction spécialisée - juridique, administrative, financière",
            "prereqs": "",
            "desc": "Introduction à la traduction de textes techniques et spécialités dans les domaines juridiques, administratifs et financiers. Les étudiants poursuivent le perfectionnement de leurs compétences traductives et de leurs aptitudes à la recherche documentaire et terminologique. Condition préalable :  GL/TRAN 3210 3.00. "
        },
        {
            "dept": "tran",
            "code": "3220",
            "credit": 3.0,
            "name": "Translation of Specialized Texts into English II",
            "prereqs": "tran3210",
            "desc": "Students build on their understanding of translation strategies. Knowledge in a chosen field is expanded by reading specialized texts and participating in discussions. Texts will vary in their genre, register and complexity. Prerequisite: GL/TRAN 3210 3.00."
        },
        {
            "dept": "tran",
            "code": "3270",
            "credit": 3.0,
            "name": "Théorie de la traduction / Theory of Translation",
            "prereqs": "",
            "desc": "Initiation à la réflexion critique sur la traduction, aux concepts clés en traductologie et à la recherche. Students are introduced to the schools of thought that have shaped Translation Studies since the second half of the 20th century."
        },
        {
            "dept": "tran",
            "code": "3270",
            "credit": 3.0,
            "name": "Theory in Translation/Teoría de la traducción",
            "prereqs": "",
            "desc": "This course explores historical, linguistic, and philosophical approaches to the field of translation studies from various theoretical perspectives. It covers canonical texts on translation, particularly from the Western tradition./Mediante el uso de textos de autores importantes dentro de la traducción occidental, en este curso se exploran los enfoques linguísticos y filosóficos de la traductología. Prerequisite: to be enrolled in the SP-EN/EN-SP Translation Certificate Program. Course credits exclusion: GL/TRAN 3270, GL/TRAN 3270."
        },
        {
            "dept": "tran",
            "code": "3310",
            "credit": 3.0,
            "name": "Problems in Professional Writing      ",
            "prereqs": "",
            "desc": "Students learn to problem-solve through writing, the essence of good professional communication. They learn to select information for a given audience and choose effective language for the needs of government, business, and industry."
        },
        {
            "dept": "tran",
            "code": "3900",
            "credit": 3.0,
            "name": "Onsite Professional Internship/Stage professionnel en entreprise",
            "prereqs": "",
            "desc": "Au cours d\u0092un trimestre, les stagiaires effectuent l'équivalent de quatre semaines de travail à temps plein dans un cabinet ou service de traduction, une entreprise ou un organisme. Les stagiaires sont encadrés par un traducteur chevronné, un agent de communication, un webmestre ou autre professionnel expérimenté. Leur travail est noté par un membre du corps professoral.\r\nOver the course of one semester, interns perform the equivalent of four weeks of fulltime work in a translation firm or unit, a business or an organization. They are supervised by a senior translator, a communications officer, webmaster or other experienced professional. Their work is graded by a faculty member.\r\n\r\nCondition préalable : Permission de l'École de traduction ou du Programme de communications / Prerequisite: Permission from the School of Translation or the Communications Program."
        },
        {
            "dept": "tran",
            "code": "4225",
            "credit": 3.0,
            "name": "Introduction to Translation into Language B/Introduction à la traduction vers la langue B",
            "prereqs": "",
            "desc": "Introduction to translation from students' dominant (A) language into their (B) language. Working with a variety of texts of increasing complexity, students further their knowledge of their B language and familiarize themselves with translation norms in this language./Initiation à la traductino de la langue dominante (A) vers la langue (B). Les étudiants traduisent des textes variés et de complexité croissante. Ils perfectionnent leur langue B et se familiarisent avec les normes de traduction dans cette langue. Prerequisite/Condition préalable : GL/TRAN 2210 3.00 and/et GL/TRAN 2220 3.00."
        },
        {
            "dept": "tran",
            "code": "4230",
            "credit": 3.0,
            "name": "Translation of specliazed texts into language B/Traduction de textes spécialisés vers la langue B",
            "prereqs": "tran4225",
            "desc": "In this second course on translation into the B language students translate texts from a variety of specialized fields. They are introduced to area-specific resources, and hone their translation skills as well as their skills in their non-dominant language./Dans ce deuxième cours de traduction vers la langue B, les étudiants traduisent des textes de divers domaines de spécialisation. Ils s'initient aux ressoures propres à ces domaines, perfectionnnent leurs aptitudes à la traduction et approfondissent leur langue B. Prerequisite/Condition préalable : GL/TRAN 4225 3.00"
        },
        {
            "dept": "tran",
            "code": "4235",
            "credit": 3.0,
            "name": "Introduction à la traduction audiovisuelle : Introduction to audiovisual translation",
            "prereqs": "tran3220",
            "desc": "Ce cours initie les étudiants et les étudiantes aux enjeux théoriques et pratiques de la traduction audiovisuelle. Les exercices d'analyse, de transcription, de traduction, de scénarisation et de sous-titrage les préparent à gérer différentes phases de la communication multimodale./This course provides a theoretical and practical introduction to audiovisual translation. Exercises such as analysis, transcription, translation, screenwriting and subtitling prepare students to deal with different stages of multimodal communication. Prerequisite: GL/TRAN 3220 3.00. Corequisite: GL/TRAN 3220 3.00. "
        },
        {
            "dept": "tran",
            "code": "4250",
            "credit": 3.0,
            "name": "Techniques of Revision in Translation",
            "prereqs": "",
            "desc": "Through this course students learn to analyse texts from the perspectives of communication theory, discourse and revision practice. The course also helps students hone their advanced communication and revision skills. "
        },
        {
            "dept": "tran",
            "code": "4250",
            "credit": 3.0,
            "name": "Technique de la révision en traduction       ",
            "prereqs": "",
            "desc": "Initiation au travail de post-traduction. Les étudiants pratiquent la révision unilingue pour améliorer le texte traduit en fonction des normes linguistiques rédactionnelles, ainsi que la révision bilingue pour vérifier le degré d'équivalence entre l'original et la traduction. "
        },
        {
            "dept": "tran",
            "code": "4310",
            "credit": 3.0,
            "name": "Techniques in Business and Technical Writing I   ",
            "prereqs": "coms3310",
            "desc": "Builds on the skills learned in GL/TRAN 3310 3.00. Students learn to direct their writing to a given audience, to begin to work with layout and design of documents, and develop the skills required by team and project writing. Prerequisite: GL/TRAN/COMS 3310 3.00."
        },
        {
            "dept": "tran",
            "code": "4320",
            "credit": 3.0,
            "name": "Techniques in Business and Technical Writing II ",
            "prereqs": "tran4310",
            "desc": "Students develop the analytic, writing, and documentation skills needed to produce software user manuals, reference guides, tutorials, online and hypertext information. They learn to work in a team-based production environment on real software documentation problem. Prerequisite: GL/TRAN 4310 3.00."
        },
        {
            "dept": "tran",
            "code": "4330",
            "credit": 3.0,
            "name": "Documentation in Business and Industry",
            "prereqs": "tran4320",
            "desc": "Students learn the requirements for online documentation from a theoretical and research perspective and develop project management skills. Prerequisite: GL/TRAN 4320 3.00.\n\r\nNote: Course open to students majoring in Translation and to students registered in the Certificate of Technical &amp; Professional Writing."
        },
        {
            "dept": "tran",
            "code": "4510",
            "credit": 3.0,
            "name": "Advanced Translation Practicum/Travaux pratiques avancés en traduction ",
            "prereqs": "tran3260 tran4370 tran3210",
            "desc": "Under the supervision of an Instructor, students undertake small- and large-scale translation projects proposed by internal (York) or external clients, applying advanced documentation, translation, self-revision, revision and quality control techniques to real-life projects./Sous la direction d'un professeur, les étudiants entreprennent des projets de traduction (de petite et grande envergure) pour des clients internes (York) et externes. Ils appliquent leurs compétences poussées en documentation, traduction, auto-révision, révision et contrôle de la qualité. Prerequisites/Conditions préalables : GL/TRAN 3260 3.00, GL/TRAN 4370 3.00, GL/TRAN 3210 3.00. Corequisite/Condition concomitante : GL/TRAN 3220 3.00."
        },
        {
            "dept": "tran",
            "code": "4525",
            "credit": 3.0,
            "name": "Translation and Localization Tools",
            "prereqs": "tran2280",
            "desc": "In this course students are acquainted with the main tools used to facilitate translation and localization. We assess their usefulness as well as methods of integrating local cultures through localizing software and multimedia products. Prerequisite : GL/TRAN 2280 3.00."
        },
        {
            "dept": "tran",
            "code": "4636",
            "credit": 3.0,
            "name": "History, Translation and Ancient Civilizations",
            "prereqs": "",
            "desc": "The historical evolution of Western civilization is explored from the dawn of writing to the Roman Empire from a cross-cultural perspective, with special emphasis on ancient civilizations and languages in contact, and the dissemination of knowledge and cultural exchange through translation."
        },
        {
            "dept": "tran",
            "code": "4638",
            "credit": 3.0,
            "name": "History, Translation, and European Societies",
            "prereqs": "",
            "desc": "The evolution of Western civilization is explored from early Christianity to the electronic age from a cross-cultural perspective, with special emphasis on European societies and languages in contact, and the dissemination of knowledge and cultural exchange through translation."
        },
        {
            "dept": "tran",
            "code": "4900",
            "credit": 3.0,
            "name": "Online Professional Internship/Stage professionnel à distance",
            "prereqs": "",
            "desc": "Au cours d'un trimestre, les stagiaires effectuent, à distance, l'équivalent de quatre semaines de travail à temps plein pour un cabinet ou service de traduction, une entreprise ou un organisme. Les stagiaires sont encadrés par un traducteur chevronné, un agent de communication, un webmestre ou autre professionnel expérimenté. Leur travail est noté par un membre du corps professoral. \r\nOver the course of one semester, interns perform the equivalent of four weeks of fulltime work for a translation firm or unit, a business or an organization. Their distancelearning internship is supervised by a senior translator, a communications officer, webmaster or other experienced professional. Their work is graded by a faculty member.\r\n\r\nCondition préalable : Permission de l'École de traduction ou du Programme de communications / Prerequisite: Permission from the School of Translation or the Communications Program."
        },
        {
            "dept": "tran",
            "code": "4910",
            "credit": 3.0,
            "name": "Methodology of Spanish-English Translation 1: Advanced practice, technologies and project management",
            "prereqs": "sp3550 tran3260 sp3200 tran3205",
            "desc": "This course provides intensive practice translating pragmatic texts from various domains. Conceptual and methodological tools from translation studies and applied linguistics are intended to teach students to analyze texts and plan and carry out a variety of translation projects. Prerequisites: GL/SP 3550 3.00 and GL/TRAN 3260 3.00. GL/SP 3200 3.00 and GL/TRAN 3205 3.00. PRIOR TO FALL 2011: Course credit exclusions: GL/SP 4610 3.00, GL/TRAN 4610 3.00. PRIOR TO FALL 2010: course credit exclusion: GL/SP 4610 3.00 (EN), GL/TRAN 4610 3.00 (EN)."
        },
        {
            "dept": "tran",
            "code": "4915",
            "credit": 3.0,
            "name": "Specialized Spanish-English Translation: Literary and Humanistic",
            "prereqs": "sp3550 tran3260 tran3200 tran3205",
            "desc": "This course provides advanced practice and reflection on the translation of literary and humanistic texts. Notions of literacy and critical theory are applied to analyze and translate literary texts from various genres and diverse cultural contexts. Prerequisites: GL/SP 3550 3.00, GL/TRAN 3260 3.00, GL/TRAN 3200 3.00 and GL/TRAN 3205 3.00. Course credit exclusion: GL/SP 4615 3.00, GL/TRAN 4615 3.00."
        },
        {
            "dept": "tran",
            "code": "4920",
            "credit": 3.0,
            "name": "Methodology of Spanish-English/English-Spanish Translation 2: Revision and project management",
            "prereqs": "sp3550 tran3260 tran3200 tran3205 sp4910",
            "desc": "This course is geared toward the practice of translation within the conditions of current professional translation environments.  The course covers revision, translation technologies and project management and is based on practices and trends in the translation industry.  Prerequisites:  GL/SP 3550 3.00, GL/TRAN 3260 3.00, GL/TRAN 3200 3.00, GL/TRAN 3205 3.00 and GL/SP 4910  3.00. Course credit exclusion: GL/SP/TRAN 4620 3.00."
        },
        {
            "dept": "tran",
            "code": "5100",
            "credit": 3.0,
            "name": "Translation Studies / Traductologies",
            "prereqs": "",
            "desc": "A survey of the various theoretical approaches to studying translation, since the beginning of the twentieth century. The historical and cultural contexts of appearance of each approach are taken into account."
        },
        {
            "dept": "tran",
            "code": "5155",
            "credit": 3.0,
            "name": "Voyage, Déplacement, Traduction",
            "prereqs": "",
            "desc": "Le séminaire vise à mieux comprendre l\u0092inscription de la traduction dans un environnement multilingue et multiethnique, ainsi que dans les enjeux de la mondialisation. Seront abordées en particulier les questions du brouillage des frontières et du positionnement identitaire."
        },
        {
            "dept": "tran",
            "code": "5190",
            "credit": 3.0,
            "name": "Cultural Translation: Beyond Textual Practices",
            "prereqs": "",
            "desc": "This course explores the translation of cultural practices in various contexts and periods, primarily through non-textual means. Readings and case studies serve as the basis for an examination of the intersections between culture and translation."
        },
        {
            "dept": "tran",
            "code": "5324",
            "credit": 3.0,
            "name": "Traduction Bancaire                    ",
            "prereqs": "",
            "desc": "Specialized Translation (Economics). This seminar includes a considerable number of practical exercises as well as a theoretical component. Students first examine the principles, methods and objectives common to all fields of specialized translation before analyzing the terminology, knowledge base and writing conventions specific to one particular field.\n\r\n"
        },
        {
            "dept": "tran",
            "code": "5700",
            "credit": 3.0,
            "name": "Interpreting Studies",
            "prereqs": "",
            "desc": "This course familiarizes students with research in the nascent subdiscipline of 'interpreting studies.'  Students explore the quantitative and qualitative methods used to examine interpreting in various modes and settings, including the community, the courtroom and the conference hall. \r\n"
        },
        {
            "dept": "tran",
            "code": "5900",
            "credit": 3.0,
            "name": "Reading Course/Travail Individuel      ",
            "prereqs": "",
            "desc": "Special reading courses may be arranged with individual faculty members subject to the approval of the Director of the Graduate Program. Reading courses are designed to enable a student to pursue a research interest or acquire special skills which are not covered by available courses."
        }
    ]
}