{
    "courses": [
        {
            "dept": "actg",
            "code": "2010",
            "credit": 3.0,
            "name": "Introduction To Financial Accounting I ",
            "prereqs": "",
            "desc": "This two core course sequence develops students' understanding of financial accounting information so that they can be informed and effective users of the information. The courses focus on uses of accounting information for different decisions and from different stakeholder perspectives, and consider the economic and behavioural effects that accounting treatments have on users and preparers. Readings from current publications are used to demonstrate practical applications of the issues discussed in class. Classroom techniques such as case studies, classroom discussions, student presentations and group and individual research projects (intended to develop students' critical skills) are employed.\r\n\r\nNote: SB/ACTG 2011 3.00 is not available to exchange students visiting Schulich unless it is a full year exchange and SB/ACTG 2010 3.00 is taken in the fall.\r\n\r\nCourse credit exclusions: GL/ECON 2710 3.00, AP/ECON 3580 3.00, AP/ECON 4200 3.00."
        },
        {
            "dept": "actg",
            "code": "2011",
            "credit": 3.0,
            "name": "Introduction To Financial Actg II",
            "prereqs": "",
            "desc": "This two-course sequence develops students' understanding of financial accounting information so that they can be informed and effective users of the information. The courses focus on uses of accounting information for different decisions and from different stakeholder perspectives, and consider the economic and behavioural effects that accounting treatments have on users and preparers. Readings from current publications are used to demonstrate practical applications of the issues discussed in class. Classroom techniques such as case studies, classroom discussions, student presentations and group and individual research projects (intended to develop students' critical skills) are employed.\r\nPrerequisite: SB/ ACTG 2010 3.00.\r\nCourse Credit Exclusion: GL/ECON 2710 3.00."
        },
        {
            "dept": "actg",
            "code": "2020",
            "credit": 3.0,
            "name": "Management Accounting Concepts",
            "prereqs": "",
            "desc": "This core course stresses the understanding of basic accounting concepts which underlie management decisions for performance appraisal, pricing, output, financing, investment and other purposes encountered in various organizational settings. Emphasis is placed on applying these concepts in case situations, rather than on technical aspects of management accounting.\r\n\r\nNote: This course cannot be completed via the MBA program as a Guided Study course.\r\nCorequisite: SB/ACTG 2011 3.00.\r\nCourse Credit Exclusion: GL/ECON 2720 3.00."
        },
        {
            "dept": "actg",
            "code": "3000",
            "credit": 3.0,
            "name": "Financial Reporting and Analysis",
            "prereqs": "actg2011",
            "desc": "Publicly-issued financial statements are &quot;general purpose&quot; statements, issued to a variety of users and prepared using generally accepted accounting principles (GAAP). However, the statements are based on management's financial reporting objectives (e.g. profit maximization; income smoothing; tax minimization), as well as on many management estimates and disclosure decisions. Statements based on GAAP do not usually reflect the needs of the individual user. In this course, students will learn to apply diagnostic, analytical and judgmental skills to understanding financial statements from the point of view of external users who need to make various types of decisions such as performance evaluation, loan decisions, and stock valuation.\r\n\r\nNote: Not available to exchange students visiting Schulich.\r\nPrerequisite:  SB/ACTG 2011 3.00"
        },
        {
            "dept": "actg",
            "code": "3110",
            "credit": 3.0,
            "name": "Intermediate Financial Accounting I    ",
            "prereqs": "actg2011",
            "desc": "Examines the concepts, objectives and techniques underlying asset valuation and income determination, including alternative asset measurement bases and accounting for changing prices. The course has a decision orientation. Special emphasis is placed on accounting policy choices and the criteria by which such choices are made, as well as on analyzing financial statements prepared under differing accounting policy alternatives.\r\nNote: Not available to exchange students visiting Schulich.\r\nPrerequisite: SB/ACTG 2011 3.00; third-year BBA or iBBA standing required."
        },
        {
            "dept": "actg",
            "code": "3120",
            "credit": 3.0,
            "name": "Intermediate Financial Accounting II ",
            "prereqs": "actg3110",
            "desc": "This is an extension of SB/ACTG 3110 3.00, but with a primary focus on the valuation and presentation of liabilities and owners' equity. Major topics include current, long-term and contingent liabilities; leases; pensions; corporate income tax allocation; capital transactions, earnings per share and analysis of financial statements under differing accounting policies. The criteria by which both preparers and users make decisions are emphasized.\r\nNote: Not available to exchange students visiting Schulich.\r\nPrerequisite: SB/ACTG 3110 3.00.\n"
        },
        {
            "dept": "actg",
            "code": "4000",
            "credit": 3.0,
            "name": "Teaching Accounting in the Intermediate-Senior Divisions - A",
            "prereqs": "",
            "desc": "This course begins to prepare students to be qualified teachers of Accounting in Ontario classrooms. It allows students to examine the theories, philosophies, knowledge, policies and practices specific to teaching Accounting in the intermediate and senior grades.\nThis course is only available to students in the Bachelor of Education (BEd) degree program."
        },
        {
            "dept": "actg",
            "code": "4001",
            "credit": 3.0,
            "name": "Teaching Accounting in the Intermediate-Senior Divisions - B",
            "prereqs": "",
            "desc": "This course continues to prepare students to be qualified teachers of Accounting in Ontario classrooms. It develops students' expertise in the theories, philosophies, knowledge, policies and practices specific to teaching Accounting areas in order to further develop students' expertise for teaching this subject. ED/ACTG 4000 (Part A) is a prerequisite for this course.\nOnly available to students in the Bachelor of Education (BEd) program. "
        },
        {
            "dept": "actg",
            "code": "4200",
            "credit": 3.0,
            "name": "Contemporary Issues In Accounting      ",
            "prereqs": "actg4600 actg4710",
            "desc": "This course concentrates on the application of accounting theory to controversial issues in financial accounting.  The topics covered vary with the changing importance of current accounting issues.  Source materials include current accounting literature and the research publications of professional accounting organizations.  The development of research, writing and analytical skills is emphasized.\r\nNote: Not available to exchange students visiting Schulich.\r\nPrerequisite: SB/ACTG 4600 3.00 &amp; SB/ACTG 4710 3.00\r\n"
        },
        {
            "dept": "actg",
            "code": "4400",
            "credit": 3.0,
            "name": "Managerial Cost Accounting &amp; Analysis  ",
            "prereqs": "actg2020",
            "desc": "This course develops problem-solving skills for internal accounting applications.  Topics include: cost concepts and analysis, cost accumulation for product costing and variance analysis, and cost analysis for decisions involving alternatives.  Cases and problems are used.\r\nNote: Not available to exchange students visiting Schulich.\r\nPrerequisite:  SB/ACTG 2020 3.00 \r\n"
        },
        {
            "dept": "actg",
            "code": "4600",
            "credit": 3.0,
            "name": "Auditing Standards &amp; Applications  ",
            "prereqs": "actg3120 actg3120",
            "desc": "This course focuses on the standards and applications underlying the latest function and the responsibilities of external and internal auditors. The theory of audit evidence and certain basic techniques are used to provide an understanding of auditing methodology. The auditor's responsibility beyond the financial audit and current developments in auditing are also examined. Students may be expected to complete a research paper or project.\r\n\r\nNote: Not available to exchange students visiting Schulich.\r\nPrerequisites: SB/ACTG 3120 3.00 and fourth-year BBA or iBBA standing. Students who were on exchange in third-year may take SB/ACTG 3120 3.00 and SB/ACTG 4600 3.00 concurrently."
        },
        {
            "dept": "actg",
            "code": "4710",
            "credit": 3.0,
            "name": "Introduction To Income Taxation  ",
            "prereqs": "actg3120 actg3120",
            "desc": "The basic concepts and techniques of income taxation and applications to personal and corporate contexts are examined. Emphasis is placed upon accounting applications.\r\nNote: Not available to exchange students visiting Schulich.\r\nPrerequisites: SB/ACTG 3120 3.00 and fourth-year BBA or iBBA standing. Students who were on exchange in third-year may take SB/ACTG 3120 3.00 and SB/ACTG 4710 3.00 concurrently."
        },
        {
            "dept": "actg",
            "code": "4720",
            "credit": 3.0,
            "name": "Advanced Income Taxation               ",
            "prereqs": "actg4710",
            "desc": "A continuation of SB/ACTG 4710 3.00, this course concentrates in greater detail on the taxation of business income.\r\nNote: Not available to exchange students visiting Schulich.\r\nPrerequisite: SB/ACTG 4710 3.00."
        },
        {
            "dept": "actg",
            "code": "4900",
            "credit": 3.0,
            "name": "Guided Study - Selected Problems in Accounting",
            "prereqs": "",
            "desc": "N/A"
        },
        {
            "dept": "actg",
            "code": "5100",
            "credit": 3.0,
            "name": "Financial Accounting For Managers      ",
            "prereqs": "",
            "desc": "This course examines the assumptions and decision usefulness of financial statements that are prepared for creditors and shareholders.  \r\nEmphasis is placed on interpretation of financial statements, using examples from several companies.  Issues including sustainability and \r\nethics are incorporated in class discussions and cases. "
        },
        {
            "dept": "actg",
            "code": "5200",
            "credit": 3.0,
            "name": "Financial Decisions for Managers",
            "prereqs": "",
            "desc": "This course will provide students with an understanding of the financial implications of managers' decision making and how financial measures can be used to monitor and control business operations. Concepts will include capital budgeting, financial statements, break-even analysis, non-routine decision making, pricing decisions, profit and loss calculation, ROI, and Operating Budget and budgeted financial statements."
        },
        {
            "dept": "actg",
            "code": "5210",
            "credit": 1.5,
            "name": "Management Accounting",
            "prereqs": "actg5100",
            "desc": "This course provides an introduction to management accounting techniques that are useful in management decision making situations such as cost management, pricing special orders, determining service levels and performance appraisal.  The non-applicability of external reporting figures for most management decisions is reviewed.  In arriving at managerial decisions, all stakeholder interests are considered, including socially responsible decision making around key issues.   \r\nPrerequisite: SB/ACTG 5100 3.00"
        },
        {
            "dept": "actg",
            "code": "6120",
            "credit": 3.0,
            "name": "Intermediate Financial Accounting I",
            "prereqs": "actg5100 actg5101 macc5101",
            "desc": "Examines the accounting concepts and \nprinciples that relate to the asset accounts. \nAttention is given to alternative asset \nmeasurement bases and related revenue \nrecognition and income determination bases. \r\n\nPrerequisite: SB/ACTG 5100 3.00; SB/ACTG 5101 3.00 (previously offered as SB/MACC 5101 3.00) for \nstudents pursuing the Schulich Diploma in \nIntermediate Accounting (DIAc). "
        },
        {
            "dept": "actg",
            "code": "6130",
            "credit": 3.0,
            "name": "Intermediate Financial Accounting for Finance Majors",
            "prereqs": "actg5100 mfin5100",
            "desc": "This course is meant specifically for non-accountants who want a broader understanding of accounting issues and how they impact financial statements. This course covers both sides of the balance sheet focusing on understanding the impact of the issues on the financial statements instead of the detailed technical application. This course is not recognized as a course by the accounting designations. \r\nPrerequisite: for MBA and IMBA students: SB/ACTG 5100 3.00 or equivalent; for MF students: SB/MFIN 5100 3.00.\r\nCourse credit exclusions: SB/ACTG 6120 3.00 and SB/ACTG 6140 3.00 (either SB/ACTG 6130 3.00 or SB/ACTG 6120 3.00 and SB/ACTG 6140 3.00).\n"
        },
        {
            "dept": "actg",
            "code": "6140",
            "credit": 3.0,
            "name": "Intermediate Financial Accounting II",
            "prereqs": "actg6120",
            "desc": "This is an extension of SB/ACTG 6120 3.00 with emphasis on the liability of equity accounts. Major topics include: tax allocation, pensions, leases, capital transactions and financial statement analysis.\r\nPrerequisite: SB/ACTG 6120 3.00."
        },
        {
            "dept": "actg",
            "code": "6160",
            "credit": 3.0,
            "name": "Advanced Financial Accounting",
            "prereqs": "actg6120 actg6140",
            "desc": "The final course in the three-course financial accounting core, this course emphasizes accounting for international activities and intercorporate investments. The application of accounting principles to case situations in specialized industries and non-profit organizations is also considered.\r\nPrerequisites: SB/ACTG 6120 3.00 &amp; SB/ACTG 6140 3.00.\r\nNote: Not available to exchange students visiting Schulich.\r\n"
        },
        {
            "dept": "actg",
            "code": "6201",
            "credit": 1.5,
            "name": "Multi-Competency Case Analysis for Accountants",
            "prereqs": "actg6120",
            "desc": "This course will build on the case analysis fundamentals learned and applied in the previous terms courses. Focusing on financial accounting, the students will work on integrating their analysis with other competency areas including tax, assurance, management accounting, finance and corporate governance. In addition to the specific competency areas, case analysis considers the impact of the development, implementation and use of information systems for the management and processing of data in business settings.\r\nPrerequisite: SB/ACTG 6120 3.00\r\nCorequisite: SB/ACTG 6140 3.00\r\nNOTE: Open only to MACC students and MBA students pursuing the CPA designation."
        },
        {
            "dept": "actg",
            "code": "6250",
            "credit": 3.0,
            "name": "Financial Reporting and Analysis",
            "prereqs": "actg5100 actg5101 macc5101",
            "desc": "Examines why stock prices react when firms announce their earnings, and why certain trends in industry earnings affect stock prices of many firms in that industry. Under highly stylised Generally Accepted Accounting Principles (GAAP), abnormal accounting earnings of a firm can be discounted to derive an estimate of the share price. This course therefore offers a direct link between accounting policy choices, abnormal earnings (based on adjusted reported earnings) and stock price valuation.\r\nPrerequisite: SB/ACTG 5100 3.00.\r\nPrerequisite:  SB/ACTG 5101 3.00 (previously offered as SB/MACC 5101 3.00) for students pursuing the Schulich Diploma in Intermediate Accounting (DIAC).\r\nCourse Credit Exclusion: SB/FINE 6600 3.00 (either SB/ACTG 6250 3.00 or SB/FINE 6600 3.00, but not both, may be taken for credit)."
        },
        {
            "dept": "actg",
            "code": "6301",
            "credit": 3.0,
            "name": "Integrative Case Analysis for Accountants",
            "prereqs": "actg6201 macc6201",
            "desc": "This is the second of six case courses for the MAcc Program This course requires students to integrate knowledge obtained in the courses taken throughout the program and apply that knowledge to cases that incorporate all of the competency areas, including financial reporting, strategy and governance, assurance, finance, management accounting, and taxation.\r\nPrerequisite: SB/ACTG 6201 1.50 (previously offered as SB/MACC 6201 1.50)\r\nNOTE: Open only to MACC students and MBA students pursuing the CPA designation"
        },
        {
            "dept": "actg",
            "code": "6550",
            "credit": 1.5,
            "name": "Advanced Management Accounting",
            "prereqs": "actg5211 macc5211",
            "desc": "This course focuses on managerial planning, performance, and control systems in organizations that direct the behaviour of corporate officers and managers, in order to achieve a specific goal. Different tools and techniques are reviewed including methods of incentivizing employee productivity, compliance, and overall performance assessment. The course emphasizes decision-making through the analysis of case studies and discussions.\r\nPrerequisite: SB/ACTG 5211 3.00 (previously offered as SB/MACC 5211 3.00)"
        },
        {
            "dept": "actg",
            "code": "6600",
            "credit": 3.0,
            "name": "Auditing Standards &amp; Applications",
            "prereqs": "actg5100 actg5101 macc5101",
            "desc": "This course focuses on the standards and applications underlying the latest functions and responsibilities of external and internal \r\nauditors. The theory of audit evidence and certain basic techniques are used to provide an understanding of auditing methodology. The auditor's responsibility beyond the financial audit and current developments in auditing are also examined. Students may be expected to complete a research paper or project.\r\nPrerequisite: SB/ACTG 5100 3.00.\r\nPrerequisite:  SB/ACTG 5101 3.00 (previously offered as SB/MACC 5101 3.00) for students pursuing the Schulich Diploma in Intermediate Accounting (DIAC)."
        },
        {
            "dept": "actg",
            "code": "6610",
            "credit": 3.0,
            "name": "Advanced Auditing",
            "prereqs": "actg6600",
            "desc": "This course extends students' knowledge in the area of auditing by examining the role of the profession in society today, evaluating current issues facing auditors, and building on their understanding of the general audit framework and its fundamental theories. It also examines specific audit topics such as legal liability, comprehensive auditing, fraud, audit of not-for-profit organizations, environmental auditing and small business audits. \r\n\r\nPrerequisite: SB/ACTG 6600 3.00.\n\r\n"
        },
        {
            "dept": "actg",
            "code": "6710",
            "credit": 3.0,
            "name": "Introduction to Income Taxation",
            "prereqs": "actg5100 actg5101 macc5101",
            "desc": "The basic concepts and techniques of income taxation and applications to personal and corporate contexts are examined.\r\nPrerequisite: SB/ACTG 5100 3.00.\r\nPrerequisite:  SB/ACTG 5101 3.00 (previously offered as SB/MACC 5101 3.00) for students pursuing the Schulich Diploma in Intermediate Accounting (DIAC).\r\nCourse Credit Exclusion: SB/ACTG 6700 3.00 (either SB/ACTG 6710 3.00 or SB/ACTG 6700 3.00, but not both, may be taken for credit)."
        },
        {
            "dept": "actg",
            "code": "6720",
            "credit": 3.0,
            "name": "Advanced Income Taxation",
            "prereqs": "actg6710",
            "desc": "A continuation of SB/ACTG 6710 3.00, this course concentrates in greater detail on the taxation of business income.\r\nPrerequisite: SB/ACTG 6710 3.00."
        },
        {
            "dept": "actg",
            "code": "6730",
            "credit": 3.0,
            "name": "Managerial Tax Planning",
            "prereqs": "actg6710 actg6720",
            "desc": "This course builds on ACTG 6710 and ACTG 6720. It explores how individual and corporate taxpayers identify and implement tax planning opportunities in an attempt to maximize after-tax incomes, subject to complying with tax laws, while achieving business or financial strategies. \r\nPrerequisites: SB/ACTG 6710 3.00, SB/ACTG 6720 3.00."
        },
        {
            "dept": "actg",
            "code": "6900",
            "credit": 1.5,
            "name": "Individual Study:  Accounting",
            "prereqs": "",
            "desc": "A student may work with an individual faculty member on a topic of mutual interest.  These studies are co-designed by the student and the faculty member based on:  1) learning objectives  2)  means of achieving these objectives  3) method of evaluation."
        },
        {
            "dept": "actg",
            "code": "6900",
            "credit": 3.0,
            "name": "Individual Study - Accounting",
            "prereqs": "",
            "desc": "A student may work with an individual faculty member on a topic of mutual interest.  These studies are co-designed by the student and the faculty member based on:  1) learning objectives  2)  means of achieving these objectives  3) method of evaluation."
        },
        {
            "dept": "actg",
            "code": "7020",
            "credit": 3.0,
            "name": "Empirical Methods in Accounting Research",
            "prereqs": "",
            "desc": "An in-depth survey of empirical methods and techniques used in accounting research."
        },
        {
            "dept": "actg",
            "code": "7040",
            "credit": 3.0,
            "name": "Advanced Topics in Accounting Research",
            "prereqs": "",
            "desc": "Experimental Design for Behaviour in Organizations."
        },
        {
            "dept": "actg",
            "code": "7900",
            "credit": 3.0,
            "name": "Independent Study - Accounting",
            "prereqs": "",
            "desc": "N/A"
        }
    ]
}